[
    {
        "subreddit": "GoogleAnalytics",
        "created": 1743401549.0,
        "title": "Path exploration using GSC(Google search console)",
        "author": "Coffee_summer_rain",
        "id": "1jnwova",
        "selftext": "I would like to check the user paths based on the \\[query\\] observed in Google Search Console. \n\nIs there any way to filter keywords in GA's Path Exploration to analyze this?",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1jnwova/path_exploration_using_gscgoogle_search_console/",
        "num_comments": 5,
        "comments": [
            {
                "body": "To analyze user paths based on specific queries from Google Search Console in GA4, you first need to link GSC to GA4 and identify the landing pages associated with your queries.   \n  \nThen, use Path Exploration in GA4, starting from those landing pages, and create a segment for organic traffic to visualize user behaviors.   \nWhile you can't filter directly by keywords, this approach allows you to see how users interact with your site based on the queries they came from.\n\nIt's not an obvious method, but it helps.",
                "author": "Lyes7592",
                "score": 2
            },
            {
                "body": "Yes, it can be helpful to check landing pages. Thank you for your comment.\n\nA single keyword can lead to multiple landing pages, so I'm trying to find out which page receives the most traffic. I was wondering if it's possible to expand and view the path exploration for each page.\n\nAlternatively, I am considering adding UTM parameters to create segments for tracking. However, this would result in redirects, which is something I'm concerned about.",
                "author": "Coffee_summer_rain",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "You can use the query filter in GSC to find the pages showing in SERP for specific phrases.\n\nHowever you can't legitimately follow the path through GA4 as the keyword referral data is removed. So all you know is that they landed on the page from Google, and not necessarily what phrase was used.\n\nYou could try to find out how many referrals were sent by Google to a page using search console and see how that translates to all referrals noted in GA4 from Google for that page. The numbers will likely not be the same for various reasons I won't get into here.\n\nBut you will never be able to 100% accurately say that a certain searcher found you on google for a specific phrase and then follow their path from the search engine to the final page in their path.",
                "author": "emuwannabe",
                "score": 1
            },
            {
                "body": "That's awesome! It's great that AdSense's free CMP can now handle Google Analytics consent too. This will definitely make things easier and reduce the need for other CMPs. If you're looking for an even smoother way to track data without worrying about cookies, you might want to check out Qwestify. It's easy to set up, tracks data accurately, and helps you stay compliant with privacy rules. It's a great alternative if you're looking for hassle-free analytics!",
                "author": "the-fire-in-me",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1715733237.0,
        "title": "What Analytics code should I install besides Google Analytics?",
        "author": "anglercore",
        "id": "1cs7v3m",
        "selftext": "My website receives approximately 55,000 visits each month. I've noticed that GA4 doesn't provide accurate data, so I'm looking for an alternative analytics solution.\n\nWhich analytics tools would you recommend for precise website data? Is Bing Analytics a good option?\n\n",
        "score": 6,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1cs7v3m/what_analytics_code_should_i_install_besides/",
        "num_comments": 32,
        "comments": [
            {
                "body": "In what way is your analytics data inaccurate? Is it inaccurate because you are running a CMP? Is it inaccurate because GA is not installed correctly? Describe inaccurate. Since web analytics tools are JavaScript running on page load, other web analytics JavaScript will have the same issues.",
                "author": "Humble_Elderberry_25",
                "score": 11
            },
            {
                "body": "Clarity. It’s Microsoft’s answer to GA4 and I’m kind of preferring it right now. Nice compliment to GA4 and totally replaced Hotjar for me. And free.",
                "author": "nachokings",
                "score": 7
            },
            {
                "body": "I use both GA4 and Clarity. Clarity is actually like Hotjar (but free), you can actually see what your visitors are doing, where they clicked, what errors they encountered etc. Very insightful. It doesn't replace GA4 but it's a very helpful addition.",
                "author": "WizzardXT",
                "score": 5
            },
            {
                "body": "If you use the bigquery google analytics integration, you can see far more ga4 data than is shown on google analytics. Then you can create your own dashboards in looker studio for free",
                "author": "Big_al_big_bed",
                "score": 4
            },
            {
                "body": "Check out StatsPro. You're right that Google analytics doesn't display accurate metrics, the reason for that is about 30% of users have ad blockers installed, GA gets blocked by that. If you use something like StatsProIO, you'll actually see all of your users. You can install both side by side and see what the difference is.",
                "author": "deadfire55",
                "score": 3
            },
            {
                "body": "ad blockers will block other web analytics tools too. which web analytics tools are immune to ad blockers?",
                "author": "Humble_Elderberry_25",
                "score": 3
            },
            {
                "body": "Google analytics gets blocked by basically all ad blockers, along with every single major analytics tracker.\n\n  \nThe solution is to do a open source analytics platform such as Plausible.io(im not affliated in any way shape or form, but I just use it).\n\nAnd then set up reverse proxys to your server then their servers. That way since all the tracking data first goes to your backend, ad blocks cannot block it. \n\n  \nAsk your developer to look into it, heck I can set it up for you.",
                "author": "xatnagh",
                "score": 2
            },
            {
                "body": "To be honest, I recently switched to Publytics, the data is not sampled, so everything I see even in the real-time panel is precise.",
                "author": "Alarmed-Emotion5057",
                "score": 2
            },
            {
                "body": "thank you!",
                "author": "anglercore",
                "score": 2
            },
            {
                "body": "You also get that exact same benefit in return. It is like advertising in the days of yellow pages publishing. Everybody is in the yellow pages. And if you are not, well that is one less way people can find you.",
                "author": "Humble_Elderberry_25",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "MS Clarity is already mentioned. I'll just add that it gives you user session recordings and frontend errors reports as well. So it's like Inspectlet + GA, and totally free.",
                "author": "ruskixakep",
                "score": 1
            },
            {
                "body": "It would be hard to say. Depends on what is making it not accurate. The problem could persist.",
                "author": "scientistpreneur",
                "score": 1
            },
            {
                "body": "Piwik pro is great too.",
                "author": "pieceofmind2112",
                "score": 1
            },
            {
                "body": "Are you comfortable sharing all this data of your websites and your users with both Microsoft and Google? How do you handle GDPR?\n\nHave you considered using a self-hosted solution instead? Like Matomo/UXWizz?",
                "author": "XCSme",
                "score": 1
            },
            {
                "body": "I've been learning more about StatsPro but it's been tough to find good info over Google. DM'd you.",
                "author": "trafficstar",
                "score": 1
            },
            {
                "body": "Possibly server-side GTM could help a little to achieve something similar staying on GA4.",
                "author": "small_foot_2490",
                "score": 1
            },
            {
                "body": "I also use both Clarity and GA4.",
                "author": "Humble_Elderberry_25",
                "score": 1
            },
            {
                "body": "Yes. I am comfortable. I use a CMP for GDPR.",
                "author": "Humble_Elderberry_25",
                "score": 1
            },
            {
                "body": "That's good.\n\n\nMy main pushback with GA, is not really GDPR related, but that Google will use the visitors and stats of my website for better ad targeting for my competitors, using demographic groups.",
                "author": "XCSme",
                "score": 1
            },
            {
                "body": "That's good.\n\n\nMy main pushback with GA, is not really GDPR related, but that Google will use the visitors and stats of my website for better ad targeting for my competitors, using demographic groups.",
                "author": "XCSme",
                "score": 1
            },
            {
                "body": "I don't run ads, so I don't win anything back.",
                "author": "XCSme",
                "score": 1
            },
            {
                "body": "A web site is the modern day equivalent to a road side billboard or a yellow pages ad. Even if you do not buy ads on search and social media, your have to pay for a host for your site.",
                "author": "Humble_Elderberry_25",
                "score": 1
            },
            {
                "body": "I agree. I do have a website though, how is this related to ads?\n\nThe problem with ads, is that I can not compete with big corporations spending millions and driving the keyword prices up. I don't want to make their job even easier to steal my customers, or offer them worse services for higher prices, just because of their stronger marketing.",
                "author": "XCSme",
                "score": 1
            },
            {
                "body": "the original post did not make a reference to google ads. the original post was regarding accurate data in google analytics.",
                "author": "Humble_Elderberry_25",
                "score": 1
            },
            {
                "body": "Well, GA is blocked by most ad-blockers by default, so it's already like 50% off.",
                "author": "XCSme",
                "score": 0
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1738954478.0,
        "title": "Google Analytics",
        "author": "LegitimateMind9286",
        "id": "1ik2kwp",
        "selftext": "GA4 Question\n\nHello everyone, I hope you're doing well!\n\nMy marketing team is working on tracking voluntary contributions in GA4. We plan to use BetterLinks and Analytify, with WooCommerce handling value passing.\n\nJust to confirm—this setup can also be used to track donations, right? As long as it’s configured correctly, it should technically function like a purchase. We’re also planning to track this from different countries but only using 1 GA4 property . As far as I know, GA4 compares the currency using the current exchange rate set in GA4. Right?\n\nRegarding BetterLinks, we’re using it for affiliate links and link shortening. It provides a dashboard in WordPress and utilizes the GA4 API key. I’ve already confirmed that it does not pass data to GA4 but instead collects data and displays it in the WordPress dashboard. However, my concern is whether using a shortlink would classify the traffic as a referral, potentially causing issues when identifying the actual source.\n\nI’d appreciate your insights on this, as well as any recommendations for tracking donations.\n\nThanks!\n\n",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1ik2kwp/google_analytics/",
        "num_comments": 7,
        "comments": [
            {
                "body": "The only thing that we will pass is just the value, so I guess it is not consistent as PII. As of now there is no plan to use CMP, but thank you for sharing that. Yes it does impact measurement specifically if the users decline",
                "author": "LegitimateMind9286",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Yes you can track donations and purchases from woocomerce in GA4.\nYou can pass the currency to GA4.\nYes your short links from BetterLinks will show as referral traffic.",
                "author": "HawkeyMan",
                "score": 1
            },
            {
                "body": "Do not load PII into GA4. Are you employing a CMP on your site? That will impact measurement.",
                "author": "Humble_Elderberry_25",
                "score": 1
            },
            {
                "body": "Thank you! So I guess instead of using betterlinks we can just URL campaign builder and track it via UTM",
                "author": "LegitimateMind9286",
                "score": 1
            },
            {
                "body": "Yes, UTMs, while ugly are still the best for this. That said, there are ways you can use fragments (to shorten your URLs) the replace those fragments with the full URL that includes the UTMs. It’s pretty clever!",
                "author": "HawkeyMan",
                "score": 1
            },
            {
                "body": "Good stuff!",
                "author": "Humble_Elderberry_25",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1740733356.0,
        "title": "Spike of not set (country dimension) in GA4, on the same day every month.",
        "author": "Appropriate_Rip_1471",
        "id": "1j03itc",
        "selftext": "From March 24, we have been getting a spie on the 10th of every month a spike in traffic that has no attributes. They don't engage at all, just come on, average 90% bounce rate. \n\nAm I being bot attacked? Is it Search Engines crawling? How can I diagnose it? ",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1j03itc/spike_of_not_set_country_dimension_in_ga4_on_the/",
        "num_comments": 5,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Same here. For us, it's on the 17th of each month since last May. Like clockwork. Always about 40% more sessions than normal. And often it seems to be coming from cities with known Facebook data centers. (As opposed to known AWS data centers in Ashburn, VA and Dublin.)",
                "author": "Conscious_Dog_9427",
                "score": 1
            },
            {
                "body": "Cookiebot or some other CMP that you use scans the number of pages that your site has. You need to exclude the IP of their scanner.",
                "author": "fialdic",
                "score": 1
            },
            {
                "body": "This looks like bot traffic, which can seriously mess with your analytics. Qwestify helps by focusing on real human interactions instead of relying on cookies. Since it tracks actual engagement, it can filter out bot noise automatically. Try checking the visitor patterns in Qwestify’s dashboard, you’ll likely get a much clearer picture of what’s happening without the usual GA4 discrepancies.",
                "author": "the-fire-in-me",
                "score": 1
            },
            {
                "body": "Set up GTM variable by hostname, specifying only your website (matches ReGex).",
                "author": "zatherine12",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1738676306.0,
        "title": "#MeToo - custom events don't show up in GA4 (GDPR ?)",
        "author": "is_manu",
        "id": "1ihhu07",
        "selftext": "Hi guys,\n\ni got a similar problem with GA4. Custom properties never arrive.\n\n  \nIn GTM, in preview mode, i see my event fired and all my custom properties (DLV) displayed in the \"eventSettingsTable\".\n\nIn the debugViews of GA4, i see my event fired too, bug all my custom properties are in the datas.\n\nI m in Europe with GDPR, any custom settings to set for allow my event/custom properties in the cmp?  \nOr the problem is elsewhere.\n\nHave you already managed this problem?",
        "score": 0,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1ihhu07/metoo_custom_events_dont_show_up_in_ga4_gdpr/",
        "num_comments": 2,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "holy crap, writing my post and my mind blow up... \"GA4 don't show my custom properties because the DLV are empty at when my event is fired ... maybe\".\n\nAnd that it. I add a custom property with a string, and i see it in GA4.\n\nSo the DLV are not set et available when the event is fired.\n\nour service provider seems to inject the data layer with javascript, the delay seems the problem.",
                "author": "is_manu",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1730965789.0,
        "title": "Help with not/set key events ",
        "author": "DaanOuwehand",
        "id": "1gllcou",
        "selftext": "[Traffic attribution](https://preview.redd.it/p2n2srzmpfzd1.png?width=1132&format=png&auto=webp&s=00aec0cbffb8c52d055dba7de4a02946e6ea8519)\n\nI'm working with a B2C lead-gen account. The website is built on a custom CMS, and we're using SST (not TAGGRS) alongside Cookiebot for CMP. Our Google Ads setup includes a tracking template, so UTM parameters are consistently present, and traffic attribution seems to be working fine overall.\n\n**The Problem**  \nWe track conversions when users submit a form, triggering a \"formsubmit\" event. However, attribution for these conversions is poor; about 90% of them show up as \"not set.\n\n[Event attribution](https://preview.redd.it/bcnuxn6wpfzd1.png?width=860&format=png&auto=webp&s=de66c65e42a44d353b66955122fad6d0429e67ff)\n\nI've checked the setup, and the Google Tag fires before the conversion occurs. There are no duplicate events, and I don’t think redirects are causing the issue either.\n\nI know it is our SST set-up, because I checked when this problem occured and this happened after switching to SST. I think session\\_id, user\\_id and source are all present:\n\nhttps://preview.redd.it/ier8egjp9gzd1.png?width=1034&format=png&auto=webp&s=3ed516aeea55ce9d08ebb00f52fb31410bef9b50\n\nAny ideas on what we could look into to fix this?",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1gllcou/help_with_notset_key_events/",
        "num_comments": 2,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "https://support.google.com/tagmanager/answer/7549390?hl=nl\n\nDo you have this in SST?",
                "author": "Playah-3-",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1660317184.0,
        "title": "GA4 events are 25% of UA Events",
        "author": "dhuck",
        "id": "wmnppk",
        "selftext": "Anyone experiencing big difference in event counts in GA4 compared to UA? For some events I'm seeing 25% of the event count in GA4 compared to UA.\n\nMy setup:\n\n* I've added GA4 to my sites while running UA.\n* Both UA and GA4 tags are implemented using Google Tag Manager.\n* Events are sent two ways:\n\n1. Using dataLayer.push()\n2. Using GTM Triggers and Tags\n\nSome notes from my analysis:\n\n1. I am making sure to pull data that is at least 2+ days old, per Google's recommendation\n2. I thought the issue was with dataLayer.push implementation vs. using GTM's Tags/Triggers -- but that doesn't always seem to be the case, sometimes they match and sometimes they don't, regardless of implementation style\n3. I can't see any correlation between certain devices (mobile, desktop) or browsers dropping events\n4. Some events are matching -- even small events with less than 20 conversions a day, larger events tend to be closer\n5. GA4 has been implemented for approximately 32 days\n6. Page views and user counts are close\n7. The main event giving me trouble is a Vimeo tracking event (plays, video progress, pauses)\n\nMy thinking here is that the machine learning in GA4 isn't making up for the difference. \n\nI'm okay with the data being off by 10%, but I'm seeing huge differences. Any thoughts on how to resolve this?",
        "score": 7,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/wmnppk/ga4_events_are_25_of_ua_events/",
        "num_comments": 3,
        "comments": [
            {
                "body": "a few low hanging fruit come to mind:\n\n- do you have a cookie banner/CMP in place? are UA and GA4 subject to the same rules?\n- are equivalent events using the same triggers?",
                "author": null,
                "score": 6
            },
            {
                "body": "I had a similar issue and it was our cookie consent script. It requires 3rd party scripts to be white listed and a GA4 resource wasn't. I was kicking myself because it was an obvious thing to check and I had completely forgotten about it.",
                "author": "Jolly_Janner",
                "score": 2
            },
            {
                "body": "Should be simple enough to compare things and find where the discrepancy is. If you can’t do that, I’d suggest going and doing the basic Google Analytics certification to learn the basics of how to use an analytics platform.",
                "author": "TheMacMan",
                "score": -2
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1753010865.0,
        "title": "marketing update: 9 tactics that helped us get more clients and 5 that didn't",
        "author": "goudgirls",
        "id": "1m4mm4r",
        "selftext": "About a year ago, my boss suggested that we concentrate our B2B marketing efforts on LinkedIn.\n\nWe achieved some solid results that have made both LinkedIn our obvious choice to get clients compared to the old-fashioned blogs/email newsletters.\n\nHere's what worked and what didn't for us. I also want to hear what has worked and what hasn't for you guys.\n\n# 1. Building CEO's profile instead of the brand's, WORKS\n\nI noticed that many company pages on LinkedIn with tens of thousands of followers get only a few likes on their posts. At the same time, some ordinary guy from Mississippi with only a thousand followers gets ten times higher engagement rate.\n\nThis makes sense: social media is about people, not brands. So from day one, I decided to focus on growing the CEO/founder's profile instead of the company's. This was the right choice, within a very short time, we saw dozens of likes and thousands of views on his updates.\n\n# 2. Turning our sales offer into a no brainer, WORKS LIKE HELL\n\nAt u/offshorewolf, we used to pitch our services like everyone else: “We offer virtual assistants, here's what they do, let’s hop on a call.” But in crowded markets, clarity kills confusion and confusion kills conversions.\n\nSo we did one thing that changed everything: we productized our offer into a dead-simple pitch.\n\n**“Hire a full-time offshore employee for $99/week.”**\n\nThat’s it. No fluff, no 10-page brochures. Just one irresistible offer that practically sells itself.\n\nBy framing the service as a product with a fixed outcome and price, we removed the biggest friction in B2B sales: decision fatigue. People didn’t have to *think*, they just *booked a call*.\n\nThis move alone cut our sales cycle in half and added consistent weekly revenue without chasing leads.\n\nIf you're in B2B and struggling to convert traffic into clients, try turning your service into a flat-rate product with one-line clarity. It worked for us, *massively*.\n\n# 3. Growing your network through professional groups, WORKS\n\nA year ago, the CEO had a network that was pretty random and outdated. So under his account, I joined a few groups of professionals and started sending out invitations to connect.\n\nEvery day, I would go through the list of the group's members and add 10-20 new contacts. This was bothersome, but necessary at the beginning. Soon, LinkedIn and Facebook started suggesting relevant contacts by themselves, and I could opt out of this practice.\n\n# 4. Sending out personal invites, WORKS! (kind of)\n\nLinkedIn encourages its users to send personal notes with invitations to connect. I tried doing that, but soon found this practice too time-consuming. As a founder of 200-million fast-growing brand, the CEO already saw a pretty impressive response rate. I suppose many people added him to their network hoping to land a job one day.\n\nWhat I found more practical in the end was sending a personal message to the most promising contacts AFTER they have agreed to connect. This way I could be sure that our efforts weren't in vain. People we reached out personally tended to become more engaged. I also suspect that when it comes to your feed, LinkedIn and Facebook prioritize updates from contacts you talked to.\n\n# 5. Keeping the account authentic, WORKS\n\nI believe in authenticity: it is crucial on social media. So from the get-go, we decided not to write anything FOR the CEO. He is pretty active on other platforms where he writes in his native language.\n\nWe pick his best content, adapt it to the global audience, translate in English and publish. I can't prove it, but I'm sure this approach contributed greatly to the increase of engagement on his LinkedIn and Facebook accounts. People see that his stuff is real.\n\n# 6. Using the CEO account to promote other accounts, WORKS\n\nThe problem with this approach is that I can't manage my boss. If he is swamped or just doesn't feel like writing, we have zero content, and zero reach. Luckily, we can still use his \"likes.\"\n\nToday, LinkedIn and Facebook are unique platforms, like Facebook in its early years. When somebody in your network likes a post, you see this post in your feed even if you aren't connected with its author.\n\nSo we started producing content for our top managers and saw almost the same engagement as with the CEO's own posts because we could reach the entire CEO's network through his \"likes\" on their posts!\n\n# 7. Publishing video content, DOESN'T WORK\n\nI read million times that video content is killing it on social media and every brand should incorporate videos in its content strategy. We tried various types of video posts but rarely managed to achieve satisfying results.\n\nWith some posts our reach was higher than the average but still, it couldn't justify the effort (making even home-made-style videos is much more time-consuming than writings posts).\n\n# 8. Leveraging slideshows, WORKS (like hell)\n\nWe found the best performing type of content almost by accident. As many companies do, we make lots of slideshows, and some of them are pretty decent, with tons of data, graphs, quotes, and nice images. Once, we posted one of such slideshow as PDF, and its reach **skyrocketed!**\n\nIt wasn't actually an accident, every time we posted a slideshow the results were much better than our average reach. We even started creating slideshows specifically for LinkedIn and Facebook, with bigger fonts so users could read the presentation right in the feed, without downloading it or making it full-screen.\n\n# 9. Adding links to the slideshows, DOESN'T WORK\n\nI tried to push the slideshow thing even further and started adding links to our presentations. My thinking was that somebody do prefer to download and see them as PDFs, in this case, links would be clickable. Also, I made shortened urls, so they were fairly easy to be typed in.\n\nNobody used these urls in reality.\n\n# 10. Driving traffic to a webpage, DOESN'T WORK\n\nEvery day I see people who just post links on LinkedIn and Facebook and hope that it would drive traffic to their websites. I doubt it works. Any social network punishes those users who try to lure people out of the platform. Posts with links will never perform nearly as well as posts without them.\n\nI tried different ways of adding links, as a shortlink, natively, in comments... It didn't make any difference and I couldn't turn LinkedIn or Facebook into a decent source of traffic for our own webpages.\n\nOn top of how algorithms work, I do think that people simply don't want to click on anything in general, they WANT to stay on the platform.\n\n# 11. Publishing content as LinkedIn articles, DOESN'T WORK\n\nLinkedIn limits the size of text you can publish as a general update. Everything that exceeds the limit of 1300 characters should be posted as an \"article.\"\n\nI expected the network to promote this type of content (since you put so much effort into writing a long-form post). In reality articles tended to have as bad a reach/engagement as posts with external links. So we stopped publishing any content in the form of articles.\n\nIt's better to keep updates under the 1300 character limit. When it's not possible, adding links makes more sense, at least you'll drive some traffic to your website. Yes, I saw articles with lots of likes/comments but couldn't figure out how some people managed to achieve such results.\n\n# 12. Growing your network through your network, WORKS\n\nWhen you secure a certain level of reach, you can start expanding your network \"organically\", through your existing network. Every day I go through the likes and comments on our updates and send invitations to the people who are:\n\nfrom the CEO's 2nd/3rd circle and\n\nfit our target audience.\n\nSince they just engaged with our content, the chances that they'll respond to an invite from the CEO are pretty high. Every day, I also review new connections, pick the most promising person (CEOs/founders/consultants) and go through their network to send new invites. LinkedIn even allows you to filter contacts so, for example, you can see people from a certain country (which is quite handy).\n\n# 13. Leveraging hashtags, DOESN'T WORK (atleast for us)\n\nNow and then, I see posts on LinkedIn overstuffed with hashtags and can't wrap my head around why people do that. So many hashtags decrease readability and also look like a desperate cry for attention. And most importantly, they simply don't make that much difference.\n\nI checked all the relevant hashtags in our field and they have only a few hundred followers, sometimes no more than 100 or 200. I still add one or two hashtags to a post occasionally hoping that at some point they might start working.\n\nFor now, LinkedIn and Facebook aren't Instagram when it comes to hashtags.\n\n# 14. Creating branded hashtags, WORKS (or at least makes sense)\n\nWhat makes more sense today is to create a few branded hashtags that will allow your followers to see related updates. For example, we've been working on a venture in China, and I add a special hashtag to every post covering this topic.\n\nThanks for reading.\n\nAs of now, the CEO has around 2,500 followers. You might say the number is not that impressive, but I prefer to keep the circle small and engaged. Every follower who sees your update and doesn't engage with it reduces its chances to reach a wider audience. Becoming an account with tens of thousands of connections and a few likes on updates would be sad.\n\nWe're in B2B, and here the quality of your contacts matters as much as the quantity. So among these 2,5000 followers, there are lots of CEOs/founders. And now our organic reach on LinkedIn and Facebook varies from 5,000 to 20,000 views a week. We also receive 25–100 likes on every post. There are lots of people on LinkedIn and Facebook who post constantly but have much more modest numbers.\n\nWe also had a few posts with tens of thousands views, but never managed to rank as the most trending posts. This is the area I want to investigate. The question is how to pull this off staying true to ourselves and to avoid producing that cheesy content I usually see trending.",
        "score": 0,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1m4mm4r/marketing_update_9_tactics_that_helped_us_get/",
        "num_comments": 1,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1743709847.0,
        "title": "How do you manage GA4 access for your clients?",
        "author": "dillwillhill",
        "id": "1jqsarg",
        "selftext": "Hi all,\n\nI just read that it is against Google TOS to allow multiple people access to [one account](https://workspace.google.com/terms/use_policy/#:~:text=%E2%80%A2%20to%20grant%20multiple%20individuals%20access%20to%20an%20individual%20End%20User%20Account%20other%20than%20via%20the%20delegation%20features%20provided%20within%20the%20Services%3B). In the past, we'd request our clients to share GA4, GSC, GTM and other account accesses to a central email, say team@domain.com. That way all of our client GA4s are in one central place and we don't have to log into another gmail account for every client, or if we want someone else on the team to quickly see the account. The downsides are account security (which we mitigate with Bitwarden), and now apparently it is a violation.\n\nOn platforms like Google Ads or Meta, it's easy to get access on behalf of our agency and assign roles that way, but GA4 doesn't have an equivalent 'Manager Account' solution so clients would have to send access to [john@domain.com](mailto:john@domain.com), [sally@domain.com](mailto:sally@domain.com), etc for every member that needed access. \n\nWhen you request GA4 access from clients, what email do they share access with? A shared email or an individual team members email? What is the best practice here? \n\nThanks. ",
        "score": 3,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1jqsarg/how_do_you_manage_ga4_access_for_your_clients/",
        "num_comments": 6,
        "comments": [
            {
                "body": "Interesting, I haven't seen anything around that being a violation. Any chance you have a link to more info on that? We grant access to agencies like that occasionally as well.",
                "author": "Strict-Basil5133",
                "score": 3
            },
            {
                "body": "You link to the Google Workspace policy, which makes sense…it is licensed by user. Google Analytics is a different product with its own policies and accounts. Your Google login grants you access to both, but they are different applications.",
                "author": "mike3sullivan",
                "score": 2
            },
            {
                "body": "It's the \"one account\" hyperlink in my original post",
                "author": "dillwillhill",
                "score": 2
            },
            {
                "body": "I’ve seen examples in different agencies; one shared account, team accounts or individual accounts used for accessing clients’ GA.\n\nI’ve always recommended that clients grant access to individual accounts (not personal accounts, but Google Accounts setup on company email). \n\nThen only a few people (usually) need to sign NDAs and/or DPAs. It also assures the client that there is a dedicated team or individual.\n\nThat is, in my view, the best practice. But it’s definitely my impression that the common practice for an agency is to use one or more shared accounts.",
                "author": "phillipvs82",
                "score": 1
            },
            {
                "body": "You might be able to solve this problem with an internal GA4 access tracker. (Using Airtable, Notion)\nKeep details of who has access to what, level of access, person who requested the person who granted it. \n\nMost clients aren't versed with the technical stuff so try creating a simple Loom video demonstrating how to add users to GA4.\n\nGive admin access to only one or two people. \n\nConsidering using a password manager for your team. \nMaybe you could stop shared GA4 logins.",
                "author": "DataWingAI",
                "score": 1
            },
            {
                "body": "ty!",
                "author": "Strict-Basil5133",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1735637954.0,
        "title": "Help Needed: Analyzing User Journeys with Google Analytics (GA4)",
        "author": "BaudouinNF_98",
        "id": "1hqbe0w",
        "selftext": "Hi everyone,\n\nI recently completed Google and Coursera training on Google Analytics and decided to offer my services to a local Cash and Carry store to put my skills into practice. The manager was super cool, and I managed to:\n\n1. Link their website to Google Analytics.\n2. Connect their social media pages and email campaigns to track traffic sources.\n3. Fix events and set up key events (e.g., purchases, form submissions, etc.).\n\nHowever, I’ve hit a roadblock:\n\n* I can’t figure out how to **analyze the journey of each user** on the platform.\n* I want to understand **what pages they visit, how long they stay, and the key actions they take** on the site.\n* Without this information, I’m struggling to do meaningful segmentation or recommend appropriate marketing actions.\n\nI realize this might be basic for some of you, but I’d truly appreciate guidance on:\n\n1. How to track and analyze detailed user journeys in GA4.\n2. How to segment users based on their behaviour and actions.\n3. Any recommendations for books, resources, or people to follow to gain practical expertise in GA4 and digital analytics.\n\nI’d be incredibly grateful for your advice. I know I lack experience, but I’m eager to learn.\n\nThanks so much in advance for your help!",
        "score": 8,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1hqbe0w/help_needed_analyzing_user_journeys_with_google/",
        "num_comments": 4,
        "comments": [
            {
                "body": "You need to use the Funnel Exploration and the Path Exploration reports available in Exploration section of GA4 to do that. Go to YouTube and search for creating path exploration report etc. There are plenty of tutorials covering the setup.",
                "author": "nsillk",
                "score": 3
            },
            {
                "body": "OMG! You're doing great!\n\nI've found the User Journey and Funnel analysis tools to be incredibly difficult to use.  Not intuitive at all.",
                "author": "Far_Highlight_4334",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1723657784.0,
        "title": " GA4 Data Stream and Key Event Issues",
        "author": "Ok-Homework9456",
        "id": "1es84bd",
        "selftext": "Hey everyone,\n\nI'm running into some trouble linking a third-party platform to our GA4 property. They've requested our Measurement ID, which we've provided, and we've also set up a data stream for them on our end. However, it seems like the data stream isn't collecting any information.\n\nIs it possible to receive data without installing a Google Tag on their side? Can I solely rely on the Measurement ID, or do I need both the Measurement ID and the Google Tag?\n\nAdditionally, I'm trying to support Google Ads. Would it be feasible to create a key event from the data they send to GA4 and then convert that into a conversion? Could someone elaborate on this process?\n\nAny insights or suggestions would be greatly appreciated! Thanks in advance!",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1es84bd/ga4_data_stream_and_key_event_issues/",
        "num_comments": 7,
        "comments": [
            {
                "body": "\"requested our Measurement ID, which we've provided, and we've also set up a data stream for them on our end\" - how is your measurement ID and data stream different / separate things? isn't it a single GA4 measurement stream ID? technically there is a stream ID and a measurement ID, but the two are paired, and you provide the vendor with the measurement ID for tagging.",
                "author": "Humble_Elderberry_25",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Use Google Tag Manager on the website. With GTM, you can manage all types of tracking in one place without having to place codes for each platform separately.",
                "author": "MarketerErfan_",
                "score": 1
            },
            {
                "body": "Yes you're correct. So I created a data stream for the third party website and gave them the measurement ID of that data stream. Although no information is coming in and on GA4 its requesting me to install a tag.",
                "author": "Ok-Homework9456",
                "score": 1
            },
            {
                "body": "It's a third party platform that doesn't give me access implementing a google tag. So how could I use GTM if they only give me the option to send over a measurement ID?",
                "author": "Ok-Homework9456",
                "score": 1
            },
            {
                "body": "Which platform is it?",
                "author": "MarketerErfan_",
                "score": 1
            },
            {
                "body": "Platform is called Paytronix",
                "author": "Ok-Homework9456",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1726554762.0,
        "title": "Best Practices for Measuring Impact of Organic Platforms (TikTok, Instagram, YouTube) with Google Analytics & UTM Links",
        "author": "petar_krastev",
        "id": "1fis074",
        "selftext": "Hi everyone,  \n  \nI manage organic marketing for e-commerce brands across platforms like TikTok, Instagram, and YouTube, and I'm looking for best practices on how to measure the true impact of these efforts.\n\nI know UTM links can help track traffic, but how do you ensure you're getting an accurate view of the value organic content is bringing, especially when there might be paid ads driving some traffic too? Are there any specific data-driven attribution models you recommend in Google Analytics to better assess this?\n\nAny insights on blending UTM tracking with attribution models would be greatly appreciated!  \n  \nThanks!",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1fis074/best_practices_for_measuring_impact_of_organic/",
        "num_comments": 3,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Do your objectives for organic social differ from your paid activity? Do you use coupon codes or special offers that are exclusively shown to your organic followers?\n\nAs organic is targeting a warm audience, it's often quite difficult to work out if it's generating incremental sales and not simply taking credit for purchases that would have happened anyway (including bringing them forward in time but not increasing value).\n\nHow confident are you that UTMs are being used consistently and following best practices for GA4?",
                "author": "Taca-F",
                "score": 1
            },
            {
                "body": "Curious, can I ask what you mean by \"bringing them forward in time but not increasing value\"?",
                "author": "Strict-Basil5133",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1718654418.0,
        "title": "How to remove Org Admins from customer GA account in 2024?",
        "author": "nayrmot",
        "id": "1di7erw",
        "selftext": "Hi guys,\n\nI am in the process of leaving a marketing company.  I need to take my Google Analytics account with me, but it is linked to their Google Marketing Platform.  They are listed as an organization, which appears to be higher user privileges than my administrator account level. When trying to remove acces from their accounts via the Account access management it says that I cannot remove permissions since they inherit their permissions from another location, such as a user group, organization admin role or a parent account.\n\nThe full message says\n\n>\n\nI googled on Org Admin and permissions but I cannot find any information on this. Do you guys have any pointers?\n\n  \nThis was answered previously, but the suggestions did not resolve the issue.  Does anyone have an updated solution?",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1di7erw/how_to_remove_org_admins_from_customer_ga_account/",
        "num_comments": 4,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "how did 'your' account get linked to 'their' platform?",
                "author": "Humble_Elderberry_25",
                "score": 1
            },
            {
                "body": " Not entirely sure, but the solution was to de-link within the google marketing platform instead of analytics.",
                "author": "nayrmot",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1714402963.0,
        "title": "E-commerce Purchases Item Name (Not Set) Frustration",
        "author": "snowhawk1987",
        "id": "1cg1cau",
        "selftext": "Over the past two months, I've been pulling my hair out trying to sort out why our e-commerce, purchase item name, is being reported as (Not Set). \n\nI work for a charitable online educator and we use Destiny1/Modern Campus (an online student portal and management system) as our e-commerce platform. The Not Set data is an overwhelming (60% +) majority of conversions. \n\nDoes anyone have experience using Destiny1/Modern Campus with GA4 or could someone point me to a resource (not Google) that might help me resolve the issue? Or better yet, walk me through why I might be getting so many (Not Set) conversions. \n\nI'm a novice when it comes to GA4 so any tips would help! Destiny1/Modern Campus provides their own CMS, which we don't use, so they aren't being all that supportive in trying to resolve the issue(s). \n\nThanks! ",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1cg1cau/ecommerce_purchases_item_name_not_set_frustration/",
        "num_comments": 5,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Cause the datalayer on your cms does not complies with GA4 schema. While browsing your store,  go to inspect then go to the console tab write datalayer, in the e-commerce you will find the items array,  on the items array make sure that the items array complies with ga4 schema. Here is the right GA4 schema for items array:\n\nitems: [\n    {\n      item_id: \"SKU_12345\",\n      item_name: \"Stan and Friends Tee\",\n      affiliation: \"Google Merchandise Store\",\n      coupon: \"SUMMER_FUN\",\n      discount: 2.22,\n      index: 0,\n      item_brand: \"Google\",\n      item_category: \"Apparel\",\n      item_category2: \"Adult\",\n      item_category3: \"Shirts\",\n      item_category4: \"Crew\",\n      item_category5: \"Short sleeve\",\n      item_list_id: \"related_products\",\n      item_list_name: \"Related Products\",\n      item_variant: \"green\",\n      location_id: \"ChIJIQBpAG2ahYAR_6128GcTUEo\",\n      price: 10.01,\n      quantity: 3\n    },\n\n\nSource : https://developers.google.com/analytics/devguides/collection/ga4/ecommerce?client_type=gtag",
                "author": "analyst_bappy",
                "score": 1
            },
            {
                "body": "So frustrating when data isn't showing up the way it's supposed to. It sounds like there might be a tagging issue with how items are being tracked and reported in GA4. Since you're using Destiny1/Modern Campus with GA4, first thing to check is if the e-commerce events (like purchase, add to cart, etc.) are properly configured in your GA4 data streams. Misconfigured events can often result in (Not Set) values. You might want to verify that the item\\_name or equivalent parameter has been correctly set up in your tagging configuration.  \n  \nFor resources outside of Google, looking into forums or communities dedicated to Modern Campus or those specializing in GA4 might be helpful. Sometimes these platforms have robust discussions and shared experiences that can offer solutions. If there's a particular tagging/debugging tool that comes with Destiny1/Modern Campus, digging into that might reveal more specific insights about where things could be going wrong.  \n  \nI'm Dhruv who works at StatsPro, and you might consider using it to get more accurate and easier-to-use insights, especially since it's super privacy-friendly and could help avoid these data headaches. Hope this helps.",
                "author": "Ontopoftheworld_ay",
                "score": 1
            },
            {
                "body": "I had a similar issue and it turned out the reason item name was not set is “name” wasn’t being passed in the datalayer calls. \n\nIn previous UA e-commerce name wasn’t mandatory, but id and category were. \n\nIn ga4 does item id and item category show correctly?  \n\nIf that’s the case then you are missing name from the datalayer push for purchase event.",
                "author": "CO_PC_Parts",
                "score": 0
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1710888286.0,
        "title": "Traffic incorrectly assigned to referrals",
        "author": "Ill-Growth230",
        "id": "1bixt27",
        "selftext": "Hello everyone,  \nI manage the Google Ads for a hotel. In my opinion, the campaigns are going well, there are a lot of calls and emails etc. coming in.  \nNow there is the following problem: The bookings via the booking platforms are tracked, but only 10% of them are attributable to organic traffic and another 10% to Google Ads.  \nThe other approx. 80% comes from referrals and the own website URL is specified as the referral. This means that since the booking tool does not run on the same domain, but on an external domain, Google now assigns these booking conversions to the referrals (i.e. the hotel website) instead of assigning it to Google Ads/Organic.  \nDo you think I'm right in assuming that this is where the error lies and that's why we almost only generate emails and calls as conversions via Google Ads?  \nBut if I'm right, then I wonder why some booking conversions are still assigned to Google Ads? Actually, ALL conversions should then be assigned to the referrals.  \nAnd now the most important question: Does anyone here know how to solve this problem?",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1bixt27/traffic_incorrectly_assigned_to_referrals/",
        "num_comments": 4,
        "comments": [
            {
                "body": "Referral exclusion list",
                "author": "pixgarden",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Do you mean that if I exclude the hotel website, GA4 will automatically assign the traffic to the right sources (Google Ads and organic)?",
                "author": "Ill-Growth230",
                "score": 1
            },
            {
                "body": "Yes Referral exclusion should be done. In addition can you also implement UTM tags to your booking site listings?",
                "author": "Zealousideal_Wear685",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1706875821.0,
        "title": "Tools & practices to get started monitoring changes in top-line metrics?",
        "author": "techie2k",
        "id": "1ah280x",
        "selftext": "Help a fellow out!  \nI am a software engineer recently turned product manager at a growing startup.As part of the yearly KPIs for 2024, our CEO wants us to be more \"metrics driven\" in out product development.  \nI am trying to figure out how to do some root cause analysis (or at least find what changes correlate with top line metrics changes) but I am not very experienced with analytics products yet:  \n\\- How do you guys approach it with platforms like Google Analytics?  \n\n\n\\- Do you use other tools like MixPanel, Segment, etc?  \nThanks in advance for all the help!",
        "score": 3,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1ah280x/tools_practices_to_get_started_monitoring_changes/",
        "num_comments": 3,
        "comments": [
            {
                "body": "I'm assuming this is like UX Analysis on a software product. I would talk to sales at some of the paid solutions like MixPanel to see if they're a fit for you.\n\nGoogle Analytics is a great data collection tool. It usually has more of a marketing focus but it's capable of UX analysis too. The app analytics portion of GA4 is definitely the lesser used aspect of the platform though, and most of the conversation you'll see on this sub are related to tracking on websites for marketing teams.\n\nFollowing recommended setup will get anyone like 80% there in terms of collecting valuable user interactions. You'll have a lot of data points, but no answers to your business questions. A missing piece is custom measurement - like we have this goal in our experience so we need a measurement event when users reach this point. Another missing piece is the actual reports. Standard reports in GA4 are pretty trash, you're left to build your own which usually has analysts introducing yet another tool specifically for data visualization, like Looker Studio which is similar to Power BI and Tableau.\n\nIf operating GA sounds like a full-time job, yeah, I'd say that's accurate. It's a good tool for the dedicated Analyst or Analytics team.\n\nThat's why I say check in with MixPanel too. Tools like that offer more all-in-one solutions, as far as I know, and when you talk to them you'd maybe want to press them on showcasing these savings in time and effort versus a product like GA4. And if you do go with another platform, I'd still do the minimum GA4 setup and run it in parallel, because then you have it as a fallback with some data already collected.",
                "author": "Higgs_Br0son",
                "score": 3
            },
            {
                "body": "GA is good for attributing sales/conversions to a channel of acquisition. You spend a certain amount in paid ads and organic posting - but how much actual revenue does that result in and is that revenue greater that the cost to advertise?\n\nHow many new/returning users do you have completing certain actions and how does that trend change over time. \n\nCreate specific audiences and import them to Google Ads to improve your targeting. \n\nCreate funnels if you have a multi-step process to understand where people are falling off, what type of people are not able to complete the flow - retarget them.",
                "author": "m_castro_analytics",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1706694464.0,
        "title": "Reporting Identity in GA4",
        "author": "SpiritualEcho5127",
        "id": "1afea6u",
        "selftext": "I manage the primary property of our website and a sub-property in Google Analytics 4 (GA4).The sub-property is configured with specific filters to display data for a particular page within the main property.I have implemented the 'Blended' Reporting Identity for both properties.\n\nHowever, I've encountered an issue where an error symbol appears in the Modeling section in the Main Property's Admin panel, but not in the Sub-property.This issue is not related to data volume, as both properties consistently record much more than 1,000 events and 1,000 active users daily.\n\nAdditionally, we have implemented consent mode on both pages. I'm trying to identify the root cause of this discrepancy. Why  the error is appearing only in the main property?\n\n&#x200B;",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1afea6u/reporting_identity_in_ga4/",
        "num_comments": 1,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1704988735.0,
        "title": "GA4 Configuration sending browser Title instead of CustomVirtualPageTitle",
        "author": "nicotinebar",
        "id": "194506o",
        "selftext": "I have followed the steps mentioned in this guide: https://www.analyticsmania.com/post/single-page-web-app-with-google-tag-manager/ to dataLayer.push code whenever a user navigates between pages/states of a website/web application.  \nI did everything as mentioned in this guide to send a VirtualPageView using the datalayer.push and created GA4 Event - Page View event that triggers this customVirtual Page.  \nAlso, in the parameters I am sending page\\_location & page\\_title for a custom url & title.  \nHowever, with the GA4 Tag configuration event is loaded on all pages when the container is loaded it sends the browser title. how can I stop GTM from sending the browser title and only get the custom title that we are passing in the platform?  \nAny help is appreciated here:  \nhere is the same post in Google where you can find a screenshot: https://support.google.com/tagmanager/thread/252425983?hl=en&sjid=11147320966068045118-NC  \nTried everything but need help in the configuration",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/194506o/ga4_configuration_sending_browser_title_instead/",
        "num_comments": 1,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1692859892.0,
        "title": "Use \"price\" parameter as \"value\"?",
        "author": "malangkan",
        "id": "15zu1ri",
        "selftext": "Our ecommerce platform for some reason only has a URL-parameter of \"price\" after successful purchase (user is being forwarded to a thank-you-page). This is then not shown correctly in GA4 - the purchase is registered, but not the \"value\". Is there any way for me to use the \"price\" parameter to show the \"value\" in GA4? We use Google Tag Manager to manage the events.",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/15zu1ri/use_price_parameter_as_value/",
        "num_comments": 6,
        "comments": [
            {
                "body": "If I understand correctly you have the price value in the URL, so I'd try to scrape that part of the URL, collect it as GTM variable and send it as value event parameter within the purchase event, taking care to fire it in the Thank You Page.",
                "author": "giancampo",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Yes, you can use Google Tag Manager to capture the \"price\" parameter and pass it as a custom event parameter to Google Analytics 4 (GA4).  \nHere's a step-by-step guide:  \n1. Go to your Google Tag Manager account and create a new tag that will capture the \"price\" parameter.  \n2. To capture the \"price\" parameter, click on \"Fields to Set\" in GA4  \n6. Click on \"Add Row\" and set the Field Name to your desired variable name (e.g., \"transaction\\_value\").  \n7. In the Value field, enter the variable that captures the \"price\" parameter. This could be a variable that you create in the Google Tag Manager, or you can use a built-in variable like \"URL\" to extract it.",
                "author": "jfeng1115",
                "score": 1
            },
            {
                "body": "Yes, the price value is in the URL, I already scrape it from the URL with GTM! Ah, so I just need to change the name of the event parameter to \"value\", but add the value of the \"price\"-parameter from the URL to the tag? I thought it had to correspond to the name of the actual value.",
                "author": "malangkan",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1703616770.0,
        "title": "URL is not reporting for conversion action",
        "author": "whythinksomuch",
        "id": "18rf717",
        "selftext": "Does anyone know why I would receive no url (or hostname, or other URL information) on about 1/3 of my sessions with conversions?  (It could be some sort of trigger secondary tag fire because the numbers with the platform and the CRM are not that far off.  Maybe 5-10%).  I have not been able to reproduce it at all. Other events - even within the same session appear okay so I thought it might be a consent issue - as the conversion event seems to be isolated for this.\n\n* Session campaigns, source come through fine.  It *is* a multiple hostname setup with Unbounce Landing pages if that's relevant, but it effects all the domains to about the same extent.\n* Not related to browser or device category - those report fine.\n* Also not a bot - most of these have a geo and trendlines look organic - have correct campaign params, etc\n* I did review the BQ data and it's the same - nothing under url at all for these.\n* The GTM event also has a custom url parameter that is not reporting.\n\nThanks for any help at all.  I just find this really confusing and haven't found any problem with other research I have done.",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/18rf717/url_is_not_reporting_for_conversion_action/",
        "num_comments": 1,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1656433343.0,
        "title": "Best way to add GA4 to my Wordpress site without code?",
        "author": "a_computer_adrift",
        "id": "vmr5ot",
        "selftext": "What’s the best way to integrate Google Analytics 4 on my Wordpress site without code?\n\nI initially used Rank Math SEO and it added the code to my site, until I found out that I couldn’t “No Index” any pages without paying so I deactivated it and downloaded Yoast. Yoast doesn’t seem to have the same integration (although I seem to be able to link my GSC). \n\nMy hunch is that there is a better way. I have started to learn about Google Tag Manager. Will that install the code on the site? Is it worth the time to learn it? My end goal would be to understand the flow of users and where they go, plus track some end result stuff like clicking on the Email button. \n\nAnother question is about the Consent Management code. Is there a plug in that would give me all of these things?\n\nI’m a little lost here and would appreciate some ELI5 guidance, or even resources. What’s the most robust way to get this going?\n\nThanks!",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/vmr5ot/best_way_to_add_ga4_to_my_wordpress_site_without/",
        "num_comments": 18,
        "comments": [
            {
                "body": "The requirements to add it via Tag Manager aren't much and they're much better than implementing additional WordPress plugins, which slow your site, cause lower conversion rates, and can decrease rank due to slow loading.\n\nThere are tons of easy guides out there on how to do so if you simply search like \"install Google Analytics 4 with Tag Manager on WordPress\".",
                "author": "TheMacMan",
                "score": 3
            },
            {
                "body": "Use the plugin gtm4wp. You can then install ga4 via the tag manager easily.",
                "author": "bubbleblub17",
                "score": 2
            },
            {
                "body": "Hey I got it working!! Thanks for everyone’s help.",
                "author": "a_computer_adrift",
                "score": 2
            },
            {
                "body": "You would add a little bit of code to your site for Google Tag Manager. Then within Google Tag Manager, you would add the GA4 code and it will automatically apply it to all the pages of your website.",
                "author": "TheMacMan",
                "score": 2
            },
            {
                "body": "I second the GTM4wp plugin. \n\nYou just use this plugin to insert the GTM code. No coding unless you choose to use manual mode. If you need to use the manual mode you'll need to insert a line of code and it tells you how to do it. \n\n**Tagging**  \nYou \"install\" tags by adding them to GTM. You'll be adding and publishing only to GTM, not your site. If it's not working you likely need to work on your tags and triggers. You will need to test this before publishing. You can verify using Google analytics real time.",
                "author": "TinkerLytics",
                "score": 2
            },
            {
                "body": "Also, you might do a hard refresh or clear cache/turn off cache plugin.",
                "author": "TinkerLytics",
                "score": 2
            },
            {
                "body": "best way is through the gtm4wp plug-in so you can take advantage of additional data layer events. from there you can add ga4 via google tag manager. that’s usually the best approach",
                "author": "BrandonCJGrimes",
                "score": 1
            },
            {
                "body": "From what I can tell, Google Tag Manager does not add GA4 code to the site. You have to add another plugin to get the code into the header or footer. Is this correct?",
                "author": "a_computer_adrift",
                "score": 1
            },
            {
                "body": "I will check it out. Thanks.",
                "author": "a_computer_adrift",
                "score": 1
            },
            {
                "body": "This really didn’t do anything. I can link this to my Google Tag Manager but I have not been able to get any tags installed on my site. From what I can tell, I am still going to have to add some code directly to my site or use yet another plug in to setup GA4. Is this correct?",
                "author": "a_computer_adrift",
                "score": 1
            },
            {
                "body": "Ok I figured out how to enable the code addition using the container code ON/OFF toggle. It was set to off by default. Thanks for that. \n\nI managed to find the GTM tag on my site using the Tag Assistant so it is there now. \n\nNext problem is that I cannot get the preview mode in GTM to connect to the website. It says that there are no debuggable Google Tags at that address. I have only installed a single tag which is the Google Analytics GA4 configuration tag with a trigger of All Pages. I submitted it about an hour ago so it should be live. Not sure I even need this. \n\nAny ideas?",
                "author": "a_computer_adrift",
                "score": 1
            },
            {
                "body": ">no debuggable Google Tags at that address\n\nDo you have an adblock?",
                "author": "TinkerLytics",
                "score": 1
            },
            {
                "body": "I’m using Brave, so good point. I’ll troubleshoot that.",
                "author": "a_computer_adrift",
                "score": 1
            },
            {
                "body": "Yeah it was the ad block. It’s connected now. Thanks.",
                "author": "a_computer_adrift",
                "score": 1
            },
            {
                "body": "Are you using the new tag assistant or the legacy one?",
                "author": "TinkerLytics",
                "score": 1
            },
            {
                "body": "The legacy one. Didn’t realize there was a new one. Thanks.",
                "author": "a_computer_adrift",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1700588015.0,
        "title": "Question about ad views",
        "author": "Big_al_big_bed",
        "id": "180mhow",
        "selftext": "Hello hive mind, I am wondering how to reflect ad view conversions in google analytics. For example, if I have 1 day view attribution in Facebook/Reddit/twitter ads, this is essentially assigning a conversion to anyone who has viewed an ad on any of these platforms and made a purchase within a day.\n\nI have various implementations via Google tag manager for collecting the events - some via pixel some via CAPI integration with server side tag manager. \n\nHow does GA know to attribute ad views to conversions? Ad clicks I understand as it adds utm parameters to the cookies, but for ad views I'm not sure",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/180mhow/question_about_ad_views/",
        "num_comments": 1,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1695663177.0,
        "title": "Track specific button click",
        "author": "moose35forpres",
        "id": "16ryfu0",
        "selftext": "Looking to track one specific button click in GA4 on a squarespace site. I'm running ads so I'll need to use GA4 instead of simply looking at the Squarespace analytics. The button is for a phone number, so I can't simply redirect to a thank you page, etc and use the view page conversion.\n\nIs there a way to do this without tag manager? And if not, would you be able to provide a resource with step by step of tag manager with the Squarespace site? I usually use Google's directions but in this case they aren't super clear, especially with a tie-in to that platform.\n\nTIA!",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/16ryfu0/track_specific_button_click/",
        "num_comments": 3,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Why don’t you want to use Google tag manager? most of the examples and tutorials that I see are using it.",
                "author": null,
                "score": 1
            },
            {
                "body": "Probably easier with google tag manager, but I believe you could use code directly, something like:  \n\n\n    <button type=\"submit\" onclick=\"ga('send', 'event', 'Button Clicks', 'Submit', 'My Button');\">Submit</button>",
                "author": "just4werk",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1687252745.0,
        "title": "Really struggling with GA4 E-commerce conversion tracking",
        "author": "Chrispin325",
        "id": "14e654w",
        "selftext": "Hi, I'm really struggling to understand how to set up tracking for E-commerce purchases in GA4. We have set up GA4 and have data flowing. But i can't understand how to get ecommerce data. Our website is on a managed platform and the developers are pretty useless. Only they can access the checkout page so any code that needs to be put on that page has to be done by them. I assumed they should be able to set this up for us but it seems like they don't really know what they are doing. Is there a simple way to set this up?\n\nThank you",
        "score": 5,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/14e654w/really_struggling_with_ga4_ecommerce_conversion/",
        "num_comments": 5,
        "comments": [
            {
                "body": "Welcome to the club!   \nThere is no simple way to do this if you don't have more access to the website. For most Shops there is a plugin that enables GA4 eCommerce. I assume you can't install such plugins either? Maybe there is a Marketplace within the platform where you can look?\n\nThe hard way is to create a Script that runs on every shop page or at least the checkout page. The Script should then create/fill the GA4 dataLayer with eCommerce Data. e.g. take the purchase value and push it properly named in the array that then gets send your GA4.",
                "author": "AnnieInTeal",
                "score": 2
            },
            {
                "body": "they should be able to easily add the data the datalayer templates needed for ‘purchase’, and any of the others ones. did you send them the templates from google documentation?",
                "author": "BrandonCJGrimes",
                "score": 1
            },
            {
                "body": "Thanks for your reply. No there isn't a market place and there aren't any plugins, we are moving platforms in the coming months because of these restrictions. \n\nok, so this is something that the developers should be sorting out for us then do you think?",
                "author": "Chrispin325",
                "score": 1
            },
            {
                "body": "Yes they have to push information to the datalayer whenever a user does some ecommerce action and mark it with a datalayer event so you can read the information at the right moment using Google Tag Manager custom event triggers and dataLayer variables \n\nThe most important action being the purchase. You can find the required information and naming of the variables in the Google documentation. \n\nAlternatively you can use Simo Ahova or analyticsmania guides.",
                "author": "Answer_me_swiftly",
                "score": 1
            },
            {
                "body": "The alternate is getting Google Tag Manager onto the pages and in lieu of a proper data layer, scraping data from the DOM might be achievable. This should be a stop-gap measure before a data layer can be implemented.",
                "author": "DigitalStefan",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1647354446.0,
        "title": "How to remove Org Admins from customer GA account?",
        "author": "fabricemous",
        "id": "teq8gh",
        "selftext": "Hi guys, \n\nWe are taking over a customer Google Analytics account which is linked to a Google Marketing Platform from another agency. When trying to remove acces from their accounts via the Account access management it says that I cannot remove permissions since they inherit their permissions from another location, such as a user group, organisation admin role or a parent account.\n\nThe full message says \n\n&#x200B;\n\n>You can't remove direct permissions from the selected users because none of them have direct permissions. All of them inherit their permissions from another location, such as a user group, organisation admin role or a parent account.  \n>  \n>If you want to remove access for these users, you can view their permissions pages and check where they inherit permissions from.\n\n&#x200B;\n\nI googled on Org Admin and permissions but I cannot find any information on this. Do you guys have any pointers?",
        "score": 3,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/teq8gh/how_to_remove_org_admins_from_customer_ga_account/",
        "num_comments": 18,
        "comments": [
            {
                "body": "Really, its safer to share properties not accounts, so perhaps they've done something silly to begin with and they will only be able to remove themselves, however can you go to the property options and remove them from there under Property Access Management?\n\nAlternatively if the analytics account is in the name of website holder themselves, they would have the ownership and can remove the previous agency and give only you property access.",
                "author": "CBdigitaltutor",
                "score": 2
            },
            {
                "body": "They will need to unlink the GA Account from their Organization in Google Marketing Platform. Then you will need to ask them to add you as Full Administrator, which gives you the ability to remove any user.",
                "author": "lavazzalove",
                "score": 1
            },
            {
                "body": "i have the same problem, any solutions?",
                "author": null,
                "score": 1
            },
            {
                "body": "[removed]",
                "author": null,
                "score": 1
            },
            {
                "body": "So can someone please let me know why you deleted my comment (yes, the one deleted 7 hours before this one was posted)? I am giving out advice to the community that in all honesty I could not find regarding an annoying issue with Google Analytics accounts. This is a new reddit account, yes because I signed up specifically to share the solution to this problem. SO can you please let me know why my comment is deleted when it clearly is helping people even just minutes after it was posted (someone modded up)?",
                "author": "The_Buggerman",
                "score": 1
            },
            {
                "body": "I will try posting this one more time with the hope this will NOT be deleted this time around.\n\nThis had been driving me crazy. So the key to this process is to NOT try to REMOVE the user from the property \"PROPERTY ACCESS MANAGEMENT\" tab.Don't be afraid, venture into the VIEW tab and into the \"VIEW ACCESS MANAGEMENT\".\n\nOnce there, IF you try to remove the user here again you will get the dreadful \"inherited permission - cannot delete\" error. What you need to do -FOR EACH USER you want to delete- is to click on the THREE VERTICAL DOTS at the right-most of the line with their account name (and email) and select \"VIEW USER'S ACCOUNT DETAILS\".\n\nNow click on the little triangle to expand their account tree. Starting from the BOTTOM and moving your way UP, change their role to NONE. By the time you reach the top of the hierarchy tree their account will be GONE. Worked for me.\n\nBest,",
                "author": "The_Buggerman",
                "score": 1
            },
            {
                "body": "So can someone please let me know why you deleted my comment? I am giving out advice to the community that in all honesty I could not find and it is an annoying issue with Google Analytics accounts. This is a new account, yes because I signed up to reddit specifically to share the solution to this problem. SO can you please let me know why my comment is deleted when it clearly is helping people even just minutes after it was posted (modded up)?",
                "author": "The_Buggerman",
                "score": 1
            },
            {
                "body": "Brilliant. Thank you.  I can't believe this isn't documented better by Google.",
                "author": "SEO4TheWin",
                "score": 1
            },
            {
                "body": "I found this when googling the same problem and followed your steps - the folks who are on the account HAVE no permissions but the text still says org admin which is hugely annoying any ideas some time later of course :-)",
                "author": "kdaly100",
                "score": 1
            },
            {
                "body": "Thanks!",
                "author": "cascajal",
                "score": 1
            },
            {
                "body": "It works. Thanks sooooooooooooo much!",
                "author": "Fragrant_Ear5026",
                "score": 1
            },
            {
                "body": "Confirming this still works October 2nd, 2025. Thank you!",
                "author": "puLsOr",
                "score": 1
            },
            {
                "body": "You saved me. Thank you, buddy!",
                "author": "LazyAward5063",
                "score": 1
            },
            {
                "body": "This is works. Thank you buddy.",
                "author": "SystemVevoTR",
                "score": 1
            },
            {
                "body": "Thank you SO much.  I'm not sure why your initial response was deleted, but I'm glad you posted again.",
                "author": "toricor",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1683088210.0,
        "title": "GA 4 is not showing data",
        "author": "Zestyclose_Drama44",
        "id": "136abpw",
        "selftext": "Set up GA4 long ago and it was showing data till now perfectly with no problem. Now its not showing previous months data and april data is also not accurate. Its showing real time data but no source or landing page data. Has anyone faced similar problem? Coz this is new to me. Or is this a problem from GA?",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/136abpw/ga_4_is_not_showing_data/",
        "num_comments": 4,
        "comments": [
            {
                "body": "[removed]",
                "author": null,
                "score": 1
            },
            {
                "body": "Data retention was changed in GA4, you can find it in the Admin section under Data Settings->Data Retention, the default is only 2 months. \n\nIf you want to keep all your historical data going forward, you'd have to export it to BigQuery.",
                "author": "IsaacWestland",
                "score": 1
            },
            {
                "body": "1 Wordpress\n2 Cookie pro\n3 Yes",
                "author": "Zestyclose_Drama44",
                "score": 1
            },
            {
                "body": "Thanks for the BigQuery solution. I have been using GA4 for 6 to 8 months and the data retention was set 2 month but I was still able to see the last 6 months data. Do you know why is this happening now?",
                "author": "Zestyclose_Drama44",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1683047994.0,
        "title": "Best way of tracking e-commerce conversions",
        "author": "Various-Help7022",
        "id": "135u8yx",
        "selftext": "Hello, \n\nI work for a charity in the UK and because of cookie banners, the data we can collect has plummeted. The data we get of sources of charity event sign ups and donations is so low that it’s barely worth reporting on. But as a charity I want to make sure the spend on our digital marketing activity is worth it - are our FB ads working well in terms of ROI, which activity brought in the most donations etc.\n\nIs there a way of tracking this data without cookies on GA4/GTM? Or would it be worth going for a cookie less analytics platform?\n\nAny help with this would be so appreciated.\n\nThank you",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/135u8yx/best_way_of_tracking_ecommerce_conversions/",
        "num_comments": 4,
        "comments": [
            {
                "body": "I was able to build a report in Looker Studio for now, but would like to see what can be done in GA.",
                "author": "Hank3rd",
                "score": 2
            },
            {
                "body": "GA4 is more cookieless? Look up Consent Mode and Google Signals.",
                "author": "markdigi",
                "score": 2
            },
            {
                "body": "Not sure you really get the whole cookie thing. \n\nYou track your digital ads via UTM links. Not cookies. \n\nYou run an ad, someone clicks, they are unidentifiable as a person, you see how many people that clicked that link converted to donate/sign up/whatever your goal is.",
                "author": "YourStupidInnit",
                "score": 1
            },
            {
                "body": "Any chance that you're using a 3rd-party checkout platform?",
                "author": "griz_fan",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1685441666.0,
        "title": "Engaged session conversion GA4",
        "author": "mattywisey92",
        "id": "13vma2e",
        "selftext": "I’m wondering if anyone can help but my paid team would like to use engaged sessions as a Google ads conversion in Google search ads but potentially also in campaign manager 360 search ads 360 and DV 360.\n\nIs there an easy way to simply export engaged sessions as a conversion from GA4 to these platforms or would I just need to replicate the triggers that trigger an engage session in GTM as I cannot find a way to use engaged sessions as a conversion metric on these platforms.",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/13vma2e/engaged_session_conversion_ga4/",
        "num_comments": 3,
        "comments": [
            {
                "body": "You can mark your event “engaged_session” as a conversion and import that to Google Ads under the “Conversions” tab in the tools thing. Alternatively you could setup a timer trigger in GTM and have that be a conversion sent to google ads.",
                "author": "International_One110",
                "score": 2
            },
            {
                "body": "Yeah exactly this, engagement is an event created in GA4 you don’t pass it into it like a page view, because of this you can’t send it using Google Ads tags, you’ll need to mark as conversion in GA4 then ‘Import’ it from Google Ads conv. tab",
                "author": "joe_shrimpton",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1658777105.0,
        "title": "Help with E-commerce Event Tracking in GA4",
        "author": "SeeBeanLean",
        "id": "w7xrvp",
        "selftext": "I'm new to Google Analytics 4 and E-commerce websites, so configuring event tracking on my family's spirits business website has been a bit challenging. Due to alcohol sales laws, purchases are fulfilled by a third party called Barcart which operates its own e-commerce platform instead of WooCommerce or Shopify. In BarCart, I created buttons for each product that allow users to complete purchases on our website without leaving our domain. I also utilized BarCart's Google Analytics integration which made it seem like there would be no additional setup required on my end. However, purchase events are not being tracked in GA4.\n\nThe BarCart support team provided virtually no help when I asked them to help me troubleshoot this issue. I tried reaching out to some folks on Fiverr who claimed to have experience with custom e-commerce platforms, but they could not help out. I tried implementing the steps from a helpful video I found on YouTube, using a data layer in Google Tag Manager, and the trigger did not fire in Google Tag Assistant when I made a purchase. I am out of ideas.\n\nIf anyone has experience tracking e-commerce events in GA4 and wants to help, please send me a message! I can be more specific about the details in a private message than in this thread.",
        "score": 3,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/w7xrvp/help_with_ecommerce_event_tracking_in_ga4/",
        "num_comments": 7,
        "comments": [
            {
                "body": "I have since deleted the Tag that I created the Datalayer in. After inspecting the BarCart button, it looks like it wasn't pushing data into the Datalayer. The button is using an onclick event. I will DM you a screenshot.\n\nThanks for helping out!",
                "author": "SeeBeanLean",
                "score": 2
            },
            {
                "body": "Are the barcart purchase buttons in an iframe?",
                "author": "HawkeyMan",
                "score": 1
            },
            {
                "body": "It depends on if the BarCart is pushing data into the datalayer. Send me a screenshot of the datalayer :) I’ll help you kind stranger.",
                "author": "Doctor_Philly",
                "score": 1
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 1
            },
            {
                "body": "Yes, they are in an iframe. I can send you a screenshot from the Chrome Inspect tool.",
                "author": "SeeBeanLean",
                "score": 1
            },
            {
                "body": "I don't have access to the BarCart checkout pages.\n\nAfter users add an item to their cart, the checkout process is completed in a pop-up sidebar on the same page where they added the item to their cart. After users complete the checkout process, a BarCart confirmation page covers the same page the user was on. So, they never leave the same URL in the checkout process. In BarCart, I can't force a redirect to a thank you page after a purchase is completed either.\n\nI created the products page using Divi and added the BarCart button code using the Divi code module. We may be able to add JS to that code module. Of course, I would want to test it out to make sure orders reach the BarCart platform.",
                "author": "SeeBeanLean",
                "score": 1
            },
            {
                "body": "Since it is in an iframe that I’m assuming you can’t edit, you’re best hope is their native integration or ask them if it’s pushing events to the dataLayer of your website then use that to pass revenue data to GA",
                "author": "HawkeyMan",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1679896497.0,
        "title": "User with User admin access unable to add/remove users from user groups in GA360 and GMP",
        "author": "WolverineOwn520",
        "id": "123d5b4",
        "selftext": "What permissions does someone need in order to add users to a GA 360 user group and delete users from it?\n\nI made team member a User Admin on our GA 360 org. She can see and edit user groups but is not able to actually add users to them.\n\nIn her Google Marketing Platform console, she also cannot see Users, just User Groups\n\nI have another member with the same permissions and she is able to manage users in GMP.\n\nAny assistance will be really helpful",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/123d5b4/user_with_user_admin_access_unable_to_addremove/",
        "num_comments": 0,
        "comments": []
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1665502383.0,
        "title": "Event Action Labels Displaying Full Page Content",
        "author": "sucr0sis",
        "id": "y1c32w",
        "selftext": "Hey all - I'm having a hard time figuring out why the \"Event Action\" labels are displaying almost the entire page's site content.  Some examples: \n\n    CTA button - How Does It Analytics-driven personalized care plans HomeFirst Analytics, our predictive analytics platform delivers insights to coordinate care for members from hospital to home; optimizing care transitions, quality, and timeliness of care. Did you know? 80% of patients discharged to a skilled nursing facility could have had the same or better outcomes at home1 53% of members experience medication errors and discrepancies following a hospital discharge2 33% of members engaging with our program are in need of non-clinical services post-acute discharge3 View Our Solutions\t\n\n&#x200B;\n\nHere's another, much longer one:\n\n    CTA button - Previous Empowering Health at Home  is simplifying the delivery of value-based care in the home. By focusing on the member first, we enable health at home through identification and the coordination of appropriate care. Right Care at the Right Time takes the worry out of home care coordination. Our whole-person approach proactively identifies and engages members who can heal and age successfully at home, and our network of home providers ensures timely delivery of care. Whole-Person Coordination HomeBridge®, our proprietary analytics-driven home services coordination platform, gives providers real-time insights to identify and connect members to care in the home, improving clinical, non-clinical and financial outcomes. Next 1 2 3 The  Model empowers health at home through care coordination and value-based benefit management. Our home-centered approach combines HomeFirst Analytics and personalized care to deliver the right care at the right time from hospital to home. is a single platform that connects the last mile of care for healthcare organizations to improve outcomes, lower total cost of care, deliver member and provider satisfaction, enhance Stars and HEDIS® measures, and guarantee savings. HomeFirst Analytics View Value-Based Networks View Whole-Person Care Paths View Optimized Member Engagement View Stars Enhancement and Guaranteed Savings View One Platform, Multiple Solutions empowers health at home for Medicare Advantage, Medicaid and Commercial plans, as well as at-risk hospital and physician-based organizations. Home-Centered Care Coordination Post Acute Care: Site Optimization Learn more Establish the best path of care for discharge decisions with a home-first bias, to return members to wellness. Learn More Post Acute Care: Readmissions Management Learn more Identification and coordination of clinical and non-clinical needs for successful recovery. Learn More Serious Illness Care at Home Learn more Support members with serious illness by addressing medical, emotional and social needs to improve outcomes. Learn More Value-Based In-Home Benefit Management Home Health Learn more Facilitates access to quality, real-time member support and care in the home. Learn More Durable Medical Equipment Learn more Support recovery by access, coordination, and management of DME and supplies. Learn More Home Infusion Learn more Enables the home for convenient, outcomes-based infusion therapy. Learn More Home Sleep & Respiratory Learn more Home diagnostic-to-therapy adherence for sleep disordered breathing and respiratory management. Learn More How Does It Analytics-driven personalized care plans HomeFirst Analytics, our predictive analytics platform delivers insights to coordinate care for members from hospital to home; optimizing care transitions, quality, and timeliness of care. Did you know? 80% of patients discharged to a skilled nursing facility could have had the same or better outcomes at home1 53% of members experience medication errors and discrepancies following a hospital discharge2 33% of members engaging with our program are in need of non-clinical services post-acute discharge3 View Our Solutions Method Matters Empowering health at home is central to delivering value-based care. With in-market clinical teams and value-based provider networks, simplifies the management of quality home-centered care. Changing the way care is delivered by, making the home more accessible and personalized HomeFirst Analytics – proactively identify clinical and non-clinical needs, assess risks for readmissions, and connect members to what they need when they need it Home Insights – AI-generated clinical alerts and value-based home networks closes gaps in care Personalized Connections – multi-modal communication platform improves engagement and support for members and caregivers View Our Solutions The Savings Guarantee serves as the extension into the home for health plans and at-risk provider groups, providing you with last mile visibility to deliver and consult on value-based care at-home strategies. Our partnership is based upon rapid implementation, easy integration, and operational excellence and execution. Paired with our whole-person care coordination and value-based in-home benefit management, we know what matters most and guarantee results. Request a Savings Analysis Request Your Discovery Call Today Get Started HomeFirst Analytics + Personalized Care at Home = Guaranteed Savings and Happy Members\t\n    \n\n&#x200B;\n\n&#x200B;\n\nAny suggestions as to what may be causing this and how to fix it?",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/y1c32w/event_action_labels_displaying_full_page_content/",
        "num_comments": 3,
        "comments": [
            {
                "body": "What variable are you using for input? \nIs it custom or pre-defined? \n\nThe problem is with that one so you gotta trace it backwards. If it is pre-defined, like Click Text, then either change or fix the html on site.\n\nIf it is custom, you can fix it in gtm. One fix could be using a custom js script splitting the text on \" - \" to only get CTA Button. But I guess you want more than just that?",
                "author": "CapnDeadEye",
                "score": 2
            },
            {
                "body": "Can you describe the event setup? Is this GA or GA4; are you using GTM tags; which variable are you using to populate your event action?",
                "author": "Complete-Ad-1264",
                "score": 1
            },
            {
                "body": "Thank you!  I wasn't looking in GTM and I think that was the culprit.  We've basically spent our time cleaning out all the old data that was leftover from previous administrations.",
                "author": "sucr0sis",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1663050366.0,
        "title": "Anyone know how to stop tracking specific page? I have an Iframe that pulls the latest blog posts to 3 other sites. But now whenever they load, I get hits on the donor site. Can't find a simple way to exclude just 1 page from analytics results.",
        "author": "Jreddyacc",
        "id": "xd0188",
        "selftext": "",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/xd0188/anyone_know_how_to_stop_tracking_specific_page_i/",
        "num_comments": 3,
        "comments": [
            {
                "body": "Yes, if you use Google tag manager, you can do that",
                "author": "kalabheria",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1646150476.0,
        "title": "I want to track which platform a customer comes from and if they convert.",
        "author": "Senxios",
        "id": "t4b808",
        "selftext": "Hi, is it possible to do what I have said? I have added a conversion in google tag manager, it works on google ads, but I want to see it in google analytics as well. I also want to be able to differentiate which platform a customer is coming from, like YouTube, reddit, etc. I would greatly appreciate if anyone could help me.",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/t4b808/i_want_to_track_which_platform_a_customer_comes/",
        "num_comments": 3,
        "comments": [
            {
                "body": "Use UTM. And GTM you have already added. These two should be enough",
                "author": "Janak_patel56",
                "score": 1
            },
            {
                "body": "Yes.\n\nIf ecom setup enhanced ecom. If another type you'll need to create events to track your conversion - like a thank you page. Then set up that event as a goal, in GA3, or mark that even as a conversion, in GA4. \n\nIf you're running campaigns you can use UTMs to help track campaign efforts. View in Acq>Campaign\n\nOnce you set up an event as a goal or a conversion you can view these in your reports. If ecom, you can use the ecom report for more info.",
                "author": "TinkerLytics",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1611851331.0,
        "title": "Marketplace Marketer needs help with G4",
        "author": "Nupsia",
        "id": "l71dub",
        "selftext": "Hi everyone and I’m glad to join this sub ! :) \n\nContext : I’m working at a French B2B marketplace that is selling plumber products, in another, from various vendors. Our earnings come from comission on our platform. \n\nThe Catch : As a Traffic Manager, my job is to attract those plumbers on our platform. Problem is you need to sign up in order to see the prices. \n\nThe idea is to exclude mr everybody. Moreover our target is not digital friendly. So if they want to make a purchase, they will call their sales. \n\nMy Problem : my boss wants to know how many product views we get from our clients and from our leads. \n\nSo with the dev team we implemented the property « is_logged », and exclude all internal IP, to see how much ppl see a specific product. \n\nThe problem here is that G4 saying there is « 110 » clients logged but when you add the « products category » you’ll see like « products category A : 67 ; Products category B : 57 ; products category C : 34... ». How is it possible ? Am I missing something ? Does G4 doesn’t know how to sum haha ? \n\nP.S : this is one out of many problems I have since switching from Universal. It’s a huge pain lol\n\nIf a specialist wants to call me and help me, feel free :)",
        "score": 3,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/l71dub/marketplace_marketer_needs_help_with_g4/",
        "num_comments": 4,
        "comments": [
            {
                "body": "People visiting multiple product pages.",
                "author": "trppng",
                "score": 2
            },
            {
                "body": "Salut Camarade,  \nI would advise installing back UA as soon as possible.   \nGA4 is experimental, I use both versions with GTM on every new website I set up.  \nThe last time I check, there was no referral exclusion list on GA4, its not possible to use it properly  \nregarding your question, people might be browsing categories with several products on the same page?  \nBest of luck",
                "author": "pixgarden",
                "score": 2
            },
            {
                "body": "Thks ! That was my first thought :)",
                "author": "Nupsia",
                "score": 1
            },
            {
                "body": "Salut à toi Camarade ;) thks for your advice :) how can I setup UA regarding G4A ? Do I need to create a new view in my analytics ? :)",
                "author": "Nupsia",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1613699384.0,
        "title": "Trying to just sign up... Stuck in an endless loop with the /provisions page",
        "author": "barsen404",
        "id": "ln3igv",
        "selftext": "**EDIT** \n\n[Problem solved](https://www.reddit.com/r/GoogleAnalytics/comments/ln3igv/trying_to_just_sign_up_stuck_in_an_endless_loop/gnzxod2/), u/DueElderberry7031 is a lock for the nobel prize in analytics.  Thank you again!\n\n\n--------------------\n\n\nHello r/GA, \n\nI have a little problem I wanted to share in hopes somebody has seen this before. I'm trying to create a Google analytics account for somebody and already have an ads account and tag manager account, but wanted analytics as well.  I keep getting sent back to this page:\n\nhttps://analytics.google.com/analytics/web/provision/#/provision\n\nThis page only has outbound links to a support page, privacy policy, ToS, and 'Analytics Home' (https://www.google.com/analytics/?hl=en_GB).\n\nThat link forward me to this page: https://marketingplatform.google.com/about/analytics/?hl=en_GB\n\nFrom here both the \"sign in\" and \"start for free\" buttons direct me back to the /provision page above.   \n\nIf I go here:  https://marketingplatform.google.com/home, and expand the \"Google Marketing Platform products menu, then click \"set up\" under the Analytics section I get directed back here: \n https://analytics.google.com/analytics/web/provision/?authuser=0#/provision\n\nAm I going mad or is there a trick to this?",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/ln3igv/trying_to_just_sign_up_stuck_in_an_endless_loop/",
        "num_comments": 3,
        "comments": [
            {
                "body": "I had this same problem and accidentally figured it out. The signup button is invisible. Roll your mouse around near the top of the page just under the head text. When you roll over it the SIGN UP button appears as a ghosted roll over. Click it and then you will get in. Hope this helps.",
                "author": "DueElderberry7031",
                "score": 2
            },
            {
                "body": "Omg thank you so much.  What a ridiculous situation, I'm stunned.",
                "author": "barsen404",
                "score": 1
            },
            {
                "body": "Wow, you just saved my sanity. Thank you.",
                "author": "bentobokutsu",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1602125707.0,
        "title": "How To Best Track Instagram Traffic? Google Analytics Vs Shopify",
        "author": "JIMMYDonline",
        "id": "j7596u",
        "selftext": "Just auditing this account there is a big discrepancy in traffic numbers.\n\nThe sessions are identical but Google Analytics puts the majority of the traffic source as (direct)/(none) where Shopify has the source as Social/Instagram  \n\n\nMy initial thought is to just build a UTM structure to track the Instagram traffic into Google Analytics   \n\n\nBut I am curious why Shopify can pick up that the traffic source is from Instagram in their Analytics but Google attributes it to a direct source.  \n\n\nIs anyone using a third party Analytics Platform they would recommend?  \n\n\nAny feedback on how you're managing this would be appreciated.",
        "score": 3,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/j7596u/how_to_best_track_instagram_traffic_google/",
        "num_comments": 4,
        "comments": [
            {
                "body": "> Shopify’s analytics will remove duplicate conversions from all channels and will give credit to the last touchpoint in a conversion journey even if it’s a direct visit to your store. This is the biggest difference between the way that default attribution works between Google Analytics and Shopify.     \n\n\nCould be the difference in last touch attribution",
                "author": "Has_curved_penis_AMA",
                "score": 2
            },
            {
                "body": "The difference is mostly likely due to the attribution model used in GA and Shopify. GA uses last attribution as default (though you can build different model within GA), Shopify might be using the first attribution.",
                "author": "UTMGrabber",
                "score": 2
            },
            {
                "body": "Thanks. I'll look into this more. Appreciate your reply.",
                "author": "JIMMYDonline",
                "score": 1
            },
            {
                "body": "The Google Analytics is last click non direct which I thought coming from Instagram it would have been attributed there instead of the direct traffic. Its seems Shopify picks up on this but not Google Analytics. Looking into it more it looks like the instagram redirect is influencing it.",
                "author": "JIMMYDonline",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1603462072.0,
        "title": "Does anyone have experience freelancing? Looking for advice!",
        "author": "O_Gardens",
        "id": "jgnrzb",
        "selftext": "I may potentially be taking on some freelance work and have no idea what would be a fair price to charge. It would be implementing Google Tag Manager on a website (already built) as well as Google Analytics. GTM will be a learning experience for me as I am familiar with the platform but haven't done anything to this extent before.  I'll also likely provide GA support on a bi-monthly basis but nothing too in depth. This is for a friend who owns a home improvement business and isn't tech savvy at all. I'd like to make a little bit of cash, gain some new skills and help him out but also don't want to under or overestimate my experience and time. Any thoughts, resources and recommendations are gladly accepted!",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/jgnrzb/does_anyone_have_experience_freelancing_looking/",
        "num_comments": 2,
        "comments": [
            {
                "body": "Put everything in writing.\n\nIn my experience, clients want SEO or FB, not analytics per se. But they are related eventually so maintain your focus on what you ACTUALLY provide.\n\nAsk what they need to know about their website data while at the same time give insights that are not known to them.\n\nProvide less complex answers as possible. Dumb it down for them but at the same time give context to business impact.\n\nAs for pricing check Upwork and base on that. Of course, it depends on where you live, client budget, industry etc.",
                "author": "Lupage",
                "score": 4
            },
            {
                "body": "Thank you for the advice, it's succinct and touches on great things to focus on. I typed up an email this morning but am now going to go back and simplify it.",
                "author": "O_Gardens",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1605739611.0,
        "title": "\"Add to cart\" as Triggering Event",
        "author": "averagewitch24",
        "id": "jwqcgs",
        "selftext": "Hello all, \n\nI'm an e-commerce site selling loose leaf tea and have been using Google Tag manager to add tags to my Google Analytics. I use Weebly as a site hosting platform. Weebly doesn't tell me how many people add items to cart, only tracks actual completed orders. Is there a way I can add \"add to cart\" as a triggering event to my analytics page so I can track the number of abandoned shopping carts?\n\n&#x200B;\n\nTIA",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/jwqcgs/add_to_cart_as_triggering_event/",
        "num_comments": 1,
        "comments": [
            {
                "body": "You can set up events to trigger on clicks. The best way to do this is to set up a tag that is triggered by clicks (all clicks), then go into preview mode. You can check the click event in the debug window and look for the things that make that click unique. For example, is the click class unique to that button, click text, etc. Once you've worked out your parameters go back to GTM and set up the event using those parameters, and publish the container version.\n\nBe aware though (if I understand your question correctly) that this event will fire every time someone clicks \"Add to Cart\". This might not be a problem for you, but (and again, you know more about your situation than me) I think a better option would be to create an event that fires when people click \"Proceed to Checkout\" (or whatever your equivalent is). Or alternatively, set up the Add to Cart tag to only fire the first time someone clicks the button.",
                "author": "VonSeraph",
                "score": 2
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1578355196.0,
        "title": "Tracking Button Click as Conversion to Import into Google Ads",
        "author": "adminlyy",
        "id": "el2sns",
        "selftext": "I've tried multiple time with my webmaster to get this set up correctly but we have not had any success. We are using a button click that takes you to a redirect page and then to another platform to make a purchase. We used to use Tag Manager to track the number of users that reached the in-between redirect page but would prefer to track all conversions through Google Analytics now, if possible. We tried to set up the button click conversion through Tag Manager but the count never matches the count of people that hit the redirect page.\n\nAny thoughts on why this might be happening or help implementing button click conversion tracking would be greatly appreciated!",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/el2sns/tracking_button_click_as_conversion_to_import/",
        "num_comments": 2,
        "comments": [
            {
                "body": "Are you using event tracking for the button click?",
                "author": "MinimumViableMedia",
                "score": 1
            },
            {
                "body": "Yes",
                "author": "adminlyy",
                "score": 1
            }
        ]
    }
]