[
    {
        "subreddit": "GoogleAnalytics",
        "created": 1719963679.0,
        "title": "GA4 - parent/child pages ",
        "author": "Dangerous_Act565",
        "id": "1du06et",
        "selftext": "Hi \nI’ve inherited the analytics account  for an event booking site and I’m not sure if can get the results i need. \n\nTo book an event a user must click through 4 screens. \n/event ➡️ /booking ➡️ /review ➡️ /confirm \n\nThe site allocates a unique booking ID at the start of the session. \nWhen i review the page paths in GA, it shows the stats for each individual URL linked to the booking id. \nEg\n\n\n/AAA/event\n\n/AAA/booking\n\n/AAA/review\n\n/AAA/confirm\n\n/BBB/event\n\n/BBB/booking\n\n/BBB/review\n\n/BBB/confirm\n\nand so on. \n\nHow can i count the total visits for each of the 4 pages without filtering and then adding it all up in excel? \n\nWill gathering the data in this way cause any performance issues?\n\nThanks ",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1du06et/ga4_parentchild_pages/",
        "num_comments": 8,
        "comments": [
            {
                "body": "I’ve got it. I can work with this - its a bit more cumbersome than i was planning but it works 🙂\nThankyou",
                "author": "Dangerous_Act565",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Explore > funnel exploration \n\nI think is what you’re looking for.",
                "author": "GreenWoods22",
                "score": 1
            },
            {
                "body": "Thankyou but that’s not what I’m after. \n\nFor example, I want to know in total how many customers viewed the confirm page, how long they stayed on it etc. \n\nAt the moment, if i look at the page paths screen I would need to total up/average the below URLs\n\n/AAA/confirm \n\n/BBB/confirm\n\n/CCC/confirm. \n\nRight now i’m getting results from the individual URLs when I want the total for the whole page.",
                "author": "Dangerous_Act565",
                "score": 1
            },
            {
                "body": "You can create 4 separate reports. Don’t display page location, but add a filter page location contains [your page].",
                "author": "YouReadItWhatNow",
                "score": 1
            },
            {
                "body": "Hi @everyone\nI’m now in a situation where my GA home page is taking ages to load because of all these uniquely named pages. \nCan I filter them out somehow. The site only has about 20 pages but because of nature of the URL, GA thinks the URLs are completely unique",
                "author": "Dangerous_Act565",
                "score": 1
            },
            {
                "body": "Do you mean create a report in Explore and then have the metrics along the top like “views, exits etc”\nWhat about things like screen resolution, device type etc. \nhow would i get those?",
                "author": "Dangerous_Act565",
                "score": 1
            },
            {
                "body": "Yes. You can add any metrics and dimensions that you want, just don’t add any dimensions that has the unique code in it. So for example you can add something like \n- Dimensions: screen resolution\n- Metric: Sessions\n- Filter: page location contains review\n\nIt will show you all session for all page locations with review divided into users’ screen resolutions. You need to import the page location dimension to apply the filter, but don’t add it into the displayed dimensions.",
                "author": "YouReadItWhatNow",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1691496331.0,
        "title": "Unable to view child URLs On A .Aspx Webpage",
        "author": "FileRevolutionary950",
        "id": "15lgaq3",
        "selftext": "I am helping a PPC client to get adjusted to GA4. We want to be able to view the performance of selection of pages that showcase the courses that this client offers. The problem is, they are not showing up when using the search functionality of the \"pages & screens\" tab. \n\nAll course URLS begin with /webenrolments.aspx followed by their course ID. I can see /webenrolments.aspx in GA4, but I cannot break this down by the individual course - even though they are completly seperate URLs. \n\nIs there any way to view the child URL's within this /webenrolments.aspx page path? Is it the ASPX that is causing this? ",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/15lgaq3/unable_to_view_child_urls_on_a_aspx_webpage/",
        "num_comments": 4,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "What is the format of the child URL? Parameter based ? Has nothing to do with the file extension",
                "author": "nakfil",
                "score": 1
            },
            {
                "body": "webenrolment.aspx?page=\\~/webcontrols/coursedisplay.ascx&CourseInformationID=15899&\\_gl=1\\*1qft4wz\\*\\_ga\\*MzQzNjQxNTg3LjE2ODcxODUwNTQ.\\*\\_ga\\_27SQ5NZCMY\\*MTY4ODQ2MjAyNi45LjEuMTY4ODQ2MjA5My4wLjAuMA\n\n&#x200B;\n\nThis is an example of the URL format",
                "author": "FileRevolutionary950",
                "score": 1
            },
            {
                "body": "You might need to switch to page path and query to capture everything after the ‘?’\n\nWe had the same on one of our sites.",
                "author": "Decent_Marzipan_1389",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1690587872.0,
        "title": "Child Page Views not tracked",
        "author": "Ambitious-Fisherman7",
        "id": "15cd14b",
        "selftext": "Hi, I have an iframe embedded in the parent page and the child page Views are not tracked by GA4. Any idea how I can track this? Any input is appreciated. Thanks!",
        "score": 0,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/15cd14b/child_page_views_not_tracked/",
        "num_comments": 4,
        "comments": [
            {
                "body": "You have implemented GTM or GA code to child frame right?\nIf yes, then you have to pass data from child frame to parent frame using javascript then you can push it to GA4 from parent website.\nYou cant push events from child frame to GA4 directly.",
                "author": "FixOk1732",
                "score": 3
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Why not a script that reaches out to a tagged link when clicked? That is way less work.",
                "author": "7bitsound",
                "score": 1
            },
            {
                "body": "Thank you so much for the tip. To be honest, I'm not sure if Tag manager is installed on the child pages. I don't have issues with event tracking on child pages, but the page path remains the parent one. I guess I will try what you said. Thanks again!",
                "author": "Ambitious-Fisherman7",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1689363401.0,
        "title": "Best Practices for Parent & Child Domains",
        "author": "Cgwchip4",
        "id": "14zpv54",
        "selftext": "Hi!  \nI am looking for recommendations on how to correctly set up Google Analytics and Google Ads for a client who has a parent site and multiple child domains. My client is an insurance agency with a parent domain. The individual insurance agents have their own child domains.  \nI run ads for the entire agency as a whole, using the parent domain as the final URL, tracking on their own Google Analytics, Google Tag Manager, and the owner's Google Ad account.  \nHere's where I am stuck... There's a specific insurance agent who wants to run Google Ads to promote her specific landing page (child domain). Should I create her own separate Google Analytics account for her child site? Her site already has the parent domain Google Analytics installed. Should I create her own Google Tag Manager account and install her Google Analytics account that way? Would her Google Analytics only track website data from her child site and not the parent domain?  \nNow with Google Ads, here's where I am nervous. I manage ads for the agency as a whole. This agent would be paying for her ads separately. To do this, I would need to create a new ad account. That account technically would have the same domain and would be technically the same name too. From what I read in a discussion on the Google Ads Help forum, \"You can't have two Ads accounts for same business/website. This is policy violation and you can search this community that so many users already suspending for having two Ads accounts. Google Ads policy is very simple and only one account is allowed per business/website/domain/person/organization/payment.\"  \nSo now I am questioning everything because I do not want to risk suspending the entire agency's Google Ad account due to a misunderstanding on structuring accounts specifically for parent/child domains. Thank you for reading, and appreciate any recommendations.",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/14zpv54/best_practices_for_parent_child_domains/",
        "num_comments": 3,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Oh man, sounds like a mess. I sort of have this issue with a company I'm a minority stakeholder in. Its basically a health business with multiple locations. Each location has a different owner, with their own different marketing budgets, etc. Defintely not on your level but similar.  \n\n\nFor GTM... I would have on the account level the company as a whole hold all of the child down different containers.\n\n* Parent Company Account\n   * Child domain container 1\n   * Childer domain container 2, etc\n\nThis way I can separate GA4 accounts. For GA4 .... i think it depends on their business as a whole but I don't think it would hurt for each domain to have their own GA4 account. BUT again I have no idea what their busienss structure is like. I separate GA4 accounts for my client due to some of the marketing tools each location uses. You can set up each location to only show traffic for that child domain, OR for the entire domain. Again that depends on their business goals.\n\nFor Google Ads, I haven't ran into this issue yet because only one location owner is running ads. However, I feel like there are thousands of businesses around the world that have similar structures are what you're dealing with. Google knows that, so there has to be a solution somehow. Can you create ppc specific landing pages for that one insurance agent? on a subdomain...would that violate any rules?",
                "author": "BrandonCJGrimes",
                "score": 1
            },
            {
                "body": "This is against Google Ads TOS. You would really need a separate website/ domain for the individual agent.",
                "author": "Straight-Albatross17",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1719963016.0,
        "title": "Preventing iframe tracking",
        "author": "ElPrezAU",
        "id": "1dtzy5l",
        "selftext": "Hi everyone, \n\nI've got a bit of an issue I'm hoping some of the minds on here would be able to shed some light on.\n\n**The scenario**\n\nI have iframes on a site with GA4 installed via GTM.\n\nWe do NOT have any GTM code on the child iframe page, just the parent.\n\nHowever I am still getting events appearing on the child iframe URL in GA4 reporting.\n\n**My question**\n\nI do not want the child iframe page showing up in reporting at all. How do I prevent GA4 reporting on the child page data?\n\n  \nThanks in advance.",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1dtzy5l/preventing_iframe_tracking/",
        "num_comments": 2,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "You must have GTag on the iframe then? You’ll need to remove it.",
                "author": "nakfil",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1701920398.0,
        "title": "How to set up ecomm tracking for Eventbrite Embedded Codes?",
        "author": "Even_Fly_4803",
        "id": "18cmj2w",
        "selftext": "Hi  \nI am have an eventbrite event. Purchases are firing successfully in GA4 when tickets are pruchased directly from the eventbrite website.  \nHowever, I have also embedded the eventbrite html code to my website in which purchase events do not fire in GTM or GA4.  \nDoes anyone know how to set up ecomm tracking for eventbrite embedded iframe codes?  \nUpon reading online, some people mention that it is because GTM is not installed in the child frame of the embedded code, so I need to set up with a different GTM container. However I'm not sure how to set it up on child frame. Where would the GTM code go?",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/18cmj2w/how_to_set_up_ecomm_tracking_for_eventbrite/",
        "num_comments": 1,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1682419142.0,
        "title": "Unable to attribute orders to landing pages",
        "author": "griz_fan",
        "id": "12yfiqe",
        "selftext": "I'm working on a small website for a boat tour company that sells different packages online, such as a full-day tour, 1/2-day tour, etc... They use a 3rd-party booking management system hosted in an iframe. I have the same GTM container on both the parent and child sites, and I now have things working so the client ID is preserved from parent to child and back again. \n\nCurrently running UA and GA4 side-by-side, and both have basically the same problem; both are flagging the pop-up modal iframe as the \"landing page\" for some orders (about 25%). In theory, I could see how some website users might bookmark the page with the pop-up open, but not 25% of eventual orders. Any ideas on where to start troubleshooting?",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/12yfiqe/unable_to_attribute_orders_to_landing_pages/",
        "num_comments": 6,
        "comments": [
            {
                "body": "That is possible. I have seen code tutorials showing how to defer loading of the iframe tags until after the parent page passes in the client ID. might need to check with that",
                "author": "griz_fan",
                "score": 2
            },
            {
                "body": "Do you have cross-domain tracking enabled?",
                "author": "Auspire",
                "score": 1
            },
            {
                "body": "Just guessing here: is it possible that sometimes (25 %) the iframe page view fires before the main page?",
                "author": "No_Celebration1487",
                "score": 1
            },
            {
                "body": "I just double-checked. In GA4, the data stream configuration lists both domains, and for UA, we have the conversion linker tag firing, with both domains listed.",
                "author": "griz_fan",
                "score": 1
            },
            {
                "body": "This pop-up form. Is there a page users can visit directly where it pops up on its own (without clicking a link or button)? For example, I bookmark a page and when I visit it, the pop-up also appears without me doing anything.",
                "author": "Auspire",
                "score": 1
            },
            {
                "body": "I just checked, and this is not possible. The UA and GA4 reports are attributing some orders to a landing page called \"booking-lightbox\" but that page doesn't actually exist. It is, however, the name of the javascript file that fires the pop-up form, loads the embedded iframe page, and also helps manage the cross site tracking. The Client ID seems to remain intact throughout the process, which is great but I'm wondering why this script file is being seen as a landing page.",
                "author": "griz_fan",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1667465461.0,
        "title": "Connecting Google Analytics to Google Ads MCC?",
        "author": "Terrible_At_Parking",
        "id": "ykwl6a",
        "selftext": "Hello, everyone,\n\n&#x200B;\n\nI was wondering what is the benefit of connecting GA to Google Ads at MCC level or at child account level? \n\n&#x200B;\n\nDoes anyone know?  \n\n\nThank you!",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/ykwl6a/connecting_google_analytics_to_google_ads_mcc/",
        "num_comments": 5,
        "comments": [
            {
                "body": "Inheritance.  If you link at MCC level or any parent level, all child accounts should inherit the settings of the parent.\n\nI'm restructuring a Google Ads global account at the minute, and using this so that at MCC and the two sub tier level we maintain global control over linking, leaving the local users free to add extra Google Ads accounts at the lowest account level without having to muck around with additional linking requests.\n\nThis is useful as a agency user where we don't have admin into the clients GA.  So we link once only and maintain local flexibility.",
                "author": null,
                "score": 2
            },
            {
                "body": "I've actually wondered about this too. I run a MCC for an agency with about 300 accounts and I struggle to understand how it would benefit to connect at the MCC level because each account is a separate website so I don't think it would be a benefit. We have to do everything 1 to 1 which gets really frustrating.",
                "author": "NCTRNL2",
                "score": 2
            },
            {
                "body": "Yeah correct.\n\nIf you linked then all by MCC you'd see all the data in each account.\n\nWhere I work for legal reasons we can't do that.  Uk aren't allowed to see France data for example.",
                "author": null,
                "score": 2
            },
            {
                "body": "Got it - so if I have several different GA properties each for a different country and then if I have different Google Ads accounts separated by country it doesn't make sense to connect all GA properties at MCC level, because it would lead to each Google Ads account to be connected with the different GA that belong to different countries, right?",
                "author": "Terrible_At_Parking",
                "score": 1
            },
            {
                "body": "Perfect, thank you for your input :)",
                "author": "Terrible_At_Parking",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1679582215.0,
        "title": "Possible to Track Event Conversions in GA4 when Div Updates in iframe?",
        "author": "evilsniperxv",
        "id": "11zmbua",
        "selftext": "We are using an iframe on an older CMS and attempting to implement form-fill conversions through GA4. Is it possible to implement a conversion event when the iframe div updates? For instance after the form submission is completed, the parent div updates with \"Thanks for submitting your contact us submission.\". Is it possible to set it so that it's a conversion when the div gets swapped out for that element?",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/11zmbua/possible_to_track_event_conversions_in_ga4_when/",
        "num_comments": 1,
        "comments": [
            {
                "body": "You could look into setting up a child GTM container for your iframed form and then using postMessage set up to send that form fill data from the iframe to the parent (main website) container so your main site GA4 tag can capture that data and send it off to the platform",
                "author": "Gullible_Attitude_20",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1639430201.0,
        "title": "Universal Analytics & Tracking Avg Time on Page with iframes",
        "author": "Phoenix-Jen",
        "id": "rfqdmt",
        "selftext": "I have a client that absolutely HAD to have dynamically generated content on a page that can't dynamically host it (legacy code).\n\nAs a result, we used an iframe to host this special content, and we are now seeing that the iframe is getting almost 4 mins of view time, while the parent page is getting about 1 second.\n\nIn short, the child iframe gets the view time metrics and the parent page gets squat, and now the client is reviewing the analytics and wants to know why this is happening. I'm not an GA Superstar, so can anyone confirm that this is the expected result?\n\nTIA",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/rfqdmt/universal_analytics_tracking_avg_time_on_page/",
        "num_comments": 2,
        "comments": [
            {
                "body": "It's probably because the time on page represents the time between someone landing on a page and when they take the next action such as viewing another page. The container page and contained page are like two separate pages in just this way. GA sees someone land on your containing page, then GA sees they've arrived on the contained page which ends the \"session\" on the container page. It doesn't know that the user is looking at both.\n\nSimple solution: if they can only see the pages together, ignore the time on page for the container page as it'll be the same as the contained page.",
                "author": "MediaWellDone",
                "score": 3
            },
            {
                "body": "This is essentially what I assumed, as well, but a quick Google didn't yield any helpful answers. Thanks for the reply! It certainly helps to confirm my assumptions!",
                "author": "Phoenix-Jen",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1605783645.0,
        "title": "Any disadvantages to using a plugin to configure google tracking code?",
        "author": "omerrob13",
        "id": "jx0qzm",
        "selftext": "Hi, I hope everyone had a great day!  \n\n\nAre there any disadvantages to using a plugin to configure google tracking code?  \nIs it make the site slower, etc?  \n\n\nIs there any disadvantage to using the Theme editor?   \nAs I am not confident in my coding skills, it's making me uncomfortable to put the tracking code in the theme editor.  \nAnd from what I understand, I need to create a child theme and put it in there, right?  \n\n\nWhat is the best way and fastest way (as plugins might make my site slower) to put the tracking code?  \nIs gsuite is condiser fast as relaiable?  \n\n\nIf you recommend a plugin, which one is good other than the gsuit?  \n\n\nThanks!",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/jx0qzm/any_disadvantages_to_using_a_plugin_to_configure/",
        "num_comments": 2,
        "comments": [
            {
                "body": "You may want to pose these questions to a subreddit or group for WordPress moreso than here.",
                "author": null,
                "score": 1
            },
            {
                "body": "I'm guessing this is Wordpress?\n\nThere shouldn't be any major disadvantages to installing a plugin. If it's working, then it's working.\n\nFor speed, it may add load but it shouldn't be that big that I would worry.\n\nI suggest google tag manager for Wordpress-- GTM4WP. This plugin has the most support in the community. I installed it on my website and no problems.",
                "author": "Lupage",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1734086100.0,
        "title": "Missing page views",
        "author": "beatever",
        "id": "1hd9h83",
        "selftext": "I'm puzzled.\n\n  \nWorking on GA4 online data, no BigQuery.  \nPage A = 150 views  \nEntrance on page A= 80 (Views / Session\\_start / Other ?)  \nComing from a previous page on the domain (page referrer) = 20 (Views / Other ?)  \n  \nI'm looking for the origin of the 50 missing Page A views.   \nThe Page referrer report mentions Page A, so it seems that refreshes are taken into account, or does GA4 exclude certain refreshes if too close in time?  \n\n\nPath exploration in Explore is not helpful, but to be hones: I miss the skills to properly use it.",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1hd9h83/missing_page_views/",
        "num_comments": 12,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "You can test the referrer by doing the following: -> navigate from page A to page B -> refresh the page -> open up the console tab in chrome developer mode and type \"document.referrer\" and then you will see the referring URL. For me when I refresh the page the referring URL still displays the former page, not the current refreshed page.",
                "author": "Visqo",
                "score": 1
            },
            {
                "body": "Thanks, what you see seems rather logic to me, or doe I miss something?",
                "author": "beatever",
                "score": 1
            },
            {
                "body": "Thank you for you reply, but where do I mention landing page ?",
                "author": "beatever",
                "score": 1
            },
            {
                "body": "I'll explain my problem, maybe it's clearer what I'm looking for.\n\nClient has several Business Units on 1 website, with what they call BU homepages. Now they want to know where the views / sessions on a BU homepage come from?  \nDo they land on a BU homepage or were they already on the site and navigated to the BU homepage?\n\nI hope this is clearer.",
                "author": "beatever",
                "score": 1
            },
            {
                "body": "The missing 50 page views could be refreshes,  returns on the page after they click on the back button on the browser, user opens up a second tab that leads directly to that page or if a visitor closed down the browser then returns directly to that page within 30 min",
                "author": "Visqo",
                "score": 1
            },
            {
                "body": "You didn't, but page referrer doesn't help answer your question. Please see my revised answer above.",
                "author": "Interesting_Tale1637",
                "score": 1
            },
            {
                "body": "Then you want the landing page dimension.   For each BU homepage,  landing page will tell you if they landed on a BU homepage directly,or navigated there.",
                "author": "Interesting_Tale1637",
                "score": 1
            },
            {
                "body": "Refreshes are partly counted as far as I can figure out.\n\nReturn on the page after back button - that creates another page referrer, unless for mobile maybe, with the forward function ? That's a thing to check out.\n\nsecond tab / within 30 min - same sessions",
                "author": "beatever",
                "score": 1
            },
            {
                "body": "I've done that (Entrance on page A in my original question).   \nBut adding this to the views from the internal referring pages is way out of the total number of views on that page.",
                "author": "beatever",
                "score": 1
            },
            {
                "body": "Modifying answer\n\n\\*If you had 150 views and 50 entrances on Page A, then 70 entrances took place on other pages of your website.  That's the answer to your question.\n\n\\*You didn't mention landing page, but using page referrer would be mixing apples and oranges.  If a user's previous page (referrer) is outside your domain, they will still have a entrance or landing page inside.  Plus, referrer is a value that is easily lost by misconfigurations, so it might be blank in a number of situations.\n\n\\*To best illustrate the answer, I suggest the following exploration:\n\nDimensions: Page Path plus Query string, Landing page  \nMetrics: Total Users, Sessions, Views, Entrances  \nAdd a Filter on the page in question...use \"contains\"...remove hostname and any query parameters.\n\nThe first row under totals is most likely those who visited the page AND entered there.   The remaining rows explain the views for those who didn't.    Users and sessions help explain audience size and if they come back.     Page reloads or page refreshes is not an easy metric to get; but it shouldn't be a major factor anyways.\n\n\\*Start with Landing Page, then try referrer instead, then try both.  (The report might become unwieldly with both).   Despite my comments about page referrer,  add it in and see if it adds anything with these metrics.\n\nConclusions:\n\n\\*Including users and sessions shows some aspects that many people might not think of: there might be a much smaller group of users responsible for activity, and these users might be coming back multiple times.\n\n\\*This exploration allows you to answer a number of business questions, not just the one posed here.\n\nPlease let us know how it goes!",
                "author": "Interesting_Tale1637",
                "score": 0
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1723376937.0,
        "title": "\"Segments you create or modify are *only available in the exploration in which you define them*.\"",
        "author": "InfiniteSalamander35",
        "id": "1epixjx",
        "selftext": "Are you kidding me with this, you can't reuse custom segments? In UA I had a stable of probably 200 custom segments I'd return to off and on. GA4 is not a serious product.",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1epixjx/segments_you_create_or_modify_are_only_available/",
        "num_comments": 6,
        "comments": [
            {
                "body": "Appreciate the suggestion — custom comparisons are an admin-level feature, seem to be unavailable for lower than Editor. I imagine it might work (not sure why GA feels “segments” needs a second name) but it’s inapplicable for enterprises (fwiw I don’t consider GA4 an enterprise solution, even with 360, tho I don’t believe Google does either — I imagine every shortcoming is a deliberate advertisement for BigQuery).",
                "author": "InfiniteSalamander35",
                "score": 5
            },
            {
                "body": "Check out the [custom comparisons](https://support.google.com/analytics/answer/9269518?hl=en) feature to see if it fits your needs.",
                "author": "cannybananas",
                "score": 2
            },
            {
                "body": "And Looker",
                "author": "compileandrun",
                "score": 2
            },
            {
                "body": "Maybe Looker as well, not sure whether Looker improves matters for folks or not. We have a lot of gaps using free version of Looker Studio with GA4 API (e.g. sampling rate for our site is awful, no exit page dimension for some reason, interface no less clunky than GA4’s) — no idea what paid Looker gets us if the API is so limited. Either way, GA4 fails in a lot of deliberate ways that Urchin/UA didn’t. It just doesn’t seem like an earnest solution, it feels like trying to work a hotel television.",
                "author": "InfiniteSalamander35",
                "score": 2
            },
            {
                "body": "I'm with you there about GA4. \n\nWith Bigquery+Looker you can process raw events and do a lot of things but it requires quite some work compared to your solution.",
                "author": "compileandrun",
                "score": 2
            },
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1725453340.0,
        "title": "How to see analytics for Taxonomy?",
        "author": "alexburnsredd",
        "id": "1f8s6jf",
        "selftext": "How would I go about viewing data/analytics for the taxonomy on my website? \n\nhttps://preview.redd.it/e3x1bnplesmd1.png?width=1364&format=png&auto=webp&s=0e9e0dc034451c5248fb399b275c12250a1272de\n\n  \n",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1f8s6jf/how_to_see_analytics_for_taxonomy/",
        "num_comments": 2,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": " Check out product list tracking. It takes a while to get set up, but if you can tell GA what product list a user clicked into an item from, then continue to pass that as a product-scoped parameter for add to cart, checkout, and purchase, you can end up with a very nice report that shows performance at the taxonomy level as a funnel.",
                "author": "brreckelhoff",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1715367098.0,
        "title": "Need an Explanation about Data Discrepancies. ",
        "author": "slopia",
        "id": "1cox0z2",
        "selftext": "I'm currently analyzing the results of a week long sales campaign in GA4. We have an external system to measure purchases that we trust more than GA4, so I'll be using that for actual revenue and purchase metrics. However, it would be nice while I analyze traffic sources and landing pages to see how many people viewed an item.\n\n  \nMy issue that I've been dealing with for hours:  \nI set up a traffic acquisition report, and select \"session source/medium\" as my dimension with my only two metrics being \"total users\" and \"sessions.\" Pretty standard stuff. But as soon as I add \"items viewed\" as a metric, the numbers for \"total users\" and \"sessions\" completely changes by thousands. This is making it super difficult to build my report as I'm really trying to be as accurate as possible as the report will have a lot of eyes on it, but how am I supposed to ensure the validity of the data when it changes so often? What report am I supposed to trust to give me the most accurate metrics?\n\n  \nCan anyone help me with this? Thanks in advance.",
        "score": 2,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/1cox0z2/need_an_explanation_about_data_discrepancies/",
        "num_comments": 5,
        "comments": [
            {
                "body": "Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GoogleAnalytics) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "A theory: Per Google’s documentation, Items viewed comes from the items array of the view_item event, so by applying that metric you may essentially be inadvertently filtering for sessions and users that had a view_item event.",
                "author": "light_blue_sleeper",
                "score": 1
            },
            {
                "body": "[removed]",
                "author": null,
                "score": 1
            },
            {
                "body": "Ok, thanks for the response I appreciate the help. That kid of makes sense to me. Just frustrating.",
                "author": "slopia",
                "score": 1
            },
            {
                "body": "Thanks!",
                "author": "slopia",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "GoogleAnalytics",
        "created": 1670877899.0,
        "title": "Ecommerce purchases report empty?",
        "author": "IJustLoveWinning",
        "id": "zkav96",
        "selftext": "I've been struggling with GA4 for a long time. The report that shows the ROI on my ad campaigns that I used to have in the UA version simply doesn't work in GA4.\n\nMy e-commerce purchases report is completely empty and I definitely have sales, as the UA will still report. Both tags for UA and GA4 are under each other in my Shopify theme, so you'd think they measure the same?\n\nI'm ready to thrown my mouse across my office (just kidding, I'm a pretty calm guy). I just can't seem to find out why GA4 isn't showing the purchases on my site.\n\nHas anyone else have the same issue happen?",
        "score": 1,
        "url": "https://www.reddit.com/r/GoogleAnalytics/comments/zkav96/ecommerce_purchases_report_empty/",
        "num_comments": 1,
        "comments": [
            {
                "body": "Had this happen in a GA4 account that was upgraded from UA account. My impression is GA automatically sends visitor data from UA tracker to GA4, but not the e-commerce conversions or events.\n\nNot sure if it's by design or a one-off bug.\n\nSwitching website tracker to GA4 measurement id fixed it for me.",
                "author": "paul_944",
                "score": 1
            }
        ]
    }
]