[
    {
        "subreddit": "web_design",
        "created": 1733176520.0,
        "title": "Is it possible to have a website that has no need of Consent and Disclosures? ",
        "author": "Jungleexplorer",
        "id": "1h56zoh",
        "selftext": "I am not a professional, but know how to do some development with WordPress.  A minister asked me to develop a stand-alone ministry site.  The site will host encouraging scriptures and advice, but will ask nothing of  visitors in any way. In fact, it will offer viewers no possible way to enter data or even contact anyone. It will be stand-alone for information only.  Other than a bare-bones visitor count, I will not design the site to intentionally harvest any other information from visitors.\n\nWhat I want to know is, is the site is not harvesting data, and ask for no data or provides anyone for the users to even input any data, does the privacy laws still require have things like a Cookie Consent and a Privacy Disclaimer?\n\nI obviously want to obey the law, I just think that having disclaimer popups about Cookies and Tracking will be give the wrong impression about the site's purpose. I mean, the purpose is to offer no-strings, hands-off, anonymous, encouragement and hope to people. Having a popup saying \"**We might be tracking you!\"** seems to counter the message the site is intended to send and is misleading, since that is not what I will design the site to do.  I understand that there may be some tracking done by the hosting company and by google, but that is not something the site will be doing or have any control over. \n\nCan it be done?",
        "score": 7,
        "url": "https://www.reddit.com/r/web_design/comments/1h56zoh/is_it_possible_to_have_a_website_that_has_no_need/",
        "num_comments": 58,
        "comments": [
            {
                "body": "[deleted]",
                "author": null,
                "score": 59
            },
            {
                "body": "You (and most companies and devs) are remembering it wrong. Cookie consent banners are for users consenting to have *non-essential* cookies. This means cookies that are not required for your site to work. Generally that means cookies used for user tracking, advertising, personalization, etc.\n\nJust having a cookie-based login does **not** require a cookie consent banner. Having a cookie that is used to track user interaction on the site, however, does.",
                "author": "the_bananalord",
                "score": 12
            },
            {
                "body": "I'd like to argue they're not \"remembering\" at all. \n\nThey are guessing and assuming based on other's assumption and hearsay. Nobody who has gotten any training/body of knowledge to \"remember\" from would go around with the notion that 100% cookies requires consent. \n\nThat's not misremembering something, that's just flat out not knowing it to start with.",
                "author": "loptr",
                "score": 8
            },
            {
                "body": "You can still track user metrics, just use a cookie-free analytics tool like Fathom, Plausible, or Matomo. But leave out cookie-based stuff like facebook pixels of course.",
                "author": "stoffelio",
                "score": 7
            },
            {
                "body": "[removed]",
                "author": null,
                "score": 6
            },
            {
                "body": "If it doesn't save cookies on the users computer, then you don't need to ask them to accept cookies.",
                "author": "The_4ngry_5quid",
                "score": 6
            },
            {
                "body": "I just did a deep(ish) dive on this for the agency I work at. \n\nA few “gotchas” you might have overlooked that would require a consent banner:\n\n- If you have Google Analytics installed to monitor traffic data\n- If you use Google Fonts (and aren’t hosting them yourself)\n- If you use a Google Maps API (this one is a bit of a gray area as they provide a variety of tools/services so it’s dependent on what you’re using and how)\n\nYou probably noticed a pattern. Google isn’t great when it comes to protecting privacy, but also GDPR is so broad that capturing a user’s IP Address (even for the purpose of serving a font) is considered storing Personally Identifiable Information (PII).\n\nAlso, I’m sure there are plenty of other services out there that are following a similar playbook to Google, but I just mention those because they’re so widely used across websites without a 2nd thought. Good luck!",
                "author": "simplerando",
                "score": 5
            },
            {
                "body": "Thanks. I don't have anything Google installed, or any other kind of analytics.  The only thing my friend wants to know is how many visitors there have been. \n\nHowever,  I do have some security plug-ins like Wordfence, and Really Simple Security.  I also have a SSL installed for the domain.  I don't know if these track users, but I have no access to that data if they do.",
                "author": "Jungleexplorer",
                "score": 4
            },
            {
                "body": "SSLs certainly don’t, but I would do some cursory searches about Wordfence and any other security plugins you have installed. I would maybe just search something like “Does Wordfence violate GDPR” to cover your bases. I feel like security plugins often track IP Addresses for the purposes of preventing brute force attacks, but obviously not a lawyer so I don’t know where that falls in regards to GDPR exactly.",
                "author": "simplerando",
                "score": 4
            },
            {
                "body": "At least gdpr is not about cookies for the exact reason you list those options.\n\nTo not require a gdpr notice and options, you must not collect data that is not required for your site to function and not forward used data to other services, without their consent, that can include free services like fonts storages.",
                "author": "bladub",
                "score": 3
            },
            {
                "body": "As I said in my OP, I am not a professional.  I am not the one making this complicated. I am have not added any degree of complication. Some responders to my questions are the ones adding the levels of complications.  I am simply asking questions in response to those comments.  \n\nAs for hosting a simple html page, it is my understanding that those are considered to be very insecure and will not even be indexed by search engines. I am just asking if what I have read is accurate.  I am not \"Adding complication.\"",
                "author": "Jungleexplorer",
                "score": 3
            },
            {
                "body": "Simple html is the most secure. Html is static, there's no database. There's nothing to hack. \n\n\nHtml websites are definitely indexed by search engines. Include a <title> tag and meta description tag in the <head> of your html. \n\nJust get a free account on blogger, substack, or wordpress. Let them deal with the cookie compliance issues.",
                "author": "brrrchill",
                "score": 3
            },
            {
                "body": "Awesome! Thank you.",
                "author": "Jungleexplorer",
                "score": 2
            },
            {
                "body": "Well, all user IPs are tracked continuously by every request is processed through, but that has nothing to do with me or the site. I am using IONOS which is a German based company, but they do have a server bank in the US.  I am not sure which one my hosting plan is stored on, but I think it  might be the German one.  I have zero knowledge of how long they store IP addresses, but I would assume it would be in compliance with any EU law. But again, this has nothing to do with the website or data it is collecting.  I have not employed any form of analytics on the site to track anything. If the host is doing it, then that is on them.  Why would I be required to provide notice for what they do, when I have no idea what they are doing, or have any say or control over it?",
                "author": "Jungleexplorer",
                "score": 2
            },
            {
                "body": "One thing to consider here is that a privacy policy is far less intrusive than a cookie banner. If what you're trying to do is avoid giving the impression that your site is watching its users, you may find a privacy policy has that exact effect. \n\nPersonally, I feel a privacy policy gives you an opportunity to be transparent and explain the few instances that you might be forced to collect personal data for your site to function. \n\nIt's the cookie banner that you should place your focus on. If you can avoid using cookies (first party and third party) then you'll have no need for a cookie banner and your goal is achieved. \n\nCheers,\n\nAlistair\n\n[GetTerms](https://getterms.io/)",
                "author": "GetTerms-Alistair",
                "score": 2
            },
            {
                "body": "Completely correct when it comes to essential cookies, users don't even need to be *notified* of these, let alone acquiring consent.",
                "author": "Polymer15",
                "score": 2
            },
            {
                "body": "Corrext, I had a brain fart.",
                "author": null,
                "score": 2
            },
            {
                "body": "It’s not complicated. Most freelancers and small business manage it quite well. The laws are there to protect privacy, so you’re skewing perspective here. It’s not to bully businesses, it’s to protect consumers.\n\nJust host a static HTML+CSS, dont add anything that might track users on purpose and you’re good to go. You’re making this difficult.",
                "author": "No-Hospital-5340",
                "score": 2
            },
            {
                "body": "Honestly a privacy policy isn't something I can tell you how to write without knowing more about your data practices. For now, can I suggest that you follow a template? There are a few things you want to tick off, but you can absolutely personalize it as you have done with the above text.\n\nAs in, follow the structure of a template, add what needs to be there, but adjust it to read as you intended. \n\nI recently used our own generator to create a template that you can use completely free, no strings attached, but you are obviously welcome to research others - not trying to sell you on our product at all here. \n\nLet me know if you have any questions though.\n\n  \n[Privacy Policy Template](https://getterms.io/templates/privacy-policy-template)",
                "author": "GetTerms-Alistair",
                "score": 2
            },
            {
                "body": "How is including a gfont \"forwarding user info\"?",
                "author": "Hvarfa-Bragi",
                "score": 2
            },
            {
                "body": "I didn't say it didn't work or wasn't easy.  \n  \n>I’m not hearing why this sucks or why you think it’s unprofessional.\n\nI can't say more than I already said in the previous comment: legit users can be locked out of your website. \n\nJust imagine you're a student living abroad for a year, suddenly you can't access the news of your hometown, your bank account, your e-mail account, you can't order gifts for your family in your favorite store, etc. \n\nOr you're just on vacations, and an accident occurs, you need to contact your insurance, but their website is geolocked because \"they're a US company with US customers\", that's just silly.  \n  \nAnd it just goes against net neutrality. \n\nIt only takes one more step to use the geo tracking to display a cookie banner in concerned countries instead of locking your website, your solution is just lazy.",
                "author": "UltraChilly",
                "score": 2
            },
            {
                "body": "Can't tell which part of \"your users can't access your content\" doesn't strike you as a bad idea. \n\n> I’ve been doing this since the 90s\n\nYou do sound like a 90's dev.\n\n>and I love learning\n\nIt doesn't seem so, I explained why it was problematic and what you could do to solve it, but you're stubbornly ignoring the issue. \n\n> I disagree on this for several reasons.\n\nWell, if you really prefer keeping them for yourself instead of discussing them that's fine by me.",
                "author": "UltraChilly",
                "score": 2
            },
            {
                "body": "Just get a free acct on blogger, substack or wordpress dot com. \n\nYes, an html page can be mobile friendly. All pages are html pages. It's just that some of them are created by applications like wordpress, or Facebook or whatever.",
                "author": "brrrchill",
                "score": 2
            },
            {
                "body": "Depends if you use cookies to track visitors, i.e. to know if the same person has made a repeat visitor, rather than just incrementing a visit count each and every time the page is loaded—no matter who is loading it.",
                "author": "martinbean",
                "score": 1
            },
            {
                "body": "Worth noting, if you are using plugins they may harvest data/ save cookies.\n\n\nSomething to be mindful of.",
                "author": "ImReellySmart",
                "score": 1
            },
            {
                "body": "You are correct to be cautious about privacy laws, but even if your site doesn’t actively collect data, you may still need to comply with privacy regulations depending on where your visitors are located. For example:\n\n1. **GDPR (General Data Protection Regulation)**: If your site receives visitors from the EU, GDPR requires you to provide a privacy policy even if you're not collecting data. It also requires cookie consent if cookies are used for tracking or analytics (like Google Analytics).\n2. **CCPA (California Consumer Privacy Act)**: If your site gets visitors from California, CCPA may apply, and it may require a privacy policy and a cookie notice if you're collecting any data.\n\nSince your site might still use Google Analytics or other tools that set cookies, it's a good idea to include a basic privacy policy explaining what data (if any) is collected and how it's used, even if it's minimal. You could also consider offering a discreet cookie notice, maybe without a pop-up, as an alternative, ensuring the user experience aligns with your site's message of privacy and simplicity.\n\nWhile it's understandable to not want pop-ups, the key is transparency. You don't need to overcomplicate it just inform users that some minimal data might be collected for technical reasons, and they'll appreciate the honesty!",
                "author": "DMWebSoftLLP",
                "score": 1
            },
            {
                "body": "Under GDPR the logging of user IP addresses counts as storing PII, and this tracking will likely be done by whatever web services you use to host.\n\nFor security purposes it is allowed to be collected without consent, but it must only be stored for a reasonable time. You will have to notify the user how long it is being stored for and what your intention for the data is (that being security).",
                "author": "Polymer15",
                "score": 1
            },
            {
                "body": "I don't track anything I swear",
                "author": "ThaisaGuilford",
                "score": 1
            },
            {
                "body": "Thank you. I appreciate your helpful insight.",
                "author": "Jungleexplorer",
                "score": 1
            },
            {
                "body": "I plan to host this website through IONOS, under my own plan. I do this for a few other friends.  I do not plan on installing any kinds of tracking plugins in WordPress, but I do know that IONOS does have some backend server stats that offer this information if I want these kinds of stats.  I am not sure how they do it, or if it involves cookies, but I will not install any sort of thing myself in the WP site.  All my friend wants is just a visitor count, doesn't matter if it is repeat visitors or not.",
                "author": "Jungleexplorer",
                "score": 1
            },
            {
                "body": "Hehe the cookie to remember you said allow cookies?\n\n\nNo, it’s about non essential ones",
                "author": "n8-sd",
                "score": 1
            },
            {
                "body": "It was supposed to say COMPONENT. Jesus smh",
                "author": "_condition_",
                "score": 1
            },
            {
                "body": "To be GDPR compliant you **can** have analytics on your site.\n\nThe difference is instead of being able to identify users in any real capacity.\n\nYou just say there has been 1 page view on Home and Contact.\n\nYou can track the number of pages viewed, you can even track the time they were viewed at. But the data you collect cannot identify a specific person without extreme dedication.\n\nSo town/state/country are a definite no. You could pretty easily identify a user from their town, depending on the content of the site (i.e. if it's niche, there's less people in town who'd be your \"target\"). State and country *should* be fine but when you consider countries like San Marino being smaller in population than some towns... yeah, it's best to leave them off. Finding 1 person in a group of 33,000 isn't \"impossible\".\n\nUser IDs/email address/etc. are obvious nos. But a session ID *could* be ok if the ID is completely random and there is no storage of it anywhere; i.e. you were using it to be able to track user journeys... BUT then you get into the question of would it be identifiable? So again, probably safer to leave it out.\n\nUnfortunately, I don't think there's a hard and fast rule on what is \"personally identifiable\", outside of the obvious things (user ID, email address, phone number, name, etc.) so I would generally just say that if could I look at the analytics and say which data is **likely** mine (it may not be, but based on the data it could be), then it is personally identifiable. Though, I wouldn't be surprised if there's companies which run analytics, are GDPR compliant, and use a metric like you could identify 500 or more people, but nothing more refined, in the world based on what you gather.",
                "author": "jordsta95",
                "score": 1
            },
            {
                "body": "Do you mean that if I use google fonts I have to have a banner that mentions it?",
                "author": "rs_0",
                "score": 1
            },
            {
                "body": "Yeah, this is way too complicated for me to understand.  It is a real shame, because I feel like all of these laws are just simply taking away the ability of regular people to share information and relegating it to big professionals with deep budgets.  My friend wants a simple one-page website, to share a message of hope with visitors.  Why does it have to be so compicated?",
                "author": "Jungleexplorer",
                "score": 1
            },
            {
                "body": "What should the privacy policy say.  I am thinking something like this.\n\n\"This website does not intentionally harvest or store any type of personal identifiable information about its visitors nor is it the desire of the owner or the developer for it to do so. There may be third-party services such as Google, YouTube, and the Ionos hosting service that may collect such information, but this is neither at the request nor the desire of the owner of the owner, and is outside of our control.\"",
                "author": "Jungleexplorer",
                "score": 1
            },
            {
                "body": "That was only part of the issue though, the whole geo-blocking idea sucks TBH. First off because there are several ways it could backfire and block false positives (people using VPNs, customers traveling, etc.) but also because it just sucks not being able to access Internet content depending on where you are as a concept.",
                "author": "UltraChilly",
                "score": 1
            },
            {
                "body": "Yes!",
                "author": "reddian_",
                "score": 1
            },
            {
                "body": "Exactly. Good clarification, thank you.",
                "author": "the_bananalord",
                "score": 1
            },
            {
                "body": "I have many, many clients that I’ve configured this for for several reasons. In the above example my professional opinion is unless you are an international business there’s absolutely no need to have your website comply with EU law and broadcast all around the world. For security, it helps a lot. I’ve done a lot of work in politics and other businesses and orgs that are targets. Restricting to just the U.S. helps a lot with that. There’s a fantastic component for Joomla called RSFirewall. You can download the latest country geo data and import it into their component. In addition to the features I just described there are many others that are very useful and work very well, that the client or website owner can access. There are similar things for WordPress as well. \n\nCloudflare has these options as well, so your CDN can be protecting your site before anything even loads. \n\nI’m not hearing why this sucks or why you think it’s unprofessional.",
                "author": "_condition_",
                "score": 1
            },
            {
                "body": "wtf. Do you happen to have an example of what’s need to be written on a banner?",
                "author": "rs_0",
                "score": 1
            },
            {
                "body": "Thanks. I really appreciate it.",
                "author": "Jungleexplorer",
                "score": 1
            },
            {
                "body": "So I downloaded the template, but 90% of it is about how we Handle user data.  That it seems counterintuitive since the whole point is that we Don't Handle or store any user data.\n\nI really think everyone is not clearly understand what I am saying here.  Everyone keeps referring to things like Google Analytics and storing user data when I have expressly said that the website will do none of that, and if any data is collected or stored, it is not the owner of the website doing it. I think what people are struggling with is the idea that, We Don't Want any user data at all. If other services' collet it, that is outside of our Intention, Desire, and Control.\n\nI mean, let's be realistic here. If you are on the internet, you are being tracked.  This message, I am writing here, will pass through many nodes, and each one of those nodes will collect data on this message.  Each one of those nodes does not have to give you a notice to Accept this before it passes your message through. Does every website owner have to be responsible for all the information collected about a user by all the nodes and severs that processes their calls and requests before they even reach their website?  That is ridiculous! That is to make the website owner responsible for what OTHER people, they have no control over, are doing.\n\nI feel like I am not being understood here and everyone thinks that I am secretly trying to figure out how to collect user data without disclosing it.  That is the exact opposite.  I don't freaking want darn single bit of user data and will do everything in my power to design the website to not collect it any. If any gets collected, it will not be me doing it and will be completely without my permission or control. Why am I responsible for that?",
                "author": "Jungleexplorer",
                "score": 1
            },
            {
                "body": "It's requesting the font on page load, therefore a request by the client which exposes multiple things to Google.\nIt's an external resource which should be addressed at least in the impressum, depending on what it actually does/collects.",
                "author": "reddian_",
                "score": 1
            },
            {
                "body": "So you remove that whole section. \n\nKeep the parts that are relevant is all I'm saying. E.g. we may share data with third parties - if that's relevant to you. Just think of your privacy policy as you trying to be as transparent as possible. You can remove anything if it's not applicable.\n\nI do understand what you are saying, I think it's just quite hard to give advice on privacy compliance without being in your project firsthand. \n\n  \nGood luck either way. Do a little more reading and you'll be fine.",
                "author": "GetTerms-Alistair",
                "score": 1
            },
            {
                "body": "So do you need to disclose all hotlinked pictures?\n\nAll CDN'd javascript?\n\nAll uses of bootstrap.css?",
                "author": "Hvarfa-Bragi",
                "score": 1
            },
            {
                "body": "I built an HTML site back in theb90s with FrontPage, but that site is not mobile compatible. That is why I switched to using WordPress, for mobile compatible. Can an HTML site be mobile compatible?",
                "author": "Jungleexplorer",
                "score": 1
            },
            {
                "body": "> Yes I’m “from the 90’s” if you count starting my first professional job when I was still a teen in 1999 so sure 👍\n\nBro, I was quoting you, wtf are you smoking?\n\n>No my guy. Someone in Turkey or France is NOT “you’re” with an apostrophe user.\n\nYou don't know that, that's the point. You can't know they're not your user just by their location, I've given you two examples a 5 y/o could understand.  \n  \nAs for the typo, on peut continuer la conversation en français si tu préfères, y'aura moins de chances que je fasse des fautes, o sino en español? それとも日本語の方が好きですか\n\nSo yeah, basically if you can't understand people travel, use vpn's or things like Starlink, etc. and might still be your customers despite what their IP says, I can't help you, good night.",
                "author": "UltraChilly",
                "score": 1
            },
            {
                "body": "> What you can do to be professional about it is block outside country Ip’s with a company that checks GEO country data.\n\nyeah, that's the professional way to handle it... /s",
                "author": "UltraChilly",
                "score": 0
            },
            {
                "body": "Yea, I understand that you may not be tracking or storing IP addresses of your users directly, but if you're employing the services of a web-hosting provider - and if they do store the IP addresses - then you will need to put that as a notice.\n\nIt's similar if you were using Google Analytics on your website; you're not the one *directly* storing said information, but it is being stored and you still need to notify users of it. You are employing a hosting provider that may or may not store and track IP addresses, on your behalf, for security.\n\nIONOS will be following GDPR, which is to say that they will store the IPs an appropriate manner and give you the information on how they are storing it, but it is your responsibility as the website owner to inform the users. IONOS has a section for GDPR [here](https://www.ionos.com/help/data-protection/overview-of-the-general-data-protection-regulation-gdpr/general-data-protection-regulation-gdpr/), and if you are unsure what data they're collecting as you host, I'm sure you can contact them to ask.",
                "author": "Polymer15",
                "score": 0
            },
            {
                "body": "This is correct, thanks.",
                "author": null,
                "score": 0
            },
            {
                "body": "I dint mean to say you can't have any metrics, sorry, my main point was meant to be it is not related to cookies. Simply not having cookies is not enough to be gdpr compliant.",
                "author": "bladub",
                "score": 0
            },
            {
                "body": "In absolutely correct theory, yes.\nBut you can declare the image source as one reference, if multiple images are from the same third party.\nIf you host bootstrap yourself, you don't have to, else you can also reference it under a general section of \"external resources\".\nThere is an exception for stuff that is essential for the functionality of the site, so it also matters to which extent.\n\nBut overall, the official site for GDPR from the EU gives mostly good explanations on all this.",
                "author": "reddian_",
                "score": 0
            },
            {
                "body": "I was actually expecting there to be some genuine reason why this is bad practice. This is an opinion of yours that you have strong feelings about, but I haven’t seen any reason that I or my people or my clients shouldn’t restrict their business websites that don’t do business outside the U.S. to the U.S. I’m pretty open to listening to my colleagues with an open mind and changing the way I do things if there’s a good reason. I’ve been doing this since the 90s and I love learning. I disagree on this for several reasons.",
                "author": "_condition_",
                "score": -1
            },
            {
                "body": "“Your users”\n\nNo my guy. Someone in Turkey or France is NOT “you’re” with an apostrophe user.\n\nRidiculous.\n\nThere’s a lot of work involved in geo blocking and setting up security to screen out UNWANTED visitors. For some companies there is absolutely no GOOD and PRACTICAL, REALISTIC reason to have their business website accessible in Slovakia and Iran and Kenya and Egypt and a zillion places that have nothing to do with their business.\n\nIt takes extra work to configure a website to block out everywhere except the county the business does business in from unwanted traffic. It costs money and it takes a professional.\n\nYes I’m “from the 90’s” if you count starting my first professional job when I was still a teen in 1999 so sure 👍",
                "author": "_condition_",
                "score": -1
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": -8
            },
            {
                "body": "IIRC you need to be 100% cookie-free. \n\nEven if you're using *technical* cookies only , you're still supposed to show a banner (at least in the EU zone).",
                "author": null,
                "score": -14
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1621265024.0,
        "title": "ADA/WCAG compliant cookie consent and privacy policy generator",
        "author": "surfnsound",
        "id": "nej4cn",
        "selftext": "I've been using termly.io for my privacy policy and cookie consent, but an ADA audit revealed their cookie banner is not accessible. I've found one cookie consent that is accessible so far, but it doesn't generate and auto-update the privacy policy.\n\nJust wondering if anyone else has found a solution out there, either a script load or Wordpress plugin, that will do this and follow accessibility guidelines?",
        "score": 2,
        "url": "https://www.reddit.com/r/web_design/comments/nej4cn/adawcag_compliant_cookie_consent_and_privacy/",
        "num_comments": 0,
        "comments": []
    },
    {
        "subreddit": "web_design",
        "created": 1598819661.0,
        "title": "Modify a Cookie Consent overlay to load on every visit?",
        "author": "TheCudder",
        "id": "ijjy3r",
        "selftext": "I'm using [this](https://www.websitepolicies.com/create/cookie-consent-banner) \"cookie consent\" generator for the purpose of creating a User Consent Notice & Acknowledgement banner. Only problem is, by design cookie banners are designed to appear once or until the cookie cache is cleared.\n\nSo how do I change this behavior? Here are the [CSS](https://cdn.wpcc.io/lib/1.0.2/cookieconsent.min.css) & [JS](https://cdn.wpcc.io/lib/1.0.2/cookieconsent.min.js) files.\n\nEdit: Answer no longer needed. Simply went with a different solution.",
        "score": 2,
        "url": "https://www.reddit.com/r/web_design/comments/ijjy3r/modify_a_cookie_consent_overlay_to_load_on_every/",
        "num_comments": 1,
        "comments": [
            {
                "body": "[deleted]",
                "author": null,
                "score": 5
            },
            {
                "body": "Nothing more than a checklist item on a security review list. Per the list, internal company users must be presented the banner and privacy/use consent text when accessing the site.\n\nI would have preferred an overlay notice, but I decided to just create a new landing page with the requested text and an OK to agree and proceed button.",
                "author": "TheCudder",
                "score": 2
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1612029465.0,
        "title": "Has anyone made/found a good and user-friendly implementation of a tracking/cookie consent dialog?",
        "author": "ThatBoiRalphy",
        "id": "l8rcjt",
        "selftext": "As lots of people, I find most of the tracking/consent forms very frustrating and I’m looking for an example that is more user friendly and just looks better.",
        "score": 3,
        "url": "https://www.reddit.com/r/web_design/comments/l8rcjt/has_anyone_madefound_a_good_and_userfriendly/",
        "num_comments": 0,
        "comments": []
    },
    {
        "subreddit": "web_design",
        "created": 1665745231.0,
        "title": "Web design is being ruined by CTAs, cookie banners, chatbots, and extensions.",
        "author": "braydensreddit",
        "id": "y3qsjn",
        "selftext": "Has anyone else noticed in recent years that websites have becomes absolutely inundated with varying CTAs vying for the users attention? The amount of times I've gone to a website only to be immediately greeted by 4 competing CTAs (cookies policy accept, a chatbot asking if I need help, a promo \"sign up for email alerts and get 10% off!\", and a regular ad [especially on news sites]). How on earth did this become the norm? The web is becoming unusable.",
        "score": 468,
        "url": "https://www.reddit.com/r/web_design/comments/y3qsjn/web_design_is_being_ruined_by_ctas_cookie_banners/",
        "num_comments": 79,
        "comments": [
            {
                "body": "Desktop is fine. Mobile is utter horseshit. So many banners, wrong clicks, misplaced items and endless layout shifts.",
                "author": null,
                "score": 135
            },
            {
                "body": "It's been comparable to this before, in the early 2000's. (But I feel it was much worse) You had real popups everywhere (browser windows opening new browser windows), ads playing music, downloading malware, websites hijacking hyperlinks, everything.   \nIt became better again, and now it looks a bit like we are heading back to these times. I guess users and browsers will adapt, and it will become better again too some day.",
                "author": "zabast",
                "score": 131
            },
            {
                "body": "I hate the chatbot thing so much! I shop for things online to avoid someone asking if I need any help!",
                "author": "fritzbitz",
                "score": 55
            },
            {
                "body": "The early 2000's were bad, you genuinely had to be careful of where on the web you go.\n\nNews sites have gotten spammier IMO, but outside that, and the cookie pop-up, things seem better to me.",
                "author": "ThunderySleep",
                "score": 51
            },
            {
                "body": "The cookie policy is understandable , but as more and more people voice about their data being tracked and whatnot, websites have to be GDPR compliant and all that jazz.\n\nThe chatbots I do dislike though haha.",
                "author": "keptfrozen",
                "score": 34
            },
            {
                "body": "This is why I avoid visiting websites as much as possible, especially on mobile. Just trying to find a random recipe on google means avoiding:\n\n-\tThe random ass story the blogger thought was relevant and is 300 paragraphs long\n-\tThe cookie banner that takes 1/3 of the vertical space\n-\tThe pop-ups for some discount or something \n-\tThe pop-up ads with microscopic close buttons that are in a different spot each time\n-\tThe ads that are embedded within the content \n\nHence my recipe ends up sandwitched in such small areas my brain wants to spontaneously liquefy. \n\nThis is also true for articles or other such content. A true waste of time.",
                "author": "doggo_luv",
                "score": 31
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 23
            },
            {
                "body": "Trying to view the internet on a mobile phone was always a fool's errand. But it does come in very useful on the other hand.\n\nHaving said that, I am always complimented on my mobile layouts, so I guess hypocrisy thy name is BlackHoneyTobacco.",
                "author": "BlackHoneyTobacco",
                "score": 22
            },
            {
                "body": "What's great is when the \"No tracking\" option includes not saving the cookie that tracks the no tracking option so you get the question banner on every single page",
                "author": "saltr",
                "score": 22
            },
            {
                "body": "sable paltry jellyfish alive jeans pen lush support elastic flag\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                "author": "jonassalen",
                "score": 19
            },
            {
                "body": "Don’t worry no one decides and every website is awful.",
                "author": "fireball_jones",
                "score": 15
            },
            {
                "body": "At least in early 2k exploits were pretty much relegated to showing more ads.  Now they they hit you with ransomware.",
                "author": "twinsea",
                "score": 14
            },
            {
                "body": "I don't know...sounds like something a chatbot would say 🤔",
                "author": "fritzbitz",
                "score": 14
            },
            {
                "body": "> How on earth did this become the norm? The web is becoming unusable.\n\nFirst, you should split sites into different buckets.\n\nTons of sites have great design with none of that. Business sites. Product sites. Web apps. All that stuff.\n\nThey don't have all that stuff because they generate revenue in other ways.\n\nWithout that the \"only\" thing you have left is ad revenue.",
                "author": "MyWorkAccountThisIs",
                "score": 13
            },
            {
                "body": "i would argue it isn’t on the developer to determine the timing.",
                "author": "Nice_Presentation327",
                "score": 12
            },
            {
                "body": "The big problem with tracker and cookie popups is that they're required by laws written by people who have no idea how the internet or usability works. Both of those things should be tied to a UI built into our web browsers, rather than leaving it to every site on earth to implement their own (usually shitty - often deliberately so) version in their site templates.\n\nWe *should* be able to go into our browser settings and check the \"allow mandatory cookies\" box and uncheck the \"allow predatory data-mining\" box and never have to think about it again. But the people writing the laws never bothered to check with anyone who would be able to tell them how best to implement such things, and now everyone is treated to a great big pile of shit on every site they visit.",
                "author": "BevansDesign",
                "score": 11
            },
            {
                "body": "A lot of designs are business first, consumer second.",
                "author": null,
                "score": 11
            },
            {
                "body": "I would hate that website that constantly interrupts whatever experience I came for. Would probably ditch it and shop or get news elsewhere. A bottom bar with options only triggered by user intention would be better. It would prevent dominating the visual space and the user could choose the interaction,thus being actually engaged with it rather than forced into interaction with a negative action (closing window).",
                "author": "crowwizard",
                "score": 11
            },
            {
                "body": "Website and store owners just want to make money. \n\nBut, it is important to adjust the timing of the items (pop-ups) so they won‘t show up all at once - this can have a negative impact on the site, i.e. bounce rate and speed. \nThat is the developer‘s fault if all items fire at the same time.\n\nCookie should go first, then after 50% scroll or 15s maybe a promo pop-up.",
                "author": null,
                "score": 9
            },
            {
                "body": "Websites should just respect the browser’s built-in “do not track” option. If you already “told them” you don’t want to be tracked, there’s no reason for them to ask again.\n\nAlso, denying non-functional cookies should be as easy (1 obvious click) as accepting is. The GDPR requires this, yet most sites don’t respect it.",
                "author": "Lence",
                "score": 7
            },
            {
                "body": "Beep boop",
                "author": "tenemu",
                "score": 7
            },
            {
                "body": "You're right. I complain a lot, but at least ads just annoy me now instead of auto-downloading malware. The internet used to be a minefield.",
                "author": null,
                "score": 6
            },
            {
                "body": "It is better, mainly because of the shorter load times, improved search engines and safer browsers.  \n  \nBut there are far more annoying elements nowadays compared to twenty years ago. Like cookie banners, newsletter popups, text introductions written for search engines that waste your time, the need to click buttons to see the next paragraph, talkative chat boxes,  full width out of context images and ads interrupting your text, dialogs to promote an app instead of the website, a popup to allow notifications, paywalls et cetera.",
                "author": "RamBamTyfus",
                "score": 6
            },
            {
                "body": "That's usually if you pick \"no functional cookies\", which is beyond stopping tracking and just denying all cookies.",
                "author": "FredFredrickson",
                "score": 6
            },
            {
                "body": "I'm in Europe and most websites give a checklist and go as far as giving a reject all button.",
                "author": "pimples_eyebrows",
                "score": 6
            },
            {
                "body": "I'm the same way. I only use Serious Eats, King Arthur, and Reddit for my recipes now. It's a shame. I know I'm missing out on some great recipes out there but even with adblockers, these sites are too annoying to look at on mobile, especially while in the middle of cooking/baking.\n\nThere's a push for indie web and to get away from Reddit, Facebook, etc. but it's never going to happen when things are like this. No point in exploring independent websites if 80% of the content is SEO filler and the good parts are too hard to read",
                "author": "ptsjk",
                "score": 5
            },
            {
                "body": "I would agree on news site, I noticed it too.\n\n On cookie banner its a compliance thing, as people are covering their bases in order to avoid to get sued. \n\nHowever there are still well designed website out there but these are not popular ones. Also as someone who makes website for a living, very few people appreciate a good designed website, there are people who appreciate them  its just like clothes how many times do you see people wear atrocious clothes and they dont care at all but there is always some who wears well designed, well fitted clothes,",
                "author": "Hour_Palpitation_428",
                "score": 4
            },
            {
                "body": "Yeah that behavior is annoying AF too; bad UX. It’s all bad nowadays.",
                "author": null,
                "score": 4
            },
            {
                "body": "Thos is how it felt... https://youtu.be/CXFF8Hm6XBo",
                "author": null,
                "score": 4
            },
            {
                "body": "Everything is terrible always and getting worse 🤷🏻‍♀️",
                "author": "jackjackj8ck",
                "score": 3
            },
            {
                "body": "Check out No Chatbot. It’s a chrome extension.",
                "author": "JefeBezos",
                "score": 3
            },
            {
                "body": "I hate it too, the ex-colleagues in the agencies I've worked in have mostly hated it too, but they still encourage clients to add it into the package because they can charge an additional few thousand dollars just to activate the simple plugin.",
                "author": null,
                "score": 3
            },
            {
                "body": "There is a special place in hell for the jerk who designed \"the unfindable pop-over micro-close-button\".",
                "author": "dug99",
                "score": 3
            },
            {
                "body": "I'm pretty sure the people who wrote the cookie law barely understood the subject.",
                "author": "cinnewyn",
                "score": 3
            },
            {
                "body": "I agree, all it does is force us back into apps, which isn’t great. I feel like the days where you could freely explore the web and have fun are over. \n\nIt’s not quite true because on the computer things aren’t so bad… but I cannot for the life of me remember when was the last time I surfed the web on my personal computer. Outside of work, I don’t use computers anymore. It’s crazy when you think about it.",
                "author": "doggo_luv",
                "score": 3
            },
            {
                "body": "While some websites do this:  \n\n\n[https://i.imgur.com/vcvQhXH.png](https://i.imgur.com/vcvQhXH.png)  \n\n\nNote which button is the most prominent and what's written under it ...",
                "author": "phantomeye",
                "score": 3
            },
            {
                "body": "\"[https://assets.justinmind.com/wp-content/webp-express/webp-images/uploads/2018/06/web-cookies-user-experience-justinmind-footer.png.webp](https://assets.justinmind.com/wp-content/webp-express/webp-images/uploads/2018/06/web-cookies-user-experience-justinmind-footer.png.webp)\"\n\nThe goal is OFFERRED not FORCED and respecting the user's time and agency.\n\nI would do absolute banner aligned to the bottom, 30% as cookie message with clear, non-manipulative options (Required only / Manage Preferences rather than Learn More / Accept All). Nothing that could be seen as a dark pattern. The next 30% to 50% could be an text offer or small image in a way that doesn't force itself on the user. Clicks on that will already have an intentioned interaction but can be ignored by people that don't want to engage with it. The right can be a chat icon or help icon. I wouldn't do any kind of pop up or modal. Let people choose the option but ignore it if they don't want to engage with that.",
                "author": "crowwizard",
                "score": 3
            },
            {
                "body": "Yeah usually. Some sites don't have all the extra options though (or you have to go through multiple pages of options, which is wild).\n\nIt's pretty rare but there's been a couple sites I've seen that just list out every single cookie with a checkbox.",
                "author": "saltr",
                "score": 3
            },
            {
                "body": "What are websites for? It's a question we all have to struggle with. If a website is only worth the number of conversions it generates then I think these patterns probably help move that needle. And generally A/B tests will prove that more people sign up for a newsletter if you use a popup than if you don't.\n\nThat being said - I agree with you, but I am not my stakeholders. And my stakeholders can generally only align on DemandGen related goals because they have concrete measurable KPI's. It doesn't mean it's the right way to do things or that we are building a better internet. It just means that most of us are beholden to numbers which our superiors believe denote success or failure. \n\nOnly way to push back is to build sites that convert based on trust and proper funnel design and that is much harder and rarer.",
                "author": "abeuscher",
                "score": 2
            },
            {
                "body": "YES! The Gap's website is just like this and I would rather drive an hour to the outlet mall in place of shopping their site.\n\nAnd those auto play videos. It's like they hired marketing people to direct the web folks to make the heaviest laggiest sites that piss off the most people.\n\n/rant over",
                "author": "nerdKween",
                "score": 2
            },
            {
                "body": "These things have been around for a while, and it's a sign you're in a seedy area.\n\nCTAs are just a fundamental part of web design. But yes, a lot of the more spammy ads will camouflage themselves as CTAs of the website itself.\n\nCookie banners are relatively new.\n\nWith everyone worried about online privacy, California passed a law making it so websites had to notify you and ask you to agree to using cookies on their site, if they use cookies. Thing is, basically every website uses cookies. The law had good intention, but all it really did was make everyone deal with an annoying pop-up each time they go to a new site.\n\nChatbots are also annoying IMO, but I usually only see them in contexts where they're relevant. Eg. When I'm looking through subscription options from some ISP, or other contexts where I might actually want to talk to a representative for a minute.\n\nExtensions: I'm not sure what you mean by this. Extensions could be a lot of different things.\n\nTLDR: spam isn't new. That California law had a pretty annoying outcome for the web with the cookie notification, but it's the only thing here I see broadly affecting the web as a whole.",
                "author": "ThunderySleep",
                "score": 2
            },
            {
                "body": "As nostalgic as I am about the early 2000s internet because of childhood, I have to remember the not one but TWO drawings I recently found, probably done when I was around 7, depicting how much I *HATED* the popups on the arcade-game websites I'd go on.",
                "author": "theowlsfavoritejoke",
                "score": 2
            },
            {
                "body": "I hate it when the chatbot(or whatever floating action button) blocks the ui of a video player.",
                "author": "saintshing",
                "score": 2
            },
            {
                "body": "I have to say, in the past week I had the chat bots help. \n\nOnce to get a new credit card sent to me by chase. Their website didn’t have a FAQ or link that I could see to get one. \n\nAnd for business, I wasn’t getting a response from customer support or sales via email. The chat bot connected me to my local rep and he responded instantly.",
                "author": "tenemu",
                "score": 2
            },
            {
                "body": "At the risk of sounding like an Ad, but I was a lot of the same. I'd recommend the app \"Whisk\" it allows people to add and recommend recipes. Breaks down ingredients without taking you to a site and more often than not, pulls the method from the site too as so to avoid all the ads and the fluff. If it doesn't do that. It's a direct link to the recipe itself within the app, and it tends to avoid a lot of the crap.",
                "author": "rage-quit",
                "score": 2
            },
            {
                "body": "What are you building your sites on? Unless it’s straight html css you’re likely saving cookies by using a cms.",
                "author": "makingtacosrightnow",
                "score": 2
            },
            {
                "body": "I like this idea! I am redesigning my site at the moment and if I understand this correctly, I would simply add a row above the footer somewhere where the visitor would find all of these items and make the choice as to whether or not they want to subscribe or get an extra 10% off or whatever \n\nI am trying to put the customer experience first in all aspects\n(Any live site examples would be appreciated) \n\nThanks,",
                "author": "DigitalNomaddd",
                "score": 2
            },
            {
                "body": "The Cookie laws also apply to localstorage",
                "author": "Taskenspiller",
                "score": 2
            },
            {
                "body": "It's kind of always been this way.",
                "author": "benabus",
                "score": 1
            },
            {
                "body": "It's the dilemma between being pretty and trying to convert users to sales",
                "author": "Jb31129999",
                "score": 1
            },
            {
                "body": "Has anyone noticed? Lol",
                "author": "mrcoy",
                "score": 1
            },
            {
                "body": "I agree. The web is broken. It’s all about popups and the possibility to do something that looks like an agreement or spending money….",
                "author": "koekieNL",
                "score": 1
            },
            {
                "body": "I think if anyone could fix this, it would be Google. They’ve already started to incorporate core web vitals into their algorithms to penalize websites with bad user experiences (cumulative layout shift, largest contentful paint, first input delay).\n\nSEO is like crack to these spammy websites, and if they got dinged for bad experiences they would clean up their act.\n\nAds won’t go away though, that’s how Google makes all their money.",
                "author": "white__cyclosa",
                "score": 1
            },
            {
                "body": "Yea I don’t do those and I always recommend against them from an audience perspective.\n\nThere’s better ways to put out those hooks you know - and I don’t think I’m alone in saying that excessive pop-ups will definitely cause me to click off the website",
                "author": null,
                "score": 1
            },
            {
                "body": "Honest answer? Marketers had to justify their cost and some of it *does* work. It's generally slapping crap on top of crap, and when one thing hits...claim victory.\n\nIt'll go back down in the future; user tolerance is very low for this, and UI/UX people keep warning about it, FYI.",
                "author": "alex-redacted",
                "score": 1
            },
            {
                "body": "Throw in the alert at the top \"so and so website would like to send you notifications\", um no.",
                "author": "TearsOfChildren",
                "score": 1
            },
            {
                "body": "Dont forget the \"allow notifications\" popup! Seriously, Who uses this? Who wants your browser to send desktop notifications?",
                "author": "PixelCharlie",
                "score": 1
            },
            {
                "body": "people vote with there attention, so bad experience, is no return visits or you really have to have good unique experience or monopoly",
                "author": "leshuis",
                "score": 1
            },
            {
                "body": "https://how-i-experience-web-today.com/",
                "author": "taimoorhybrid",
                "score": 1
            },
            {
                "body": "I agree, especially e-commerce sites. I don’t want it popping up in my face, I want a simple landing page with the primary CTA and the discount shown at checkout.",
                "author": "hello_erica",
                "score": 1
            },
            {
                "body": "popups are hell",
                "author": "CevicheCabbage",
                "score": 1
            },
            {
                "body": "Lol How about when they use that add pop up before you can read the content on the page xD",
                "author": "Succotash-14",
                "score": 1
            },
            {
                "body": "Recipes...  Between the minefield of trying to find content and my saved urls going dead, I finally just made a site on my domain with my recipes. No BS, just a simple react app feeding from a json file of transcribed recipes (with a link to the original, though the site is intended for personal use). I just got sick of that fight",
                "author": "mousemke",
                "score": 1
            },
            {
                "body": "When they have a ‘jump to recipe’ button at the top …. Gets me in the feels… if they offer metric and old tyme measurements I begin to fall in love.",
                "author": "Unplannedroute",
                "score": 1
            },
            {
                "body": "The thing I find hilarious about the cookie pop-up is that if they are implemented correctly then rejecting cookies will just make the pop-up appear every single time, and so now the user has to keep dismissing it or end up using an extension to get rid of automatically anyway.\n\nThere's tons of sites that don't actually respect that, though. They use a cookie to check whether you accepted or rejected the cookie prompt, which is literally contradicting the entire prompt to begin with.\n\nThe whole concept was poorly implemented. Privacy concerns be damned given that websites can now use other methods to track you anyway.\n\nThe cookie prompt has just become another way for shady organisations and individuals to use more dark patterns.",
                "author": "MrTastix",
                "score": 1
            },
            {
                "body": "This is the equivalent to late 90s-early 2000s popups, and have the same effect.",
                "author": null,
                "score": 1
            },
            {
                "body": "Jesus Christ I’m in the wrong business",
                "author": "CobaltNeural9",
                "score": 1
            },
            {
                "body": "Oh yeah, and those damn floating social media buttons while we’re at it!",
                "author": "fritzbitz",
                "score": 1
            },
            {
                "body": "What do you use to persist the user's login state so they dont have to relogin everytime they refresh the page? Local storage?",
                "author": "saintshing",
                "score": 1
            },
            {
                "body": "Yes. I know.",
                "author": "alex-redacted",
                "score": 1
            },
            {
                "body": "Why not store that information in cache as opposed to a cookie?",
                "author": "OpenRole",
                "score": 1
            },
            {
                "body": "Processwire. It sets one sessions cookie, which is allowed by GDPR rules without a notice.",
                "author": "jonassalen",
                "score": 1
            },
            {
                "body": "I mostly build small campaign websites for short term marketing campaigns. They don't require login functionality.",
                "author": "jonassalen",
                "score": 1
            },
            {
                "body": "Is that really not allowed without consent?",
                "author": "bregottextrasaltat",
                "score": 1
            },
            {
                "body": "Thanks for sharing!",
                "author": "DigitalNomaddd",
                "score": 1
            },
            {
                "body": "most, but not all:  \n\n\nhttps://i.imgur.com/vcvQhXH.png",
                "author": "phantomeye",
                "score": 1
            },
            {
                "body": "I never said all",
                "author": "pimples_eyebrows",
                "score": 1
            },
            {
                "body": "oh, I wasn't disagreeing with, just wanted to show an example of a dark pattern some sites are using.",
                "author": "phantomeye",
                "score": 1
            },
            {
                "body": "Clicking these things away isn't making websites unusable - it just makes them annoying. And while most of them are ugly, I certainly don't think that web design itself is \"ruined\" by these things.\n\nI just stop visiting websites that have too many such distractions. You should too.",
                "author": "FredFredrickson",
                "score": 0
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1757427552.0,
        "title": "How do you guys handle privacy notices & cookie banners for US/EU clients?",
        "author": "Apprehensive-Leg8938",
        "id": "1nck7al",
        "selftext": "I’ve been curious about this while working with clients abroad. When you build websites for US/EU businesses, do you usually:\n\t•\tWrite your own privacy notices and cookie policies?\n\t•\tUse a generator tool?\n\t•\tLet the client handle it?\n\nI see a lot of debate around GDPR/CCPA, consent banners, etc., but not much clarity on what’s common practice in web design agencies. Do most clients even ask for it, or is it something you provide proactively?\n\nWould love to hear how different freelancers/agencies approach this part of a project.",
        "score": 12,
        "url": "https://www.reddit.com/r/web_design/comments/1nck7al/how_do_you_guys_handle_privacy_notices_cookie/",
        "num_comments": 16,
        "comments": [
            {
                "body": "Use a generator tool. Writing your own privacy notices and cookie policies is a bad idea. \n\nTermageddon is great for US clients. For cookie banners I use Cookiebot.",
                "author": "vhwebdesign",
                "score": 8
            },
            {
                "body": "I use an analytics tool that is in full compliance where you don't need those banners :)",
                "author": "VexingPanda",
                "score": 7
            },
            {
                "body": "I don't need to have a cookie banner, because my websites don't use cookies. \n\n\nIf clients need statistics, I provide them with a privacy-compliant Matomo.",
                "author": "jonassalen",
                "score": 4
            },
            {
                "body": "Makes sense. Not sure if this is helpful but virtually every US based agency I know or work with uses Termageddon for their clients’ privacy notices and cookie policies.",
                "author": "vhwebdesign",
                "score": 4
            },
            {
                "body": "I use complianz on multiple sites. I have EU and US customer.",
                "author": "Ultra918",
                "score": 3
            },
            {
                "body": "Generator. But I tend to avoid anything that forces me to implement a cookie banner sinply becsuse people are so fed up with them that you are standing out if you dont have any cookies.",
                "author": "schussfreude",
                "score": 2
            },
            {
                "body": "I (germany) use erecht24 \"impressum\" generator (imprint) for most of my pages and since this year real cookie banner free (because it also can block youtube and google maps without additional plugins) and sometimes for some smaller additional sections i just use chatgpt or claude",
                "author": "coscib",
                "score": 2
            },
            {
                "body": "I don't use tracking cookies and 3rd party cookies so I don't have to annoy the visitor with an annoying cookie banner.",
                "author": "aleqqqs",
                "score": 2
            },
            {
                "body": "I've been using Termaggedon for about 3 years now. They are very responsive and have a generous reseller program.",
                "author": "gfalken",
                "score": 2
            },
            {
                "body": "Not a freelancer or agency, but we use OneTrust/CookiePro",
                "author": "Lord_Xenu",
                "score": 1
            },
            {
                "body": "I use Sirdata",
                "author": "kardoken",
                "score": 1
            },
            {
                "body": "Usually clients handle policies, while agencies use tools like **Ketch** or banner generators for GDPR/CCPA compliance.",
                "author": "Expert-Recording-187",
                "score": 1
            },
            {
                "body": "Most freelancers and agencies don’t write policies themselves, it’s too much legal risk. Common practice is: flag the need, then either use a generator tool or push it back to the client’s legal team.\n\nFor EU work, GDPR banners and consent management are expected, so tools like Cookiebot, OneTrust, or free plugins (depending on site size/budget) get dropped in. In the US, it’s a bit looser, usually a privacy notice and a “basic” cookie banner if the client wants to look compliant.\n\nSo the usual flow is: agency sets up the technical piece (banner, link in footer, plugin integration), client provides or approves the actual wording. That way you cover compliance without accidentally becoming their lawyer.",
                "author": "Cgards11",
                "score": 1
            },
            {
                "body": "I've been self-hosting umami analytics on a Pi for a few years. I run a lot of projects that use it.. saves me a ton even vs the umami cloud.",
                "author": "flooronthefour",
                "score": 1
            },
            {
                "body": "For this reason, I only use cookie banners that are located at the bottom of the website and not displayed directly as popups/overlays on my pages. Because I like to use Google Analytics on my pages to get some statistics, but also sometimes integrate YouTube videos or Google Maps, I now use the Real Cookie Banner plugin because I can then cover everything with one banner.",
                "author": "coscib",
                "score": 1
            },
            {
                "body": "Thanks",
                "author": "Apprehensive-Leg8938",
                "score": 0
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": -1
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1731631438.0,
        "title": "European accessibility act - the next thing that costs time and money, when many clients don't care",
        "author": "marcos987",
        "id": "1grk1fb",
        "selftext": "I am a bit frustrated about some things, so here it comes\n\nThere is a difference whether I client comes to you and says I need a website that is accessible, responsive, secure, passing web core vitals, optimized for search engines, with professional converting copy, consistent layout, global styles for better scalability, setup tracking, correct implementation of consent management and content blockers, etc. VS a client that comes to you because they need a website\n\nThe first client understands that there are many parts to take care of and that those cost time (on both ends) and money. The second client does not understand that. So I am the bad guy who must inform the client about this all and every single piece raises the price, requires also more time from the client. But the client actually just wanted a website and not an over-engineered rocket.\n\nHow are you dealing with that? It's not fun anymore unfortunately",
        "score": 0,
        "url": "https://www.reddit.com/r/web_design/comments/1grk1fb/european_accessibility_act_the_next_thing_that/",
        "num_comments": 34,
        "comments": [
            {
                "body": "The law specifically exempts businesses that employ less than 10 people with a turnover of under 2 million euro a year. If your client exceeds these requirements, it's likely they do not fall into the \"just make me a website\" category. \n\nFurthermore, is this not just a direct copy of the ADA? A law that you must comply with regardless if operating in the US or risk lawsuits? I fail to see the problem here.",
                "author": "eroticfalafel",
                "score": 15
            },
            {
                "body": "obtainable books languid unique dog quickest spoon sheet aware squeeze\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                "author": "jonassalen",
                "score": 10
            },
            {
                "body": "None of this makes sense. You're not the \"bad guy\" for giving clients a product that is fit for purpose and legally compliant. You're also not the \"bad guy\" for setting realistic prices that give the client a better outcome overall. Clients don't inherently know what or why things are necessary, but they also don't know shit about web development. Getting them to understand is your job as a developer.\n\nWhile 10 employees does not seem like a lot, a company employing 10 or more people is likely to be interested in having a website that is accessible for the customers, since statistically 20% of their users will benefit from this change. \n\nAnd finally, making a website accessible is not some herculean task lol. Html makes your life pretty damn easy, and any competent ui library will also meet ADA standards, which is no less stringent that what's being proposed here.",
                "author": "eroticfalafel",
                "score": 6
            },
            {
                "body": "[removed]",
                "author": null,
                "score": 4
            },
            {
                "body": "From your responses it feels like  “solving problems” isn’t for you. Web design isn’t about throwing some template on a framework. \n\nIt’s about solving the needs of your client’s customers who will access the website. They surely will have customers who need good accessibility options. They will have complex requirements that go beyond a landing page. Guidelines are there exactly to stop people like you from publishing sub par websites. \n\nUnderstand that web design is about creating a new communications channel for your clients. They have no idea how to go about it. You are / will be / need to be the expert to tell them what’s right. For some of your clients, that will be the only communication channel!\n\nIf you just want to “code” then join a company as a junior dev. Where you don’t question the homework that comes your way.",
                "author": "gob_magic",
                "score": 4
            },
            {
                "body": "Oh no. You have to make a website accessible. The horror.",
                "author": null,
                "score": 4
            },
            {
                "body": "If making a website accessible has this much of an impact on your process... you're making websites wrong.",
                "author": "zreese",
                "score": 4
            },
            {
                "body": "stupendous chunky nine gaping rob tease worm quaint bright sleep\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                "author": "jonassalen",
                "score": 3
            },
            {
                "body": "it's hard to change your habits but when you get a grip of it you'll start creating designs and websites that are accessible from the start, not as an addition.\n\nYou will need to learn and grow your whole life in this field and this is basically the basics I'd say. Or at least should be in a good web design imo.\n\nproper hierarchy and semantics, colour / contrast, text size, alt text\n\nMaybe something else but I think these are the most important aspects that you should start thinking about from the very begining. The web structure and different Frameworks / tools or established systems often make it even easier, stuff is just working on its own if you do it the right way.",
                "author": "Kir4_",
                "score": 3
            },
            {
                "body": "From your post it seems that you don't understand accessibility. When you design and develop with accessibility in mind it doesn't make things harder to do and doesn't add any overengineering. You spend more time on accessibility only if your design is fucked up from the start, or if you try to add accessibility later.\n\n\nAlso, if you don't make everything accessible by default, it's a _you_ problem, not client problem.",
                "author": "ezhikov",
                "score": 2
            },
            {
                "body": "It was clear that those comments will come in. To let you know, I am pretty down because of many other things that are overwhelming, and there is just yet the next thing coming. Just go on bashing if it makes you feel better. \n\nThe websites I build are probably accessible in many ways just because of how I work and implement things. But I know that there are tester tools and I know you can spend endless of hours on it (who pays for that)",
                "author": "marcos987",
                "score": 2
            },
            {
                "body": "I got it already that this is the overall position in here on Reddit. I disagree with \"websites is not for you\" just because of what I am pointing at. \n\nWhen things get more complicated, take longer, require more testing, and so forth ... someone needs to pay for it in the end. Not everyone will like that. If redditors dissagee with this so be it. I think my question is fair, if more and more rules are coming (even though the implementation does improve the web for people) I need to ask where it ends, who pays for it, or if budget websites will simply going extinct.\n\nMaybe we'll soon have mandatory CDN, but then we should not forget GDPR when using a CDN. What about mandatory fluid typography. Mandatory version in simple language like we know it from some news websites. What about mandatory dark mode?\n\nI simply wonder how to deal with it when more things have to be implemented. How to keep the price?\n\nIf it is not clear, I am not just blaming the system, but also I am actually asking for help and for answers besides  \"websites is not for you\"",
                "author": "marcos987",
                "score": 2
            },
            {
                "body": "What makes you think AI can't handle accessibility guidelines?",
                "author": "Alexandur",
                "score": 2
            },
            {
                "body": "OK. I tried to show my view, I do understand your view. It seems you have no understanding for my view and situation at all, then let's just keep it that way",
                "author": "marcos987",
                "score": 2
            },
            {
                "body": "Bit late on the reply to this, but you can absolutely get public liability insurance as a sole contractor, and if you're regularly working with clients in countries with a higher regulatory burden (USA, EU in this case), it's absolutely worth the money.",
                "author": "eroticfalafel",
                "score": 2
            },
            {
                "body": "This is just a professional responsibility, it does not really matter if you don't like it.  It does not matter if a contractor does not like installing handrails on stairways.  If they are building stairs, as a matter of professional responsibility, they must also install handrails. Same here.\n\nIf you don't like balancing requirements, making websites is not for you.",
                "author": "_listless",
                "score": 1
            },
            {
                "body": "@ burden  \nI can't make the very best perfect fully accessible site, 1000% secure, highly performant, super scalable, etc when the budget is not there. Many business are in a crises, it's not the most simple years for many, so what to do? Should I work 22 hours instead of 17 hours every day to get it in all for free?\n\nI can understand that this message triggers you more than others, but we all should try to see it from different angles\n\n@ cut out for web  \nIt's not about that. I am completely fine with it if it becomes normal and I get paid for it. If the client wants it, understands it, and accepts that there might be additional effort involved (pay). But as of now (for my client base) it means either I do it for free or ignore it. I also want to add, I am sure once I read up on everything I'll learn that my websites are to a high extent already accessible. Of course I take care about colors, I use REM instead of PX, I often but not always use clamp functions, I leave enough spaces, I also test keyboard navigation, I use page builders and forms that take care about aria labels or allow at least to control it, I label the fields on forms even though a placeholder only is often more aestetic. I take care about file names but not to the very last details, and at least I auto generate the alt text from the file name for images. I take care often but not always that the DOM order is correct, e.g. showing the heading before the image in the DOM, even though it's displayed the other way round in the DIV.\n\nIt's a difference if I can make something, or suddenly have to do it. Because this triggers me. If I get 10% or 20% more revenue because of it - fine. But if I have more work, more to consider, more troubleshooting, more communication, more problems, without any additional pay then it's a problem for me\n\nAnd as of now, my clients don't care unfortunately, and I don't want that they get the feeling that I want to \"sell\" them something just to make more money",
                "author": "marcos987",
                "score": 1
            },
            {
                "body": "I solve problems every single day, I troubleshoot, I help plugin and SaaS developers a lot, I go the extra miles every time, but exactly that is also massively taken away energy and time (if you do it for years it's just frustrating unfortunately, bringing me into this situation that I complain and ask for help on Reddit). At some point I ask myself, when will it be enough? And then, bam... next thing thrown in my face.\n\nMaybe people in here all build only websites for 20k or 30k .. but what about the smaller projects of 4k to 6k. Let's not forget depending on the country you are in (tax, social insurance) and the costs for tools, that means 2k to 3k of actual revenue.\n\nI am already very knowledgeable in many things but somewhere I must draw the line. Now I must also be an accessibility expert, stay on top of all the latest regulations, toolset, implementation methods, etc.\n\nIt's just a bit of a cry for help in here as I am just not sure anymore if I can handle it in the long run.\n\nMaybe in reality it will not be a big change for me (maybe I do anyway already 80%+ the correct way, I don't know yet as I didn't study hours, days, weeks, months what it actually means",
                "author": "marcos987",
                "score": 1
            },
            {
                "body": "[removed]",
                "author": null,
                "score": 1
            },
            {
                "body": ">...overall position in here on Reddit.\n\nAccessibility is not just some opinion that's popular on reddit, it's an industry standard that professionals account for. \n\nThere is a hard distinction between what's required for accessibility and all of the features you just mentioned.\n\n* CDN: *not required to meet WCAG 2.0AA*\n* Fluid type: *not required to meet WCAG 2.0AA*\n* Text Summaries: *not required to meet WCAG 2.0AA*\n* Dark Mode: *not required to meet WCAG 2.0AA*\n\nIf a client wants all of this, great! Those are all extra features that you can upcharge for.  These above are all different than table-stakes accessibility stuff like:\n\n* Semantic HTML\n* Legible font-sizes\n* Sufficient color contrast\n* Progressive Enhancement\n* Alt text for images\n* Not baking text into images",
                "author": "_listless",
                "score": 1
            },
            {
                "body": ">And finally, making a website accessible is not some herculean task lol. Html makes your life pretty damn easy, and any competent ui library will also meet ADA standards, which is no less stringent that what's being proposed here.\n\nI agree, but there are many WordPress websites out there where the HTML is not that simple and themes where accessibility is not guaranteed at all, nor is it fast to make them accessibility compliant. Not to mention all the third party plugins.\n\nI have inherited a client's website I am afraid is in that situation and I'm not sure if this would mean rebuilding the entire website\n\nEDIT: I want to make clear, I completely support accessibility and I always do my best to make sure my websites are accessible. However I am afraid what could happen if my client gets a fine because I forgot some aria-label or did a non sufficient color contrast, and I could get involved in a lawsuit. I'm not even sure this can happen but this is scary stuff for a freelancer trying to start a little business",
                "author": "sblanzio",
                "score": 1
            },
            {
                "body": "\\> proper hierarchy and semantics, colour / contrast, text size, alt text\n\nI do that anyways, it's the default way to build a website for me .... so it could be that the real impact is not even that big on me. I don't know yet, but dealing with what feels like bureaucracy is already the first thing that turns me off big times",
                "author": "marcos987",
                "score": 1
            },
            {
                "body": "I didn't study what all is included in this act - maybe I am totaly fine already in how I build it. I hate reading legal topics",
                "author": "marcos987",
                "score": 1
            },
            {
                "body": "I understand that part, but my concerns and topics are completely left out. My other examples are not about accessibility, but simply other general examples to point out that there can be so much more that for different reasons might be mandatory .. and then what.\n\nWhat you mentioned is what every basic website I build comes with anyways. It's not that I use orange text color on yellow background, 12px as graphic instead of text ... overall with my post I was only concerned (and frustrated) that more things come up (more tasks, more time, but not more appreciation, not more income because of it). \n\nNow I know, I am the only person having those thought. Okay.",
                "author": "marcos987",
                "score": 1
            },
            {
                "body": "For one, because accessibility is quite contextual, just as user experience is. Alt text depends on the intention behind the image. Whether you show or hide an option from screenreaders completely depends on the journey. \n\nSecondly, because automated accessibility testing is incomplete. It's important to test manually to catch the nuances and qualitative details that aren't easy to programmatically check\n\nIf, and big if, the AI is using standards documentation and  generating the correct HTML tags in every situation, then it will be accessible to a point. But you will still need an experienced designer to step in and fix all the issues.\n\nIf however the AI is generating based on scraping other websites as training material, then chances are it would take longer to fix the accessibility than it would to write from scratch.",
                "author": "ed_menac",
                "score": 1
            },
            {
                "body": "Accessibility is bullshit.\n\n\nIt's so boring and takes all the fun and the frontier spirit out of the web.\n\n\nAlso, as more and more time is spent on *accessibility*, companies seem to have been given a free ticket to build websites with less and less *usability*. The mobile web experience is almost unbearable-  a barrage of cookie popups, ads, spammy content and malicious calls to action. Reddit alone harasses you if you so much as *dare* browse in your mobile browser rather than their scummy app. Plus, it's a simple discussion forum that takes seventeen clicks to navigate any one discussion thread. But oh, hoorah, at least blind people can enjoy this wonderful experience too!\n\n\nReally. Just fuck that noise. I really don't wanna live in a world where every website looks like the UK gov website. But I'm surrounded by psychopaths who do.\n\n\n... Alright. Let me tank some of those downvotes for you, bro!",
                "author": "textzenith",
                "score": 1
            },
            {
                "body": "Well then I don't think there's too much to worry about! Although I still get it can be overwhelming at first.\n\nI get it but we need guidelines here, for better or worse. In real world it's easy to understand or imagine accessibility issues in my opinion, for example stairs without a ramp, but on the web I think the thought gets lost because its non physical. So people either forget or just don't know / think to learn about it.\n\nFrom my personal experience, my aunt had to stop supporting a certain charity because they changed their design and the colours and contrast was so bad for her she just could not navigate it with her sight issues. \n\nThese are people we don't think much about but I think keeping web accessible is the fundamental of what The Internet is meant to be.",
                "author": "Kir4_",
                "score": 1
            },
            {
                "body": "In the end I also want to develop projects that makes sense for the client. When new rules increase complexity, effort, compatibility, testing, etc. I can't do it for free to a full extent. Where would it end. \n\nIf the client understands this, then it's all fine. Then it becomes the new normal. If I must convince the client and sell it to them and leave the impression that I just want to add it to make more money, then it's an issue for me. \n\nIn the end, whatever it is, when there are more and more things to do and take care of, it takes more time, at some point it'll get more expensive. I give away a lot for free already. If that is fine for everyone so be it. But I doubt that all clients can understand it, because most clients don't like \"more expensive\"\n\nYou could say, it should not become more expensive anyways as it should be proper web development process. But again, where does it end.",
                "author": "marcos987",
                "score": 1
            },
            {
                "body": "I think the issue is these are not new rules, these are basic fundamentals of web design.\n\nFollowing basic A11Y guidelines is really none of what you mentioned in my opinion. Apart from just learning and applying them properly. The guidelines are pretty clear, it's not an ever ending list.\n\nLike if you're a car mechanic and suddenly you realize you've been doing something wrong, but charge the same as other mechanics who do everything by the book, its on you to learn the proper way and I don't think suddenly doing it the right way is an excuse for a price increase just because.\n\nPrice yourself well but in my opinion accessibility is not an option to include or not for some extra charge. It's just something you do.\n\nThe act has been a thing since 2019, accessibility has been a topic since the begining of the internet. The guidelines, acts and all are trying to talk about everything for every case, in majority of cases making websites you'll follow the same guidelines over and over again. With most stuff being handled automatically if your code is good. (keyboard navigation, screen reader support, being able to enlarge the text etc).\n\nhttps://developer.mozilla.org/en-US/docs/Web/Accessibility/Understanding_WCAG",
                "author": "Kir4_",
                "score": 1
            },
            {
                "body": "I think I have less problems with learning things, but big issues with the need to justify what I am doing. Justifying why things become more and more complicated. Probably also surrounded by too many people that trigger that in me. Defending myself why this and that should be done (and costs suddenly more time) is very tiresome. It just takes out the fun part of the actual work. Especially if everyone around you tells you it's all \"easy\"\n\nWeb design and development is not rocket science. In a way everyone could do it. And exactly this is what makes it often so difficult. The accessibility act is for me probably only the one additional thing that feels too much.\n\nFrom what I hear from clients, partners and collaborators everyone wants simple, fast, as affordable as possible. But with every additional layer of competency and regulation I am getting farther away from those three. I become complicated, slow, and expensive (or I don't charge for many things I do and burn out) - to the outsider the website looks hardly better though than before where I was simpler, faster, cheaper",
                "author": "marcos987",
                "score": -1
            },
            {
                "body": "I think I should add where I come from and why I have worries about this.\n\nThe more I learn, the more it makes things difficult in my life. When I start to learn more about all the accessibility topics, then this is yet another layer on each website project. There is more and more steps and checks involved (that cost time to stay on top of it, and time to implement, and time to follow-up after updates, etc.)\n\nIn generall it could be that I anyway use already a toolset and build websites in a way that they fulfill many of the accessibility requirements. I just didn't jump on that topic yet. I am simply in a way afraid that it kills me. There is always more, and I am overwhelmed by it.\n\nOn the other hand, people are probably building websites with shiny new AI tools and become faster. I on the other hand become slower and slower the more I learn as there is suddenly more to consider - and accessibility could be just the next thing (besides many other things)",
                "author": "marcos987",
                "score": -5
            },
            {
                "body": "My personal problem is that with websites there are more and more things where I am the bad guy. Clients don't request those things. I am the one who must tell them why costs go up (in their eyes unreasonably). 10 employees isn't a lot. I imagine a plumper with a secretary and a few workers .. not sure if they can follow here.\n\nI myself question if additional effort and costs are justified for smaller businesses (to be honest, I can't estimate the actual impact of this yet and estimate what it means for real projects .. not ready yet to study all of that)",
                "author": "marcos987",
                "score": -16
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1726689389.0,
        "title": "I need some help with my code.",
        "author": "Dante_fromdmc3",
        "id": "1fk1zpp",
        "selftext": "This is my code  \nSo, basically the problem is that the code is not working correctly, especially the part with the shopping cart and order tracking. The shopping cart part gives an error message, and the order tracking part simply doesn't work.\n\n    <!DOCTYPE html>\n    <html lang=\"pt-br\">\n    <head>\n        <meta charset=\"UTF-8\">\n        <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n        <title>Loja de Calçados Femininos</title>\n        <style>\n            :root {\n                --main-color: #b31217;\n                --hover-color: #ff4040;\n                --text-color: #333;\n                --background-color: #fff;\n            }\n    \n            body {\n                font-family: 'Segoe UI', Tahoma, Geneva, Verdana, sans-serif;\n                margin: 0;\n                padding: 0;\n                color: var(--text-color);\n                background-color: var(--main-color);\n                transition: background-color 0.3s ease-in-out;\n            }\n    \n            header, nav, footer {\n                background-color: var(--main-color);\n                color: #fff;\n                text-align: center;\n                box-shadow: 0 4px 8px rgba(0,0,0,0.2);\n                transition: background-color 0.3s ease-in-out;\n            }\n    \n            nav ul {\n                list-style: none;\n                padding: 0;\n                margin: 0;\n                display: flex;\n                justify-content: center;\n            }\n    \n            nav ul li {\n                margin: 0 15px;\n            }\n    \n            nav ul li a {\n                text-decoration: none;\n                color: #fff;\n                font-weight: 600;\n                padding: 10px 20px;\n                border-radius: 5px;\n                transition: background-color 0.3s, transform 0.3s;\n            }\n    \n            nav ul li a:hover {\n                background-color: var(--hover-color);\n                transform: scale(1.05);\n            }\n    \n            .container {\n                width: 90%;\n                max-width: 1200px;\n                margin: 30px auto;\n            }\n    \n            .section {\n                background-color: var(--background-color);\n                padding: 30px;\n                margin-bottom: 30px;\n                border-radius: 10px;\n                box-shadow: 0 4px 8px rgba(0,0,0,0.1);\n                display: none;\n                opacity: 0;\n                transform: translateY(20px);\n                transition: opacity 0.5s ease, transform 0.5s ease;\n            }\n    \n            .section.active {\n                display: block;\n                opacity: 1;\n                transform: translateY(0);\n            }\n    \n            form input {\n                margin-bottom: 15px;\n                padding: 15px;\n                border: 1px solid #ddd;\n                border-radius: 5px;\n                font-size: 1em;\n                color: var(--text-color);\n                transition: border-color 0.3s ease-in-out, box-shadow 0.3s ease-in-out;\n            }\n    \n            form input:focus {\n                border-color: var(--main-color);\n                box-shadow: 0 0 5px rgba(179, 18, 23, 0.5);\n            }\n    \n            .error {\n                color: red;\n                margin-top: -10px;\n                margin-bottom: 10px;\n                font-size: 0.9em;\n            }\n    \n            .notification {\n                position: fixed;\n                top: -100px;\n                left: 50%;\n                transform: translateX(-50%);\n                background-color: #4caf50;\n                color: white;\n                padding: 15px;\n                border-radius: 5px;\n                box-shadow: 0 4px 8px rgba(0,0,0,0.2);\n                font-size: 1em;\n                z-index: 1000;\n                transition: top 0.5s ease-in-out;\n            }\n    \n            .notification.error {\n                background-color: #f44336;\n            }\n    \n            .cookie-consent {\n                position: fixed;\n                bottom: 0;\n                left: 0;\n                right: 0;\n                background: #333;\n                color: #fff;\n                padding: 15px;\n                text-align: center;\n                display: none;\n                z-index: 1000;\n            }\n    \n            .cookie-consent button {\n                background: var(--main-color);\n                color: #fff;\n                border: none;\n                padding: 10px 20px;\n                margin-left: 10px;\n                cursor: pointer;\n            }\n    \n            .cookie-consent button:hover {\n                background: var(--hover-color);\n            }\n        </style>\n    </head>\n    <body>\n        <header>\n            <h1>Loja de Calçados Femininos</h1>\n        </header>\n        <nav>\n            <ul>\n                <li><a href=\"#\" onclick=\"showSection('home')\" aria-label=\"Início\">Início</a></li>\n                <li><a href=\"#\" onclick=\"showSection('catalog')\" aria-label=\"Catálogo\">Catálogo</a></li>\n                <li><a href=\"#\" onclick=\"showSection('about')\" aria-label=\"Sobre Nós\">Sobre Nós</a></li>\n                <li><a href=\"#\" onclick=\"showSection('contact')\" aria-label=\"Contato\">Contato</a></li>\n                <li><a href=\"#\" onclick=\"showSection('payment')\" aria-label=\"Pagamento\">Pagamento</a></li>\n            </ul>\n        </nav>\n        <div class=\"container\">\n            <section id=\"home\" class=\"section active\">\n                <div class=\"product\">\n                    <img src=\"images/kolosh-hades-gloss.jpg\" alt=\"Tênis Kolosh Hades Gloss Rose Feminino\" />\n                    <div class=\"product-info\">\n                        <h2>Hades Gloss Rose Feminino</h2>\n                        <p>Aquele tênis que vai bem para todas as ocasiões...</p>\n                        <p>Preço: R$ 169,99</p>\n                    </div>\n                </div>\n            </section>\n    \n            <section id=\"payment\" class=\"section\">\n                <h2>Pagamento</h2>\n                <form id=\"payment-form\">\n                    <label for=\"name\">Nome no Cartão:</label>\n                    <input type=\"text\" id=\"name\" name=\"name\" placeholder=\"Nome no cartão\" required>\n                    <div class=\"error\" id=\"name-error\"></div>\n    \n                    <label for=\"card-number\">Número do Cartão:</label>\n                    <input type=\"text\" id=\"card-number\" name=\"card-number\" placeholder=\"1234 5678 9123 4567\" required>\n                    <div class=\"error\" id=\"card-error\"></div>\n    \n                    <label for=\"expiry-date\">Data de Validade (MM/AA):</label>\n                    <input type=\"text\" id=\"expiry-date\" name=\"expiry-date\" placeholder=\"MM/AA\" required>\n                    <div class=\"error\" id=\"expiry-error\"></div>\n    \n                    <label for=\"cvc\">Código de Segurança (CVC):</label>\n                    <input type=\"text\" id=\"cvc\" name=\"cvc\" placeholder=\"123\" required>\n                    <div class=\"error\" id=\"cvc-error\"></div>\n    \n                    <button type=\"submit\">Pagar</button>\n                </form>\n            </section>\n        </div>\n    \n        <footer>\n            <p>&copy; 2024 Loja de Calçados Femininos. Todos os direitos reservados.</p>\n        </footer>\n    \n        <div class=\"notification\" id=\"notification\"></div>\n    \n        <div class=\"cookie-consent\" id=\"cookie-consent\">\n            <p>Este site usa cookies para melhorar sua experiência. Aceitar cookies?</p>\n            <button id=\"accept-cookies\">Aceitar</button>\n            <button id=\"reject-cookies\">Recusar</button>\n        </div>\n    \n        <script>\n            function showSection(sectionId) {\n                document.querySelectorAll('.section').forEach(section => {\n                    section.classList.remove('active');\n                    section.style.opacity = 0;\n                    setTimeout(() => {\n                        section.style.display = section.id === sectionId ? 'block' : 'none';\n                        setTimeout(() => section.style.opacity = 1, 10);\n                    }, 300);\n                });\n            }\n    \n            const notification = document.getElementById('notification');\n            function showNotification(message, isError = false) {\n                notification.textContent = message;\n                notification.classList.toggle('error', isError);\n                notification.style.top = '20px';\n                setTimeout(() => {\n                    notification.style.top = '-100px';\n                }, 3000);\n            }\n    \n            function validateInput(input, regex, errorId, errorMessage) {\n                const value = input.value;\n                const errorDiv = document.getElementById(errorId);\n                if (!regex.test(value)) {\n                    errorDiv.textContent = errorMessage;\n                    return false;\n                } else {\n                    errorDiv.textContent = '';\n                    return true;\n                }\n            }\n    \n            document.getElementById('payment-form').addEventListener('input', function(e) {\n                const nameRegex = /.+/;\n                const cardRegex = /^\\d{4} \\d{4} \\d{4} \\d{4}$/;\n                const expiryRegex = /^(0[1-9]|1[0-2])\\/\\d{2}$/;\n                const cvcRegex = /^\\d{3}$/;\n    \n                const target = e.target;\n                if (target.id === 'name') {\n                    validateInput(target, nameRegex, 'name-error', 'Nome é obrigatório');\n                } else if (target.id === 'card-number') {\n                    validateInput(target, cardRegex, 'card-error', 'Formato inválido: 1234 5678 9123 4567');\n                } else if (target.id === 'expiry-date') {\n                    validateInput(target, expiryRegex, 'expiry-error', 'Formato inválido: MM/AA');\n                } else if (target.id === 'cvc') {\n                    validateInput(target, cvcRegex, 'cvc-error', 'CVC deve ter 3 dígitos');\n                }\n            });\n    \n            document.getElementById('payment-form').addEventListener('submit', function(e) {\n                e.preventDefault();\n    \n                const name = document.getElementById('name');\n                const cardNumber = document.getElementById('card-number');\n                const expiryDate = document.getElementById('expiry-date');\n                const cvc = document.getElementById('cvc');\n    \n                const nameValid = validateInput(name, /.+/, 'name-error', 'Nome é obrigatório');\n                const cardValid = validateInput(cardNumber, /^\\d{4} \\d{4} \\d{4} \\d{4}$/, 'card-error', 'Número do cartão inválido');\n                const expiryValid = validateInput(expiryDate, /^(0[1-9]|1[0-2])\\/\\d{2}$/, 'expiry-error', 'Data de validade inválida');\n                const cvcValid = validateInput(cvc, /^\\d{3}$/, 'cvc-error', 'CVC inválido');\n    \n                if (nameValid && cardValid && expiryValid && cvcValid) {\n                    showNotification('Pagamento realizado com sucesso!', false);\n                } else {\n                    showNotification('Erro no pagamento. Verifique os dados.', true);\n                }\n            });\n    \n            document.addEventListener('DOMContentLoaded', function() {\n                const cookieConsent = document.getElementById('cookie-consent');\n                if (!localStorage.getItem('cookies-accepted')) {\n                    cookieConsent.style.display = 'block';\n                }\n    \n                document.getElementById('accept-cookies').addEventListener('click', function() {\n                    localStorage.setItem('cookies-accepted', 'true');\n                    cookieConsent.style.display = 'none';\n                });\n    \n                document.getElementById('reject-cookies').addEventListener('click', function() {\n                    localStorage.setItem('cookies-accepted', 'false');\n                    cookieConsent.style.display = 'none';\n                });\n            });\n        </script>\n    </body>\n    </html>\n    It's for a website focus in selling shoes feminine, i'm needing help specifically to make the payment part, and order tracking. If I can't say this in this sub, I'm sorry, I'm new to this community.",
        "score": 0,
        "url": "https://www.reddit.com/r/web_design/comments/1fk1zpp/i_need_some_help_with_my_code/",
        "num_comments": 21,
        "comments": [
            {
                "body": "![gif](giphy|bWM2eWYfN3r20)",
                "author": "archangel12",
                "score": 24
            },
            {
                "body": "Just a heads up - I wouldn't expect anyone to scroll through all of this code, unless you can point out specifically where you think the problem might be originating from.\n\nYou need to explain the issue you're experiencing. What is the intended behaviour of the code? What have you tried already? Be specific",
                "author": "MountainAfternoon294",
                "score": 7
            },
            {
                "body": "So... You gonna give anyone a hint about what's supposedly wrong here in that wall of code in different languages, or are you expecting us to figure out what you even want?",
                "author": "shgysk8zer0",
                "score": 6
            },
            {
                "body": "Why are you using vanilla html and JavaScript?\n\nIt can work but it's going to be much more difficult",
                "author": "classic-wow-420",
                "score": 5
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 4
            },
            {
                "body": "You can ask it to add or fix the block of code you’re looking at. Have you tried that?",
                "author": "Munan0n",
                "score": 3
            },
            {
                "body": "Uh is there a backend",
                "author": "legendofchin97",
                "score": 2
            },
            {
                "body": "Use your words man!\nMy car does not work -> that can mean a number of things going from \"broken lamp\" to \"car is on fire\"\n\nPart with the shopping cart / order tracking isnt working HOW? Do you get error messages? Etc \n\nBe specific!",
                "author": "coolneemtomorrow",
                "score": 2
            },
            {
                "body": "Can you create your css stylesheet outside of this and just link it? Because tl;dr 😆 it's the most common way to organize better.",
                "author": "External-Example-292",
                "score": 1
            },
            {
                "body": "That's make me laugh here.",
                "author": "Dante_fromdmc3",
                "score": 1
            },
            {
                "body": "Seriously. Pick your favorite front end framework, connect it to a Shopify store, call it a day.",
                "author": "Archasx",
                "score": 1
            },
            {
                "body": "I still haven't learned how to use the other versions of HTML, and javascript, are they that different?",
                "author": "Dante_fromdmc3",
                "score": 1
            },
            {
                "body": "Okay, thanks for the tip, I'll try to do that.",
                "author": "Dante_fromdmc3",
                "score": 1
            },
            {
                "body": "Thank you very much for your help, could you explain to me better how to do this? Sorry, I started doing this this month.",
                "author": "Dante_fromdmc3",
                "score": 1
            },
            {
                "body": "You need to learn a framework before you even attempt to make an online store.\n\nStart with react",
                "author": "classic-wow-420",
                "score": 1
            },
            {
                "body": "No, I still don't know how to do that yet, but I'll add that later.",
                "author": "Dante_fromdmc3",
                "score": 1
            },
            {
                "body": "ok sorry about that, I'll get better right now.",
                "author": "Dante_fromdmc3",
                "score": 1
            },
            {
                "body": "My goto framework is NextJS but the choice is really up to you, most of my ecommerce projects are headless Shopify stores with NextJS. If you just google \"headless shopify with nextjs\" you'll find countless articles and videos on how to achieve this.",
                "author": "Archasx",
                "score": 1
            },
            {
                "body": "Well, it's sad, but that's the truth LOL.",
                "author": "Dante_fromdmc3",
                "score": 0
            },
            {
                "body": "ok thanks for the help, and the intended behavior is for it to work like a women's shoe store, like Amazon, but just for shoes, I've already tried several times to redo the shopping cart system part, and the tracking system, I don't know why they are going wrong, I tried to go over it several times in the gpt chat to see if it worked but it still didn't work. I don't know what is going wrong exactly.",
                "author": "Dante_fromdmc3",
                "score": -2
            },
            {
                "body": "Yes, but it still works, he said he would have to use another language, I must be wrong, but I think Chat GPT, it's not the best chat bot for this",
                "author": "Dante_fromdmc3",
                "score": -3
            },
            {
                "body": "I'm sorry, I forgot to add that, my bad, I'm very busy with my work, so the problem is that the code isn't working correctly, especially the part with the shopping cart and order tracking.",
                "author": "Dante_fromdmc3",
                "score": -10
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1588501333.0,
        "title": "So I want to count number of unique visits to my website. Do I now need to become a data privacy expert?",
        "author": "_4lexander_",
        "id": "gcobad",
        "selftext": "I want to use [Amplitude](https://amplitude.com/retain-homepage) to track daily unique visitors to my side project website. It doesn't seem like a big deal, but now I'm worried I need to complicated myself with a cookies disclaimer and a data privacy agreement. Is that so?\n\nWhat's the simplest way of counting unique visitors? What's the corresponding simplest way of complying with the legal stuff?\n\n**EDIT** Thanks for all the tips people. Best subreddit",
        "score": 116,
        "url": "https://www.reddit.com/r/web_design/comments/gcobad/so_i_want_to_count_number_of_unique_visits_to_my/",
        "num_comments": 76,
        "comments": [
            {
                "body": "https://plausible.io/\n\nNo cookies, GDPR compliant out of the box, light weight, open source, and, of course, counts unique visitors.",
                "author": null,
                "score": 60
            },
            {
                "body": "> 4. Why is Plausible not free like Google Analytics? \n\n> Google Analytics is free because Google has built their company and their wealth by collecting and analyzing huge amounts of personal information from web users and using these personal and behavioral insights to sell advertisements.\n\n> With Plausible, you 100% own and control all of your website data. This data is not being shared with or sold to any third-parties. Since we don't make money from targeted advertisement, we must ask for a small fee to keep the servers running. \n\nCorrect.",
                "author": null,
                "score": 54
            },
            {
                "body": "Howdy, analytics dev here! First, good on you for having the sense to ask before doing.\n\nYou do not want to track any user behavior without tracking / cookie consent, otherwise you will be liable in countries protected by gdpr law. The only way to get around this is to not provide service in EU countries.\n\nJust add a standard TOS contract & a tracking consent banner. They're everywhere nowadays.\n\nAlso, be wary of forwarding personally identifiable info to any analytics vendors you use (such as amplitude). Everything needs to be anonymized. If you use email as a unique users identifier, then you'll want to encrypt before sending. Many dev sdks for sending data do not do this for you, and may also auto-collect other info such as IP. Even browser settings can fall under this category (ex, browser / device fingerprinting).\n\nBy venturing into behavioral tracking territory, you are now considered a \"data controller\" under gdpr. If you do not anonymize data sent to 3rd parties, then you need to provide mechanisms allowing your users to perma-delete their data from said 3rd parties.\n\nHope this helps!\n\nEdit: By the way, my recommendation if you think you will lean into behavioral tracking, is to send data through segment.io. At my work, we built our own multi-destination pipeline, but segment is a great product for smaller apps.",
                "author": null,
                "score": 50
            },
            {
                "body": "Got exited when you said open source, then I saw 6$ a month. Is that just to cover hosting costs etc?",
                "author": "swillis93",
                "score": 22
            },
            {
                "body": "Web server logs.",
                "author": "tahaali3",
                "score": 19
            },
            {
                "body": ">  Just add a tracking consent banner.\n\nWhy annoy your visitors with this and increase page size by loading some 3rd party tracking code when it's not even necessary? If all OP wants is daily unique visitors the server log has all the info they need.",
                "author": "itslikedatchall",
                "score": 15
            },
            {
                "body": "Oh shit, didn’t realise, now I gota go make loads of posts to get karma!",
                "author": "swillis93",
                "score": 13
            },
            {
                "body": "Awesome, might give it a go and see how it is.",
                "author": "swillis93",
                "score": 12
            },
            {
                "body": "This is incorrect. Behavioral proxy data, such as pageviews, can be used in combination with other data points to personally identify someone without their consent.\n\nYou cannot send pageview data without tracking consent. Diagnostic tools, such as newrelic is okay though.",
                "author": null,
                "score": 11
            },
            {
                "body": ">Just add a standard TOS contract & a tracking consent banner. They're everywhere nowadays.\n\nI disagree with those \"consent banners\" with a passion.\n\nIt's like software EULA. Nobody cares and nobody ever reads those.\n\nOn the other hand, forcing online presences to acknowledge AND comply with Do Not Track requests should be mandatory.",
                "author": "mr_ent",
                "score": 10
            },
            {
                "body": "Unless you have a very specialized website (targeting schools, universities or other places where there are lots of users behind a single IP address with a single browser/configuration) then all you need to do is use a hash of IP address plus user agent as a unique identifier.",
                "author": "amunak",
                "score": 10
            },
            {
                "body": "Hope it works for your situation!\n\nPS: happy cake day.",
                "author": null,
                "score": 9
            },
            {
                "body": "https://usefathom.com/",
                "author": "StylishUnicorn",
                "score": 8
            },
            {
                "body": "This guy reddits",
                "author": "Alex_Hovhannisyan",
                "score": 7
            },
            {
                "body": "Do you have a current privacy policy for your website?",
                "author": "CastleRaven",
                "score": 6
            },
            {
                "body": "Many thanks for the well thought out response!",
                "author": "_4lexander_",
                "score": 6
            },
            {
                "body": "It's fully open source so you can probably self host. They just advise that it's not fully documented how to do so",
                "author": "iSpyCreativity",
                "score": 6
            },
            {
                "body": "Yeah they're definitely annoying, but there's a reason why they're being added everywhere. My hope is that browsers will step up and standardize cookie consent at the least.",
                "author": null,
                "score": 6
            },
            {
                "body": "You need a unique identifier (from cookies or a session) to count uniques, even in server logs. So consent would be needed either way. Plus, good luck with anything beyond counting raw pageviews (ex, property segmentation, funnels, retention, etc)",
                "author": null,
                "score": 6
            },
            {
                "body": "Most of those cookie consent popups do not make the web GPDR compliant. You have to do extra work to be compliant. I would personally use fathom because it is privacy-focused and GPdR compliant.",
                "author": "jonathanenlared",
                "score": 6
            },
            {
                "body": "Nope. It's just a single page web app and doesn't collect any information about the user",
                "author": "_4lexander_",
                "score": 5
            },
            {
                "body": "Simplest way is to run stats on your server, its anonymous already nothing else to do.",
                "author": "malicart",
                "score": 4
            },
            {
                "body": "Legally, its the same.",
                "author": "MatsSvensson",
                "score": 4
            },
            {
                "body": "I don't discuss about that, absolutely. My point is that spending $6/month per 10K visits isn't worth the price. Not for a tool that offers *much* less than what Analytics does for free.",
                "author": "MarmotOnTheRocks",
                "score": 4
            },
            {
                "body": "Storing that local storage value is the same as a cookie in the eyes of the law and if it's not essential for your website to function you have to disclose it with a banner and privacy policy stating the purpose. I am not a lawyer though and just regurgitating what I have been told by legal team at the company I work for.",
                "author": "Plorntus",
                "score": 4
            },
            {
                "body": "He said hash. You wouldn’t be storing the raw ip as an identifier",
                "author": "adenzerda",
                "score": 4
            },
            {
                "body": "Can't you just use localStorage on the front end? \n\n `if ( ! localStorage.getItem('unique')) { do_hidden_ajax_request_to_increment_uniques(); localStorage.setItem('unique', true); }`\n\nI don't see any need for cookies at all to count unique views.",
                "author": "uriahlight",
                "score": 3
            },
            {
                "body": "\\+ [GoAccess](https://goaccess.io/)",
                "author": "itslikedatchall",
                "score": 3
            },
            {
                "body": "What about them is illegal?",
                "author": "_4lexander_",
                "score": 3
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 3
            },
            {
                "body": "You can look at IP addresses and user agent headers. It's not 100% accurate but depending on your needs its often good enough.",
                "author": "electricity_is_life",
                "score": 3
            },
            {
                "body": "A value that is hashed using a standard method like SHA-256 can't be reversed, practically speaking. If Google threw every CPU they had at cracking a single hash, [it would take them decades to solve](https://www.reddit.com/r/askscience/comments/4rnhw9/comment/d52uk9i).",
                "author": "isUsername",
                "score": 3
            },
            {
                "body": " Careful...\n\nPretty much every single of the standard  cookie consent banners you see everywhere are illegal.\n\nIf you add one of those blindly, you will only be making your site worse with zero legal arse-covering for the trouble.",
                "author": "MatsSvensson",
                "score": 2
            },
            {
                "body": "I ended up going with this. Very nice, lightweight in code, and on the eyes too! Thanks",
                "author": "_4lexander_",
                "score": 2
            },
            {
                "body": "**$6/month** per **10K views/month** combained across all my clients isn't exactly an amazing deal, though. If you've got 10 domains that basically means it's metered to 1K views/month *per domain*. That's nothing.",
                "author": "MarmotOnTheRocks",
                "score": 2
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 2
            },
            {
                "body": "Nope 1st party cookies too since they can be used to track a unique users activity on a site.",
                "author": null,
                "score": 2
            },
            {
                "body": "Yeah but amplitude is hands down a better analytics product.",
                "author": null,
                "score": 2
            },
            {
                "body": "These banners are mandatory though. You have to give the user a choice of they want to share their data.",
                "author": "Snubl",
                "score": 2
            },
            {
                "body": "No, it's not. All you're doing is triggering an AJAX request. You're not using a session ID, nor IP address. All you're doing is telling the user's browser to run an AJAX request one time for this website. The request contains no data whatsoever that you will be retaining (any headers that get sent are no different then any other page view). You're only counting the hit itself, which is basically nothing more than a ping. You're not even tracking anonymous data here. You're tracking NO DATA AT ALL. All you're doing is incrementing a single number in a database.",
                "author": "uriahlight",
                "score": 2
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 2
            },
            {
                "body": "He was asking about the privacy-laws aspect of cookies.\n\nFor that, switching from cookies to localStorage makes no difference, since such laws are usually tech-indifferent even if they are called cookie-law-something-something.\n\nTechnically they are different , of course.\n\nBut not **legally**.",
                "author": "MatsSvensson",
                "score": 2
            },
            {
                "body": "Thank. I was always wondering about those bars which popped up saying that I agree by default",
                "author": "_4lexander_",
                "score": 2
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 2
            },
            {
                "body": "Highly unlikely, but if the server logs ever get audited, you would have to argue those logs to be essential to the operation of your app, ex logging ip for security or bug reporting. Analytics use is not protected, so this wouldn't hold up in court, but again that's highly unlikely for small fish.",
                "author": null,
                "score": 2
            },
            {
                "body": "The point I'm making is it's perfectly legal to count unique page views with local storage or asset caching without ANY consent from the user. The localStorage is a boolean stored on the USER side. No user data is stored or acquired on the server to achieve the unique count that wouldn't already be present with any other HTTP request. If you visit a site from Google search results, the HTTP request for your first page view before agreeing to any policy is exactly the same as the ajax HTTP request that would be ran under the hood for incrementing the unique tally. It's perfectly legal to count page views and unique visits without user consent if you're utilizing either of the two methods (localStorage or 304 Not Modified) described in my previous post. As mentioned earlier, any argument otherwise is the equivalent to saying a restaurant owner can't count the number of people who walk into their restaurant every day without the express consent of each customer.\n\nOnce you start using persistent session IDs and/or logging IP addresses to count unique page views, then there's an argument to be had. But the two methods I've described are not in a gray area and do not require user consent since neither method gives you ANY means to actually track or identify the user in subsequent HTTP requests - there's no ID or hash to identify them in any way (even anonymously). There's no data link of any kind. No names, no IP addresses, no hashes, no codes - zip zero nada.\n\nFrankly the fact this is even an issue shows how absurd the laws are and how absurd people's interpretations of said laws are.  Look at your web server (Apache, Nginx, IIS - whatever) - even if you're not counting anything on your website or using any cookies of any kind, chances are your server is logging all kinds of crap (IP addresses, user agents, referrers, etc.) behind the scenes and chances are your firewall is logging all kinds of crap behind the scenes. I bet 2/3 of the people here saying you need user consent to count unique views have all of the aforementioned logs running behind the scenes on the server or firewall level without nary a thought about disabling them. Furthermore, people running smaller web applications via shared hosting providers wouldn't even have the means to disable such logs. Please stop intimidating people against doing something as harmless as incrementing a phucking number in a phucking database.",
                "author": "uriahlight",
                "score": 2
            },
            {
                "body": "Dude, you are not sending 1 bit of local information to the server! You evaluate the localStorage on the client side and make an HTTP request to the ajax page if needed. That's it. There's NO DATA (bit or byte) in that ajax request that wouldn't exist in every other HTTP request you make. The mere presence of the request is your incrementor.",
                "author": "uriahlight",
                "score": 2
            },
            {
                "body": "I give up. The fact we're getting this granular in this discussion is proof positive of how silly this all is. If people think there's a legal argument an attorney could make that would convince a legal panel that what I'm saying is incorrect, then that attorney should switch careers and get into sales so he could sell ice to an Eskimo, sand to a nomad, and leaves to a Mayan.",
                "author": "uriahlight",
                "score": 2
            },
            {
                "body": "Use Google Analytics with cookies disabled.\nhttps://developers.google.com/analytics/devguides/collection/analyticsjs/cookies-user-id",
                "author": null,
                "score": 1
            },
            {
                "body": "Minimal config tools are the way to go better to use something that works out-of-the-box. You can try UXCam simple to use and easy to track visitors based on scroll, heatmaps, session recoding as well.",
                "author": "ShilpaRana12",
                "score": 1
            },
            {
                "body": "If you only do business in the US nothing is required. \n\nIm not an expert on the law overseas but my understanding is generic counting of users would not fall under 'tracking' anyway.",
                "author": null,
                "score": 1
            },
            {
                "body": "I know of [https://goaiadapt.info/](https://goaiadapt.info/). it's very light weighted and have a simple UI. I use a paid version to collect my visitors data and applying different form for machine learning models for analytics purpose. But goaiadapt also offer a free version just without the ML and graphs stuff.",
                "author": "NeedleworkerDecent70",
                "score": 1
            },
            {
                "body": "Thanks for the detailed response! Very helpful",
                "author": "_4lexander_",
                "score": 1
            },
            {
                "body": "https://github.com/plausible-insights/plausible < --- can download and build it yourself.",
                "author": "Coz131",
                "score": 1
            },
            {
                "body": "That amounts to tears in the ocean. That's not great at all. They must be paying through the nose for bandwidth at that rate.",
                "author": "RabSimpson",
                "score": 1
            },
            {
                "body": "For example:\n\nTo be GDPR-compliant, you need to first ask and then allow for a yes or no, without trying to force a yes.  \n\n\nSo just **telling** the visitor that you already did something or is about to do something, doesn't cut it.\n\nA simple rule, if it only has one be button, and that button says \"accept\" or similar,  it can never be compliant.\n\n And you have to be crystal clear about what you are asking, and don't lie.\n\n&#x200B;\n\nCompare if you have a visitor in your home, and offer them coffee.\n\nDo you only allow \"yes\" as an answer?\n\nOr do you perhaps start pouring coffee down their throat as soon as they enter, and  after tell them you offer coffee to make their visit better.\n\nBasically, don't act as a psycho.",
                "author": "MatsSvensson",
                "score": 1
            },
            {
                "body": "Yeah that requires privacy pop up, but not a cookie pop up? Many sites have both, but as long as its 1st party only privacy agreement is needed. This is what I meant, but its highly possible I am wrong.",
                "author": "1116574",
                "score": 1
            },
            {
                "body": "They still don't require a pop-up / banner though. For the most part you just need to have a page with the list of cookies and what they do, pointing out that the user can block them in the browser if they wish so.",
                "author": "amunak",
                "score": 1
            },
            {
                "body": "Care to explain? I’ve tried both, and I prefer mixpanel",
                "author": "AKtunes",
                "score": 1
            },
            {
                "body": "Idk about that distinction. You could be right, but consent of some kind is definitely required!",
                "author": null,
                "score": 1
            },
            {
                "body": "I'm not personally familiar with the tool, but https://goaccess.io/ was also posted here and could potentially work for you.",
                "author": null,
                "score": 1
            },
            {
                "body": "What if I coded my own mysql table that only has 3 columns\n\nIP | page_name | date_time\n\nand I delete any records older than 7 days?\n\nWould I still need a privacy policy?\n\nI never plan on sharing this data with anyone",
                "author": "blackmetro",
                "score": 1
            },
            {
                "body": "I understand what you mean. The law covers more than just cookies. It's about requiring user consent regarding the collection of user data (including anonymous data) that is not \"strictly necessary.\" So you're absolutely right about the scope of it. But this method does not collect ANY data, identifiable or anonymous. I've read through numerous FAQs and EU documents on the topic and have found absolutely nothing that distinguishes the method I've just described from any other regular page view that would exist and be recorded prior to someone accepting or rejecting a cookie or privacy policy. The method I've described equates to a page view - nothing more. It involves nothing more than an HTTP request. It requires no identifying HTTP headers, nor does it anonymize data (meaning it does NOT take identifiable data and convert it to anonymous data). It's literally just a page view. All that is different is it is only viewed once. You aren't storing ANY user data whatsoever. You're incrementing a single number. It's perfectly legal to count page views and measure server load. How is this any different? That's like saying a restaurant owner isn't allowed to count the number of people walking through their door every day without the express consent of each patron.\n\nAnother way to count unique views without a notice is via asset caching. For example, if you send a cache header for a regular asset (like a CSS stylesheet that is present on every page) that expires in X days, there's nothing stopping you from incrementing your unique views everytime you send an HTTP response for that asset that doesn't include a \"304 Not Modified\" header.",
                "author": "uriahlight",
                "score": 1
            },
            {
                "body": "Your legal team doesn't know what they're talking about.",
                "author": "uriahlight",
                "score": 1
            },
            {
                "body": "Again, this has nothing to do with any **specific** solution.\n\nWhats legal/illegal to store as a cookie, is equally  legal/illegal to store in localStorage.\n\nImplementing it one way or the other is trivial, and, makes no difference for OPs question about having to be a data privacy expert.\n\nI only mentioned it, because I have seen people argue that they re-implemented their cookie-based solution with an equally illegal localStorage-based one, just so they could put a \"***Now 100% cookie-free***\" rubber-stamp in their site.\n\nThat's all.\n\nPeace out.\n\n&#x200B;\n\n&#x200B;\n\n#",
                "author": "MatsSvensson",
                "score": 1
            },
            {
                "body": "This is a legal argument you could totally make. I don't think it's obviously compliant though... The \"you're storing no data part\" seems unlikely to be convincing.\n\nWhat's in local storage is certainly data: a single bit of data. And you're giving that single bit of data to the server directly. An absence of the request is a 0, the presence of the request is a 1.\n\nThe fact that it's \"just another page view\" seems sorta irrelevant. You could pass on any information this way. Make 128 local storage values, and 128 endpoints, and hit a certain combination of them. You've just passed on the same number of bits of information as your average UUID.",
                "author": "itsjohncs",
                "score": 1
            },
            {
                "body": "lmao",
                "author": "patrik_media",
                "score": 1
            },
            {
                "body": "As I understand it, hashes aren't sufficient for data controllers because data can often be decrypted with some level of effort. The rule is, if it's unique to an individual, then you can't store it for non-essential purposes without consent. When forwarding data to a 3rd party tho, you wanna always hash any identifiers.",
                "author": null,
                "score": 1
            },
            {
                "body": "Hashing algorithms are lossy. You can't generally round-trip a hash.",
                "author": null,
                "score": 1
            },
            {
                "body": "> Stop making something simple, complicated.\n\nDon't engage with us if you don't want to argue your point... Your arguing a point online. Stop arguing online if you don't want to argue online 😂.\n\nIt's fine, none of this matters, we're all here recreationally talking about random technical shit because we enjoy it. Cause why not 🤷‍♀️.\n\n> No user data is stored or acquired on the server to achieve the unique count that wouldn't already be present with any other HTTP request.\n\nYour sending up the 1 bit of information you have in local storage to the server. That seems like anonymized user data.\n\nLike I think all of your arguments you've made would also apply to this similar scenario:\n\n1. A UUID is stored in local storage and unconditionally sent to an endpoint via AJAX.\n2. That UUID is transformed via a cryptographically strong one-way anonymous hash.\n3. That anonymous hash is stored in a set in the database. No other information is stored about that request (the IP address isn't stored, the original UUID is wiped from memory, etc).\n\nThe number of unique users is the size of that set. The set is useless by itself except as a way to count unique users, it's functionally equivalent to just incrementing an integer like in your example despite being needlessly complicated.\n\nIn this alternate scenario, it seems clearer that anonymized user information is being stored.\n\nNow these two situations are different. It's not obvious that they'd be equivalent in the eyes of whoever would end up deciding whether each scenario is compliant or not.\n\nBut they seem awfully similar to me.",
                "author": "itsjohncs",
                "score": 1
            },
            {
                "body": "Yes, but generating the hashes for all ipv4 addresses does not take long. Thus, it is easy to find out the original value. The same would apply for the user agent (as there are not too many of thrse).",
                "author": "Acmion",
                "score": 1
            },
            {
                "body": "They could salt the hash.",
                "author": "isUsername",
                "score": 1
            },
            {
                "body": "Yeah not an expert but my understanding was that if the data was anonymized -- ie you dont track who that user is -- youre good. But not a Brit and dont know for certain.",
                "author": null,
                "score": 0
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 0
            },
            {
                "body": "I believe that using cookies doesn't require disclaimer in eu if it's not 3rd party cookies, but I might be wrong.",
                "author": "1116574",
                "score": -1
            },
            {
                "body": "Doesn't give you unique user activity tho without cookies or some kind of session.",
                "author": null,
                "score": -1
            },
            {
                "body": "There's no requirement in the US",
                "author": null,
                "score": -1
            },
            {
                "body": "Try mixpanel; very similar product to amplitude (visualizations are easier to read) and the SDK has simple opt-in/opt-out mechanisms you can tie to a cookie pop-up without needing to become a privacy expert:\n\nhttps://developer.mixpanel.com/docs/javascript\n\nhttps://developer.mixpanel.com/docs/managing-personal-data\n\nEdit: misread the post\n\nhttps://www.privacypolicytemplate.net/\n\nFrom a CYA perspective, it’s a good idea to have a privacy policy, even if it’s canned. This does not need to be front and center on your site, but if you’re going to track your users you are legally required (in some jurisdictions like California and Europe) to tell them and give them an opt out mechanism. Rather than have different messages for different regions, it’s better to just have it somewhere on the site, which is why so many implement it as a modal.\n\nThats why you see so many sites with that the “this site uses cookies” modal, and which has a “more info” link that shows the privacy policy (which no one will ever read).\n\nI like mixpanel because its sdk makes it easy to update the users preference and tie it to a button/click. Not sure if amplitude makes that easy.\n\nTLDR; you don’t need to be a privacy expert; just copy what a reputable site has done and use a canned privacy policy.",
                "author": "AKtunes",
                "score": -2
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": -3
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1598142704.0,
        "title": "What are some surprising mobile-unfriendly sites?",
        "author": "andrewtheclark",
        "id": "iett91",
        "selftext": "Do you have any that have come to mind? I'm talking more about sites with heavy traffic or multi-million/billion dollar corporations.",
        "score": 73,
        "url": "https://www.reddit.com/r/web_design/comments/iett91/what_are_some_surprising_mobileunfriendly_sites/",
        "num_comments": 63,
        "comments": [
            {
                "body": "Whole lot of websites that have apps seem to be making their mobile experience bad on purpose in order to push users towards the app. Facebook is among the most egregious on that count.",
                "author": "PickerPilgrim",
                "score": 129
            },
            {
                "body": "The irony is you're posting this on reddit - one of the worst offenders.",
                "author": "deadA1ias",
                "score": 83
            },
            {
                "body": "Not massive, but https://weather.gov comes to mind",
                "author": "Sam956",
                "score": 40
            },
            {
                "body": "Almost any .gov website.",
                "author": "wildbortami",
                "score": 34
            },
            {
                "body": "Practically any news website. \n\nThey're a horror show of ads, autoplaying media and barely any actual content.",
                "author": "John___Matrix",
                "score": 31
            },
            {
                "body": "I went to look at the Subway menu for a BLT earlier on my phone and was annoyed that 40% of the screen was taken up by banners and menus I couldn’t close, and for some reason I kept being unable to scroll. Don’t remember if they prompted me to download an app first.\n\nEdit: It was [order.subway.com](https://order.subway.com/en-US/)",
                "author": "sibilith",
                "score": 28
            },
            {
                "body": "I recently used a .gov website that reminded me what version of Netscape Navigator I needed to use. It also informed me that it used \"encrypted communications.\" Very reassuring...",
                "author": "Chris_Cross_Crash",
                "score": 24
            },
            {
                "body": "Reddit.",
                "author": "deadA1ias",
                "score": 22
            },
            {
                "body": "Would you like to rate our app ?\nThat's the kind of message I just got",
                "author": "Nerwesta",
                "score": 21
            },
            {
                "body": "The site my company forces us to use to get our paystubs and tax information. Also it's mobile ONLY. On desktop, it's still mobile. It's run by Equifax.\n\n\nThings that annoy me about it:\n\n- Somehow it doesn't save logins, and chrome even can't find a password field.\n\n- Nearly everything is cut off and has to be horizontally scrolled, even on desktop.\n\n- Takes about 20 seconds to load on WiFi, 40 seconds on LTE, give up if you're on 3G.\n\n- Times out and logs you out if it doesn't load fast enough.\n\n- Off topic; but why is my username my SSN??????? And I can't change it??? \n\n- Passwords are 8 digits ONLY (no more, no less, and no letters),  has to be changed every 30 days, and you can't use a combo you used previously. \n\nI know this doesn't quite fit your description but DAMN it bugs me every time I have to check my pay.",
                "author": "Nekonime",
                "score": 20
            },
            {
                "body": "Practically most all .gov sites were not built to handle the traffic they are receiving these days.",
                "author": "Jitsiereveld",
                "score": 19
            },
            {
                "body": "JsFiddle",
                "author": "Acmion",
                "score": 16
            },
            {
                "body": "that makes sense tbh",
                "author": "riggiddyrektson",
                "score": 11
            },
            {
                "body": "pornhub is great on mobile?!\n\nedit: so I heard",
                "author": "Noch_ein_Kamel",
                "score": 11
            },
            {
                "body": "What a horrible user experience! Sure the scale and layout of the page is solid but the popups and banners cover any actual content and are super annoying",
                "author": null,
                "score": 10
            },
            {
                "body": "Do you like our app?\n\"not really\"\nPlease tell us why\n\"not now\"",
                "author": "TyParadoXX",
                "score": 10
            },
            {
                "body": "All news websites are an absolute mess",
                "author": "goldsauce_",
                "score": 8
            },
            {
                "body": "Just last night, I used ordernow.pizza which Is Pizza Hut’s online ordering site. \n\nAsks you to enter a location, but the text box doesn’t launch the iOS keyboard to input anything. \n\nEnded up having to write in Notes and then copypaste it into the box.",
                "author": "queen-adreena",
                "score": 8
            },
            {
                "body": "The mobile site is what's bad. Desktop is obviously awkward to use on a phone, but the mobile site has restrictions and obnoxious pop ups and stuff to push you towards the app. It's awful. Joke's on them, though. I use a third party app without ads.",
                "author": "SuperNanoCat",
                "score": 8
            },
            {
                "body": "Any site that has a sticky navbar that doesn’t scale. If it takes up half the screen I’ll just find the information somewhere else.",
                "author": "Razgriz80",
                "score": 7
            },
            {
                "body": "Horrible, *horrible* mobile experience. Especially considering all the weight put on mobile-first design in this field.",
                "author": "DEEEPFREEZE",
                "score": 6
            },
            {
                "body": "Just say craigslist",
                "author": null,
                "score": 6
            },
            {
                "body": "Well tbf, I would have never imagined using the desktop site on mobile in the first place. Just the way you interact with the UI is about as mobile-unfriendly as you can get by default.",
                "author": "Pantzzzzless",
                "score": 6
            },
            {
                "body": "Even worse, it's intentional",
                "author": null,
                "score": 5
            },
            {
                "body": "Yeah reddit hasn’t given a shit about it’s users for years now. They only care about making money by funnelling people to the app.",
                "author": "Disgruntled__Goat",
                "score": 5
            },
            {
                "body": "IKEA, horrible UX",
                "author": null,
                "score": 4
            },
            {
                "body": "i was using facebook in safari for iphone today and their search bar didnt even work like at all",
                "author": null,
                "score": 4
            },
            {
                "body": "Opened it up and thought \"doesn't look that bad\" - then realized I'm on my 21 inch desktop screen.  6am, I need coffee.",
                "author": "thinkofanamefast",
                "score": 4
            },
            {
                "body": "Nah that’s kinda decent on mobile it at least works this site was god awful",
                "author": "calemedia",
                "score": 4
            },
            {
                "body": "Facebook wanta you to download messenger when you try to chat with people on the mobile site. I just hit view as desktop on my phone and zoom in alot and click on messenger and it works. Mobile site will just redirect me to the play store to download it. The anti consumer behavior got to me so much I only use FB like twice a year.",
                "author": "Froonce",
                "score": 3
            },
            {
                "body": "A tall promo banner inside the sticky header. Big Oof.",
                "author": "redditindisguise",
                "score": 3
            },
            {
                "body": "Also any blog style info site. I wish for death every time I visit gardeningknowhow on my phone without an ad blocker. The text jumps around because so much shit is loading as I scroll. Nightmare.",
                "author": "SuperNanoCat",
                "score": 3
            },
            {
                "body": "The guardian is probably the nicest I've seen.",
                "author": "thedifferenceisnt",
                "score": 3
            },
            {
                "body": "I can't get over how the sidebar doesn't collapse when you shrink the window on desktop. Why does a chat app need to be so *wide*? I remember the good ol days when chat apps were tiny little babies that sat in the corner and stayed out of the way.",
                "author": "SuperNanoCat",
                "score": 3
            },
            {
                "body": "Yeah, I don't get this one either; some apps/websites are not intended for mobile use.",
                "author": "Alex_Hovhannisyan",
                "score": 3
            },
            {
                "body": "Well, CodePen works. Besides, sometimes I just want to view the code and see the output, not necessarily write it.",
                "author": "Acmion",
                "score": 3
            },
            {
                "body": "Google Analytics",
                "author": "Meloyski",
                "score": 2
            },
            {
                "body": "Reddit.com",
                "author": "Niek_pas",
                "score": 2
            },
            {
                "body": "I literally can’t think of this site atm (I’ll try to comeback with the name later) but it’s a big name brand and omg it was aids on mobile I almost emailed them asking if they wanted a updated site it’s amazing how sites that make millions don’t update it to be mobile friendly 🤦‍♂️",
                "author": "calemedia",
                "score": 2
            },
            {
                "body": "Something tells me DEFCON would rip that a new one.",
                "author": "Blieque",
                "score": 2
            },
            {
                "body": "Idk, is it me, but when I'm going to reddit through mobile browser, it just shows nav bar and loading reddit logo, but doesn't load at all.",
                "author": "AlteraCode",
                "score": 2
            },
            {
                "body": "That's exactly it",
                "author": "Nerwesta",
                "score": 2
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 1
            },
            {
                "body": "Pretty much anything with a GDPR popup. They’re bad at the best of times but unless there’s a clear “reject all” button it’s a complete clusterfuck.",
                "author": "Disgruntled__Goat",
                "score": 1
            },
            {
                "body": "Not the multi billion corp, but I came across many local universities website, in which the mobile interface and back End were having outdated terrible UI, stagnant performance and some navigation buttons on the website were not functioning properly. In addition, the display didn’t adjust to mobile screen size automatically so even if you rotate your view horizontally, you cant tap right or zoom out to view more of the data (which out of view due to over size) so no choice that you have to view it on PC/laptop or Ipad to view all properly.",
                "author": "lala9605",
                "score": 1
            },
            {
                "body": "BMW. The whole site is bad on mobile devices but especially their mobile configurator is really bad.",
                "author": "CETERAZz",
                "score": 1
            },
            {
                "body": "Sometime its just hard to pull of a nice mobile friendly 🤷‍♂️🤷‍♂️",
                "author": "nova-IT",
                "score": 1
            },
            {
                "body": "I've said almost any news website already, I will also add practically every recipe site.\n\nChances are, I'm looking for a simple list of ingredients and how to cook them while I'm on my mobile in the kitchen. \n\nI honestly don't need a ton of guff about the history of the ingredients and the backstory of the person who made up the recipe taking up the prime realestate.",
                "author": "John___Matrix",
                "score": 1
            },
            {
                "body": "https://krebsonsecurity.com - One of the most authorotative sites on online Security but stuck in stone age.",
                "author": null,
                "score": 1
            },
            {
                "body": "Apple’s beta program sign in page isn’t responsive. Drives me insane.",
                "author": "jrm725",
                "score": 1
            },
            {
                "body": "All media sites except youtube",
                "author": "julian88888888",
                "score": 1
            },
            {
                "body": "facebook",
                "author": "schemaddit",
                "score": 1
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 1
            },
            {
                "body": "Did you consent to electronic tax information? They need your consent to do this electronically. If you didn't consent, tell them they need to give you a paper W-2 in January. If they fail to send it out, you can call the IRS at 800-829-1040 to explain that you were not mailed a W-2. If you did consent, ask how to withdraw your consent.\n\n[**Furnishing Form W-2 to employees electronically.**](https://www.irs.gov/publications/p15a) You may set up a system to furnish Form W-2 electronically to employees. Each employee participating must consent (either electronically or by paper document) to receive his or her Form W-2 electronically, and you must notify the employee of all hardware and software requirements to receive the form. You may not send a Form W-2 electronically to any employee who doesn't consent or who has revoked consent previously provided.To furnish Forms W-2 electronically, you must meet the following disclosure requirements and provide a clear and conspicuous statement of each requirement to your employees.\n\n* The employee must be informed that he or she will receive a paper Form W-2 if consent isn't given to receive it electronically.\n* The employee must be informed of the scope and duration of the consent.\n* The employee must be informed of any procedure for obtaining a paper copy of his or her Form W-2 and whether or not the request for a paper statement is treated as a withdrawal of his or her consent to receiving his or her Form W-2 electronically.\n* The employee must be notified about how to withdraw a consent and the effective date and manner by which the employer will confirm the withdrawn consent. The employee must also be notified that the withdrawn consent doesn't apply to the previously issued Forms W-2.\n* The employee must be informed about any conditions under which electronic Forms W-2 will no longer be furnished (for example, termination of employment).\n* The employee must be informed of any procedures for updating his or her contact information that enables the employer to provide electronic Forms W-2.\n* The employer must notify the employee of any changes to the employer's contact information.",
                "author": "takomanghanto",
                "score": 1
            },
            {
                "body": "To be fair, I've run into weird iOS keyboard display glitches when building stuff, and have to do ridiculous hacks to make the UX work. Safari is a shitshow and all browsers on iOS are forced to use its engine. But I also probably never worked in a team with the same budget as the Pizza Hut mobile team.\n\nLast one I remember was that people with a certain version of iOS, when they would click into a particular textbox, the keyboard would come up *over* the textbox, so users couldn't see what they were typing. Spent hours fiddling with CSS to try to find a clean solution that worked on all browsers, before giving up and putting some ridiculous JS together to make the whole page scroll for those users when the textbox was focused. Fixing Safari/iOS-only bugs is such a damn pain.",
                "author": "travellingprog",
                "score": 1
            },
            {
                "body": "How so?",
                "author": "blahgba",
                "score": 1
            },
            {
                "body": "seems good to me now",
                "author": "Progribbit",
                "score": 1
            },
            {
                "body": "I'm so fed up with Reddit's mobile site. I *hate* infinite scroll (for a ton of reasons) so I use Reddit's mobile site instead of the app. But they keep trying to push everyone to the app by making the mobile web experience worse and worse",
                "author": "RunBlitzenRun",
                "score": 1
            },
            {
                "body": "I'm guessing it's PaperlessPay",
                "author": "Pantzzzzless",
                "score": 1
            },
            {
                "body": "And their app actually is very decent too.",
                "author": "queen-adreena",
                "score": 1
            },
            {
                "body": "True. But the primary function of that site is for people ordering while in their restaurants (for social distancing so wait staff are required), so predominently a smartphone-targetted web app.",
                "author": "queen-adreena",
                "score": 1
            },
            {
                "body": "Not even a good app",
                "author": null,
                "score": 1
            },
            {
                "body": "The bigger irony is no one gives a fuck about reddit official app either & uses third party instead. Their strategy is a backlash against them lol.",
                "author": "semprotanbayigonTM",
                "score": 0
            },
            {
                "body": "I had to stop using it as it was absolutely eating my data allowance every month.  I just use the mobile site now.",
                "author": "noisetonic",
                "score": -1
            },
            {
                "body": "https://www.semrush.com/dashboard/",
                "author": "hummdog",
                "score": -2
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1644073397.0,
        "title": "Any resources for a GDPR compliant essential-only cookie site?",
        "author": "jeankev",
        "id": "sl8ya3",
        "selftext": "I have a business website that only uses a « selected language » cookie. It (purposely) doesn’t collect data of any kind apart from this. \n\nRegarding GDPR can I really avoid setting up a consent system? If so is there a conventional way of differentiating it from sites which do not comply? Is a message like « this site does not collect data » enough?\n\nInformation about this is very hard to find since searches return mainly resources about data collecting compliance.",
        "score": 69,
        "url": "https://www.reddit.com/r/web_design/comments/sl8ya3/any_resources_for_a_gdpr_compliant_essentialonly/",
        "num_comments": 23,
        "comments": [
            {
                "body": "You don't need consent for functional cookies.",
                "author": null,
                "score": 73
            },
            {
                "body": "And soon you will not even need it for simple self-hosted statistical cookies. EU law coming soon. I can’t wait.",
                "author": "tauzN",
                "score": 19
            },
            {
                "body": "brb, just going to tell the marketing dept to ignore all KPIs, fire trained Analytics analysts.",
                "author": "devolute",
                "score": 12
            },
            {
                "body": "[removed]",
                "author": null,
                "score": 10
            },
            {
                "body": "I've had a similar project recently. The way we avoided a language cookie was by setting the language through the User Agent and not offering a manual selection in the first place. That was sufficient for our use-case.",
                "author": "PancakeZombie",
                "score": 8
            },
            {
                "body": "These - from what I can tell - suggest \"you won't need it for tracking cookies\" is a huge oversimplification for many (if not most) scenarios.",
                "author": "devolute",
                "score": 5
            },
            {
                "body": "[Here it is in Danish. ](https://erhvervsstyrelsen.dk/erhvervsstyrelsen-vil-fremadrettet-ikke-prioritere-tilsynet-med-hjemmesiders-indhentning-af-simpel)\n\n[Google Translate](https://erhvervsstyrelsen-dk.translate.goog/erhvervsstyrelsen-vil-fremadrettet-ikke-prioritere-tilsynet-med-hjemmesiders-indhentning-af-simpel?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=da&_x_tr_pto=wapp)",
                "author": "tauzN",
                "score": 4
            },
            {
                "body": "[removed]",
                "author": null,
                "score": 3
            },
            {
                "body": "Functional cookies like this need no notice.",
                "author": "PrettyWhore",
                "score": 2
            },
            {
                "body": "It's worth noting that there is still some nuance beyond \"no tracking cookies = no need for a cookie banner\". Even with things like login cookies which seem like the quintessential case of a necessary cookie they still require some special handling around things like session length. The interpretation I see around is you're supposed to default to short lived sessions, and only if the user takes an explicit action like checking a \"remember me\" checkbox can you persist the session longer than a few hours/the current browsing session.",
                "author": "AudibleEcstasy",
                "score": 2
            },
            {
                "body": "They meant \"best solution in this case\" obviously",
                "author": "jeankev",
                "score": 2
            },
            {
                "body": "I see. That's fucking stupid.",
                "author": "PrettyWhore",
                "score": 2
            },
            {
                "body": "It means « no tracker » as said in the post so I don’t get what you mean.",
                "author": "jeankev",
                "score": 2
            },
            {
                "body": "Huh. Neat. Didn’t know language was in the user agent string.",
                "author": "SnappGamez",
                "score": 1
            },
            {
                "body": "In our case one of the requirements was to be absolutely bullet-proof regarding future changes for this kind of stuff, so no cookies whatsoever.",
                "author": "PancakeZombie",
                "score": 1
            },
            {
                "body": "It's not, that User is talking about the Accept-Language header",
                "author": "PrettyWhore",
                "score": 1
            },
            {
                "body": "Since it's about an \"essential only\" site, it's already a page without tracking.\n\nBut you can also do analytics without tracking (e.g. which pages get visited and how often or which actions are done).",
                "author": "Snapstromegon",
                "score": 1
            },
            {
                "body": "Yes I’m pretty sure everything that stays in sessionStorage is not subject to GPDR but pretty much everything else that can identify a user is (whether this user can be linked to a real person or not).",
                "author": "jeankev",
                "score": 1
            },
            {
                "body": "Oh.\n\nDidn’t know that was a thing either.",
                "author": "SnappGamez",
                "score": 1
            },
            {
                "body": "Does \"in this case\" mean \"be Github\"? 'cos I think that might have limited applicability.",
                "author": "devolute",
                "score": 1
            },
            {
                "body": "Seconded (developer from Italy here, if anyone's wondering).",
                "author": "misterakko",
                "score": 1
            },
            {
                "body": "It makes sense in the context of the project. And it was an interesting challenge. I didn't mind.",
                "author": "PancakeZombie",
                "score": 1
            },
            {
                "body": "Best solution: [GitHub.com](https://GitHub.com) \\- No tracking cookies, so no cookie banner required.",
                "author": "Snapstromegon",
                "score": -10
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1619568520.0,
        "title": "Do you have to add Cookie Banner to your website with basic Google Analytics?",
        "author": "technonymous1",
        "id": "n02bki",
        "selftext": "Hello r/web_design\n\nI was wondering how Cookie banners work with Google analytics. I heard that you don't have to put a cookie consent banner if you are using the basic version but with the advanced version you do (because it provides more detailed information). Can someone clarify this?\n\nAlso, what happens to websites that don't put cookie consent banners altogether if they ARE tracking data. Thanks!",
        "score": 22,
        "url": "https://www.reddit.com/r/web_design/comments/n02bki/do_you_have_to_add_cookie_banner_to_your_website/",
        "num_comments": 21,
        "comments": [
            {
                "body": "[deleted]",
                "author": null,
                "score": 17
            },
            {
                "body": "Depends on what you mean by targeted. As long as your users could be from the EU you need to follow GDPR. If you have a case where somehow there is no way a EU resident could access the site in any way then you could leave it out.",
                "author": "ExTheSea",
                "score": 7
            },
            {
                "body": "Web design is not the right place to ask this question, but I am an Analytics person so I will answer your question.\n\nThere is no such thing as Basic or Advanced versions of Google Analytics. The versions of Google Analytics are all the same in terms of the data they collect, and they all write first party cookies to your website (unless you are using a server-side implantation).\n\nSo whether you have just popped on the ‘basic’ GA snippet or added custom dimensions / metrics you will still need to add a cookie consent banner because GA sets first party cookies.\n\nThe Cookie Consent law is very vague and you can approach the banner in different ways, technically they don’t need to agree, there just needs to be a dismissible banner. That is how I read the law. I also don’t use the Cookie Consent banner on small sites or even medium sites, but I’m from the US so that probably makes a difference.",
                "author": "iFBGM",
                "score": 6
            },
            {
                "body": "That's certainly one way to look at it.\n\nThe other is, stop thinking you are entitled to mining and sharing everyone's information just because you feel like it and have grown accustomed to it.",
                "author": "human_brain_whore",
                "score": 6
            },
            {
                "body": "As much of a ball ache as GDPR is, it was added for the right reasons. It's basically there to say, \"don't be a d*ck\". Realistically, they aren't ever going to come down on you for just using Analytics. If you're slapping 10 different advertising cookies in the mix too then you should be getting consent first.",
                "author": "pau1phi11ips",
                "score": 6
            },
            {
                "body": "Yes.\n\nYou need to place a visible banner with a clickable action. **Cookies must be disabled by default** upon accessing the page (no tracking of any kind) and the banner must provide a question along these lines: \"*This websites uses 3^rd party cookies [...] check the box to consent or dismiss this banner*\".\n\nBy doing this, most users will  not accept anything and move along. Which is the intended behaviour: users must actively choose on their own if they want to be cookie-tracked or not. The overall impact on GA is huge, this is why most websites still ignore the rules and still offer dark patterns instead of be 100% GDPR compliant. Options like \"accept all\" or \"ok\" are not correct.",
                "author": "MarmotOnTheRocks",
                "score": 5
            },
            {
                "body": "\nIf you've been trying to figure out GDPR compliance for your organization, then you have probably heard the term “cookie consent.”Unfortunately, cookie consent is not some new fad diet that will be going away a few months into the new year. Unless, maybe, you consider slimming down your Google Analytics tracking a type of diet?\n\nCookie consent refers to getting permission from your website visitors to collect personal data.\n\nUnder GDPR, you are not allowed to collect personal data from your EEA users without their consent. So the bottom line is, no consent, no fancy tracking cookies!\n\nBut, you can collect this data for your visitors if they permit you.",
                "author": "be_hosted",
                "score": 4
            },
            {
                "body": "Seriously, just add a banner if it's your website.\nFurthermore, I would suggest using other tracking methods, like Plausible or Shynet (small server is enough to set this up). In most cases there is no reason for Google Analytics.",
                "author": "ExoWire",
                "score": 3
            },
            {
                "body": "I’m from the UK and a lot of American local news sites do this, they just completely block any IPs that are from Europe",
                "author": "ZonedV2",
                "score": 3
            },
            {
                "body": "[deleted]",
                "author": null,
                "score": 2
            },
            {
                "body": "I've been working with lawyers for the past 8 months and I tell you this. Almost every single website doesn't want to be 100% compliant. Everyone tries to find a way to avoid the rules. They all know the rules but they also want to be borderline legal to avoid ruining Analytics' numbers.",
                "author": "MarmotOnTheRocks",
                "score": 2
            },
            {
                "body": "As far as I know having the Cookie Consent Banner does not impact your Search Engine ranking, there are so many different ways to implement a cookie banner that it would be difficult for web crawlers to spot them.\n\nI’ve never seen anyone get in trouble with GDPR except for large companies with thousands of employees, but yes if you have a website and it’s assessable from the EU then you can get in legal trouble, even if you are in the US. It’s possible, but unlikely.",
                "author": "iFBGM",
                "score": 2
            },
            {
                "body": "It is not so easy to say whether they are better. But by being self-hosted and collecting less data, you protect the privacy of your visitors more, plus you don't have to send data to Google. Both solutions also work cookieless.\n\nIn my opinion, they still give you enough data about the website you embed them in.",
                "author": "ExoWire",
                "score": 2
            },
            {
                "body": "I see. Yes I can see how this would be detrimental to companies that rely more on data.",
                "author": "technonymous1",
                "score": 1
            },
            {
                "body": "From what I understood from my limited research, the GDPR rules are only applicable if your target audience is within the EU, so if all of their websites are targeted at the US then I think they are okay to just have a note saying that there are cookies on the page",
                "author": "Unequivocal_Hippo",
                "score": 1
            },
            {
                "body": "Interesting! I will keep that in mind",
                "author": "technonymous1",
                "score": 1
            },
            {
                "body": "I understand. Thanks!",
                "author": "technonymous1",
                "score": 1
            },
            {
                "body": "Are Plausible or Shynet better for analytics? I am really not collecting a lot of data it is a company website",
                "author": "technonymous1",
                "score": 1
            },
            {
                "body": "I understand. Thank you so much for your help :)",
                "author": "technonymous1",
                "score": 1
            },
            {
                "body": "Ya I get it. I am doing a company website so I am not doing any advertising or significant data collection just basic insights into UX",
                "author": "technonymous1",
                "score": 1
            },
            {
                "body": "I know that many news sites use this solution, but technically it is not a valid solution, because e.g. GDPR also applys for european citizens using a VPN or travelling outside of the EU.\n\nThe travelling stuff is a little vague in the law since it's talking about the transfer of data, but some lawyers consider the collection of data the first transfer, so I wouldn't mess with that.\n\nThat IP blocks are so commonly used has probably something to do with noone taking legal actions against them.",
                "author": "Snapstromegon",
                "score": 1
            },
            {
                "body": "Thanks so much for your response! If you don't have the banner on a small site with Google Analytics will you get punished by Googles ranking algorithm or is it just enforceable through the GDPR act as a law? Thanks!",
                "author": "technonymous1",
                "score": -2
            },
            {
                "body": "I will keep this in mind thanks so much.  If you don't have the banner on a small site with Google Analytics will you get punished by Googles ranking algorithm or is it just enforceable through the GDPR act as a law? Thanks!",
                "author": "technonymous1",
                "score": -2
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1682623799.0,
        "title": "IP-based Geo Redirection",
        "author": "HurricaneNedddy",
        "id": "1313fcy",
        "selftext": "Hello, I was wondering if there are any data privacy issues arising from implementing an IP based geo-redirection.  I presume we would not be storing the data.  This would be in the US and the EU.  \n\nIs it acceptable to redirect a user to a relevant country site based on their IP, without getting their consent?\n\nThanks in advance",
        "score": 0,
        "url": "https://www.reddit.com/r/web_design/comments/1313fcy/ipbased_geo_redirection/",
        "num_comments": 4,
        "comments": [
            {
                "body": "Yes, it’s acceptable",
                "author": "Max-Normal-88",
                "score": 1
            },
            {
                "body": "Acceptable, yes, but IP geolocation is notoriously inaccurate- you might want to treat that as a default and then provide a region picker.",
                "author": "SevaraB",
                "score": 1
            },
            {
                "body": "Thanks",
                "author": "HurricaneNedddy",
                "score": 1
            },
            {
                "body": "Thanks for the heads up",
                "author": "HurricaneNedddy",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1680740318.0,
        "title": "Social media share button code?",
        "author": "ModsRAnalNarcissists",
        "id": "12d32ue",
        "selftext": "I'm looking for html code that provides a dizzying array of share button options for social media. But it has to be free, and not like sharethis which incorporates a horrible, intrusive gdpr consent popup window. Otherwise I'd use sharethis. They must incorporate 20+ ways of sharing in their interface. Are there any alternatives?\n\nCheers",
        "score": 2,
        "url": "https://www.reddit.com/r/web_design/comments/12d32ue/social_media_share_button_code/",
        "num_comments": 1,
        "comments": [
            {
                "body": "[deleted]",
                "author": null,
                "score": 1
            },
            {
                "body": "Thanks!\n\nHow would you suggest I make this compatible with PCs?",
                "author": "ModsRAnalNarcissists",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1677312194.0,
        "title": "how to be gdpr and ccpa compliant in my Amazon Affiliate website?",
        "author": "MINGPLOSIONER",
        "id": "11bfmjd",
        "selftext": "I have a small website in which I put amazon referral links, I have share icons but I don't store any data of users. I only use Google analytics, google tag manager, etc, for SEO. My main audience is from USA and UK. \n1.What legal pages are necessary to have in my website (privacy policy, cookie policy, terms and conditions, etc)? \n2. What FREE plugin can I use to integrate those pages and put a cookie pop up?\n3. I want to be as much USA, Europe and UK compliant as possible, but with free plugins and policy generators I am a bit worried about not getting the legal pages correctly writen. I am not even gaining any money yet from this website because it is new and small website, so what realisticly would happen if I don't put these legal pages correctly?",
        "score": 2,
        "url": "https://www.reddit.com/r/web_design/comments/11bfmjd/how_to_be_gdpr_and_ccpa_compliant_in_my_amazon/",
        "num_comments": 2,
        "comments": []
    },
    {
        "subreddit": "web_design",
        "created": 1619688355.0,
        "title": "Has anyone used cookieconsent.com?",
        "author": "CarloEspresso",
        "id": "n10o0h",
        "selftext": "Hi everyone, I am interested in implementing cookieconsent.com on my website. Except Google analytics and a pop-up that appears every three days, I am not using any other cookie. So I guess this solution will be enough for me, but I just have to questions:\r\n\r\n- I don’t see any difference in their code with the e-privacy version and GDPR one? What’s the difference between the two?\r\n\r\n- Second question, (I think this one is a bit dumb sorry), let’s say I add the Google analytics code to the cookie consent JavaScript form provided by cookieconsent, do I have to remove the one already in place in the <body>?\r\n\r\nThanks a lot for your help.",
        "score": 6,
        "url": "https://www.reddit.com/r/web_design/comments/n10o0h/has_anyone_used_cookieconsentcom/",
        "num_comments": 10,
        "comments": [
            {
                "body": "e-privacy loads the scripts and you can only manage your preferences. The GDPR one loads them after you click \"I agree\", which is how it should be.\n\nYes, if you add them to cookieconsent you need to remove them from your HTML code. cookieconsent will load them for you based on the user's interaction.",
                "author": null,
                "score": 2
            },
            {
                "body": "I've been working with lawyers for the past months so I can tell you exactly what you need to do, if you want to be 100% compliant with zero dark patterns: all non-tech cookies must be disabled by default and the user must be able to dismiss the banner without \"agreeing\" anything. The cookie banner must offer an easy way to instantly refuse any cookie, something like this:\n\nhttps://i.imgur.com/W483Bk0.png\n\nBy NOT offering an easy one-click \"disagree\" button you're autmatically not compliant. End of story.\n\n**Google Analytics**: IF you're using Analytics with the *anonimze* option then you can skip the \"I disagree\" button but you still need to inform the user, of course. The \"I agree\" button becomes something like \"I understand\" or \"Ok\" because there is nothing to agree with.",
                "author": "MarmotOnTheRocks",
                "score": 2
            },
            {
                "body": "Thanks a lot @criting!\nIt makes more sense now.\n\nP.S. Just one last thing, on their website when I select GDPR, the code to copy and paste look identical, maybe I am missing something. But what does prevent the script to be loaded ?",
                "author": "CarloEspresso",
                "score": 2
            },
            {
                "body": "you are welcome!\n\nWhat prevents the scripts from loading is that they add **\"type=\"text/plain\" cookie-consent=\" functionality\"\"** to the script, which does not load them, once you click \"I agree\" it changes it to **type=\"text/javascript\"** and the script is being loaded.\n\nThe **cookie-consent=\" functionality\"\"** is being used if the user manages their preferences to load scripts only from a certrain category",
                "author": null,
                "score": 2
            },
            {
                "body": "Thank you so much again! 🙂",
                "author": "CarloEspresso",
                "score": 2
            },
            {
                "body": "Security chalu kar do",
                "author": "MoneyImpossible7617",
                "score": 1
            },
            {
                "body": "Cookie Consent (cookieconsent.com) is a free cookies management solution that you can integrate on your website that helps you comply with the EU Cookies Directive and GDPR.\nText of Your Cookie Consent Notice\n\nInclude brief details of why your website storescookies (improving the user experience, tailoring advertising, etc.) Provide a link to yourCookie and/or Privacy Policy. Let users know what they're agreeing to or accepting by taking some action",
                "author": "be_hosted",
                "score": 1
            },
            {
                "body": "Thank you.",
                "author": "CarloEspresso",
                "score": 1
            },
            {
                "body": "> once you click \"I agree\" it changes it to type=\"text/javascript\" and the script is being loaded.\n\n**Which is wrong** and not GDPR compiant *at all*. There should be an easy \"I disagree\" button where you disagree AND dismiss the banner forever. You should be able to dismiss the banner WITHOUT agreeing. And without being forced to dig into the options.\n\nThe entire GDPR thing revolves around \"asking the user to make a choice wether or not to accept the cookies\". The \"I agree\" button without a \"I don't agree\" is a (subtle) dark pattern, once again.\n\nEXCEPTION: if the website is using the anonimized Google Analytics code then you can ignore the \"disagree\" button. Any other scenario requires it.",
                "author": "MarmotOnTheRocks",
                "score": 1
            },
            {
                "body": "What about hostman, qovery, render and such? or is joining a pool a better option for you, had the script fail on me at my house I always think of Leupold scopes when I see my mistake since it's for intervals of 10 meters.\n\nThank Microsoft for not using a treadmill.",
                "author": "Pikaxtron",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1617958011.0,
        "title": "Is it shady to have the rest of a form appear after the email has been inputted?",
        "author": "HeWhoWalksTheEarth",
        "id": "mnczln",
        "selftext": " I have a form to download a free report (mostly B2B/B2G users). Fields are email, name, company, and consent to contact.\n\nI have seen forms in the past (e.g. Newsletter sign up) where only the email field is visible, and then after you input the email address the rest of the form appears.\n\nI suppose the reason is that a user sees a longer form - even just 5 fields - and thinks \"Hmm, I don't feel like putting in all that info.\" But if they've already given their email, then they've partially committed and are more likely to fill out the rest once it appears.\n\nBut for every user that hates forms, that I end up capturing, do I lose a user who thinks it's shady?\n\nI have not A/B tested this yet. I was wondering if anyone has any useful data or opinions as I couldn't find any resources through a Google search.\n\nThanks.",
        "score": 6,
        "url": "https://www.reddit.com/r/web_design/comments/mnczln/is_it_shady_to_have_the_rest_of_a_form_appear/",
        "num_comments": 7,
        "comments": [
            {
                "body": "Yes, it is a dark pattern in the way you seem to want to use it - ie, many users probably won't agree to the transaction if they knew what you're asking, so you're misleading them to get an initial \"commitment\" before revealing the full terms\n\n\"let's tell the user we're going to send them X if they send us A...but once they send us A, refuse to send them X unless they also send us B, C and D\"\n\nThe \"email address for white paper\" pattern isn't just to generate leads - it's to let the customer have an initial, low risk transaction with the business, in order to start building trust.  Don't jeopardise that trust right out of the gates\n\nThere are two ways to do multi-part forms properly.  First would be to make the requirements clear, ie, indicate before the user starts that there's going to be multiple parts.  Second would be to honour the initial agreement - ie, provide the report after the user provides the email address as advertised, and make the second step of the form optional",
                "author": "okwg",
                "score": 11
            },
            {
                "body": "Strictly from a user/site visitor perspective... I seriously dislike these type of forms. I also agree with previous commenter that it is a dark pattern when used how you describe.\n\nIf you can avoid doing this, I believe it more ethical to do so.",
                "author": "powofoto",
                "score": 5
            },
            {
                "body": "As a web dev and a user, anything I personally offer for free, I refuse to put behind a data wall because I think it’s just crap. I look at it as no longer being free once I have to pay them in information they’re going to sell or hound me with. I don’t think what you are doing is shady though. Just annoying and poor experience.",
                "author": "hitchy48",
                "score": 3
            },
            {
                "body": "Thanks for the advice. I think a part of me already knew this. If I had to ask then obviously it’s not kosher.",
                "author": "HeWhoWalksTheEarth",
                "score": 3
            },
            {
                "body": "I don’t think it’s bad then, and that is a very valid argument. You may want to indicate somehow that they are in a multi step flow of a form with a progress bar or step 1 step 2 etc. \n\n[check this form](https://imgur.com/gallery/aIpWgcA)\n\nThat’s an example, but anything like that may help the user by expecting to see another step.",
                "author": "hitchy48",
                "score": 3
            },
            {
                "body": "I’d be annoyed",
                "author": null,
                "score": 2
            },
            {
                "body": "There is an argument for giving free downloads away without collecting info, but we sell a very niche and very expensive product. We don't get a ton of downloads/leads, but the ones we do collect, tend to be very engaging. We end up with respectable open and engagement rates with the comms we send. \n\nI see it, with our product at least, that if you are unwilling to give us your email address when considering a $200k purchase, then you weren't a serious prospect to begin with.\n\nBut I was more concerned with the user experience as you mentioned. Does a user prefer to see all the fields up front and do I lose conversions by hiding until they've input the first answer?\n\nThanks for your opinion.",
                "author": "HeWhoWalksTheEarth",
                "score": 2
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1617954682.0,
        "title": "Incentivising cookie opt-in with a discount code",
        "author": "Funktopus_The",
        "id": "mncazi",
        "selftext": "People have been incentivising mailing list sign ups with discount codes for years. Does anyone know of a website that does the same thing with cookies? \n\nFrom my reading it appears to be legal (https://suzannedibble.com/gdpr-and-whether-you-can-incentivise-opt-ins/?doing_wp_cron=1617952852.7601900100708007812500, https://dma.org.uk/article/legal-hub-gdpr-practitioner-advice), but a key stakeholder at work wants to see an example of a company doing the same thing before we employ such a strategy.\n\nWould be hugely grateful if anyone had any examples.",
        "score": 2,
        "url": "https://www.reddit.com/r/web_design/comments/mncazi/incentivising_cookie_optin_with_a_discount_code/",
        "num_comments": 6,
        "comments": [
            {
                "body": "When you're *this* desperate to hold on to data mining. Jesus.\n\nGDPR2: Privacy Boogaloo cannot come quickly enough.",
                "author": "human_brain_whore",
                "score": 2
            },
            {
                "body": "Personalisation, loyalty rewards, A/B testing all fall under \"Functional cookies\" and you don't have to offer opt-in for these features.\n\nYes, even loyalty rewards.  \nA loyalty program is a core functionality of your business, the storing of this type of data is not subject to GDPR opt-in.\n\nYou have given three examples of data you only need to declare the storage of, unless you are also sharing this data to third parties.\n\nAnd if you are sharing this data to third parties, then I'll refer to my opinion above, GDPR2 can not come fast enough.",
                "author": "human_brain_whore",
                "score": 2
            },
            {
                "body": "What's important to note here is that the GDPR regulates *personal data*.\n\nA user choosing dark theme on your site is not personal data.\n\nA loyalty program is by its very definition opt-in, and a GDPR consent is natural to have as a pre-condition for *opting in.* Don't consent? You don't get the loyalty program, but you still get the core service.\n\nA/B testing is admittedly trickier. You will be processing data which one *can* argue is personal, and for a purpose not essential to the core service you're providing. I was too quick to jump to it not being personal data, when the truth is it's ambiguous enough that you cannot be certain it's safe from regulatory action. There's no precedent to tell us whether it is or not, yet.\n\nIt all depends on the scope of your A/B testing.\n\nIf your A/B testing is as simple as \"how many sales do we have on version 1, 2, and 3 respectively?\" then it is not processing personal data at all. There is literally no identifiable information of any kind being stored or processed.\n\nThe second it turns identifiable, then you're in opt-in territory.   \nFact of the matter is though a lot of A/B testing can be done entirely anonymously. A/B systems just aren't typically designed for being anonymous because the business doesn't give a shit.\n\nRegistering mouse coordinate data for instance, isn't inherently under the purview of the GDPR, it's only when you tie it to an identifier like a cookie or user ID that it is. Pretty much all A/B testing systems do that though, so it becomes a GDPR matter. \n\nSo the real question is, what kind of A/B testing is being done, what kind of data is being stored, and can it all be entirely anonymous... If it can be, then you're golden.\n\nPs. I feel like enticing opt-in is a fantastic way to get regulatory bodies on your ass. I wouldn't touch that with a ten-foot pole. \n\nPPs. We all need to ask ourselves as the ones creating these services if we're actually fighting tooth and nail for something that's actually beneficial, or if we're just used to a certain way of doing things and have an idea what we're doing is \"good for business\".",
                "author": "human_brain_whore",
                "score": 2
            },
            {
                "body": "Cookies enable a lot of functionality. Personalisation, A/B testing, loyalty rewards. It's not all about a Facebook Pixel.",
                "author": "Funktopus_The",
                "score": 1
            },
            {
                "body": "Can you provide a source that states that A/B testing is exempt from opt-in? I understand NCIL made a statement (in French) to this effect, but the same stakeholder at work wants to see evidence that the ICO also regards A/B testing, personalisation etc as exempt from opt-in before we treat it as such. \n\nIt's his belief that a cookie is only deemed as necessary for function if the site literally could not operate without it - eg cookies which store basket information. He doesn't think that providing the best experience possible counts as necessary.\n\nEdit: this information is not shared",
                "author": "Funktopus_The",
                "score": 1
            },
            {
                "body": ">If your A/B testing is as simple as \"how many sales do we have on version 1, 2, and 3 respectively?\" then it is not processing personal data at all. There is literally no identifiable information of any kind being stored or processed.\n\nThis is exactly the kind of testing we're doing, and is my primary concern - as my job relies on A/B testing as a tool. The A/B testing we conduct is entirely centered on page layout, and no personal data is collected - we can't even drill down into individual session data.\n\nHowever, [the ICO only gives three examples of cookies exempt from opt-in](https://ico.org.uk/for-organisations/guide-to-pecr/cookies-and-similar-technologies/#exemptions):\n\n>...you are unlikely to need consent for:  \n>  \n>• cookies used to remember the goods a user wishes to buy when they add goods to their online basket or proceed to the checkout on an internet shopping website;  \n>  \n>• session cookies providing security that is essential to comply with data protection security requirements for an online service the user has requested – eg online banking services; or  \n>  \n>• load-balancing cookies that ensure the content of your page loads quickly and effectively by distributing the workload across several computers.\n\nThe new Head of IT is incredibly risk-averse, and so interprets this as meaning that all A/B testing requires consent. \n\nThe only writing I can find about whether or not A/B testing is allowed without consent or as opt-out post-2018 comes from either cookie solution software providers (which have a strong incentive to say that we need to pay for their software in order to A/B test) and [this page,](https://www.convert.com/blog/privacy/analytics-and-a-b-testing-cookies-only-after-consent-in-europe/) which can only provide a solid statement on the issue from the French authorities. I need something to present to him as a credible source that makes the case that our A/B testing can continue without opt-in consent.",
                "author": "Funktopus_The",
                "score": 1
            }
        ]
    },
    {
        "subreddit": "web_design",
        "created": 1593555619.0,
        "title": "Huge NPO looking for web designers + PVSA Award",
        "author": "LumpySupermarket4",
        "id": "hixnkx",
        "selftext": "@everyone YASV (Youth Against Sexual Violence) is a PVSA certified, soon to be 501c4 (if the IRS hurries up because it’s been 2 months) nonprofit that targets sexual violence through tangible impact, nationally and locally. We are opening applications for ALL positions for the 2020-2021 season! We are looking for:\n-Journalists \n-Web Designers\n-Graphic Designers\n-Chapter Presidents\n-Executives for our PR, Finance, and Marketing Departments\n\nWe lobby for legislation that helps survivors, work with high schools and universities to bring consent education workshops to campuses, fundraise for victim relief, and other initiatives we would love for you to be apart of!  If you are interested in activism, politics, leadership, business, finance, social justice, computer science, journalism, etc, please apply! YASV is a great, active community with motivated high schoolers. \nThis is a great opportunity to add something unique to your resume, shoot for that Presidential Volunteer Service Award, impact your community, and gain leadership experience!\nIf interested, please fill out this application by July 10th: https://forms.gle/AbZahbDnwpGkCmoHA",
        "score": 0,
        "url": "https://www.reddit.com/r/web_design/comments/hixnkx/huge_npo_looking_for_web_designers_pvsa_award/",
        "num_comments": 8,
        "comments": [
            {
                "body": "Only for active students?",
                "author": "psychehacker",
                "score": 1
            },
            {
                "body": "[removed]",
                "author": null,
                "score": 1
            },
            {
                "body": "Wdym?",
                "author": "LumpySupermarket4",
                "score": 1
            },
            {
                "body": "This domain has been banned from /r/web_design.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/web_design) if you have any questions or concerns.*",
                "author": "AutoModerator",
                "score": 1
            },
            {
                "body": "Fresh-senior\nWhat about people not enrolled? Graduated? Who is your target ?",
                "author": "psychehacker",
                "score": 1
            },
            {
                "body": "Basically anyone is highschool/ 14-19 yr olds if you are gonna be a senior in the 2020-21 school year then you should be fine!",
                "author": "LumpySupermarket4",
                "score": 1
            },
            {
                "body": "I see, kind of odd to create a team of inexperienced students in vulnerable positions to work on something like this. Smells fishy. Goodluck",
                "author": "psychehacker",
                "score": 1
            },
            {
                "body": "Just trying to give highschoolers the chance to be apart of smth!",
                "author": "LumpySupermarket4",
                "score": 1
            }
        ]
    }
]